{"responses": {"1": {"url": "https://www.youtube.com/watch?v=vke-zoDaqug", "created_at": "2025-05-09T02:11:02.882257", "entries": {"pings": {"entries": [], "total_duration": 1}}}, "2": {"url": "https://www.youtube.com/watch?v=vke-zoDaqug&ab_channel=WorldHealthOrganizationRegionalOfficefortheWesternPacific", "created_at": "2025-05-09T02:23:52.715878", "entries": {"pings": {"entries": [], "total_duration": 180}}}, "3": {"url": "https://www.youtube.com/watch?v=UzIKWnZJ29s&ab_channel=Mashable", "created_at": "2025-05-09T02:27:03.760940", "entries": {"pings": {"entries": [{"id": 2, "start": 6.639999866485596, "end": 15.4399995803833, "claim_text": "B.O.B. declared to his Twitter followers that he believes the planet Earth is actually flat and that all the nations of the world have joined together in a massive conspiracy to cover up this fact.", "debunking_information": "The claim that all nations have joined a massive conspiracy to hide the Earth's shape is a baseless conspiracy theory with no credible evidence.", "severity": "high", "misinformation_type": "factual"}, {"id": 4, "start": 17.8799991607666, "end": 25.739999771118164, "claim_text": "They believe the Earth is a flat disk which looks like this. The North Pole is at the center with Antarctica forming an ice wall around the outer edges of the disk.", "debunking_information": "The Earth is an oblate spheroid, not a flat disk, and Antarctica is a continent at the South Pole, not an ice wall surrounding a flat Earth.", "severity": "high", "misinformation_type": "factual"}, {"id": 5, "start": 25.81999969482422, "end": 32.97999954223633, "claim_text": "This is why Flat Earthers believe the 1961 Antarctic Treaty was agreed upon by all the world's nations so no one could reach the edge of the disk.", "debunking_information": "The Antarctic Treaty was established to preserve Antarctica for peaceful scientific research, not to prevent access to a supposed edge of a flat Earth.", "severity": "high", "misinformation_type": "factual"}, {"id": 6, "start": 32.97999954223633, "end": 36.41999816894531, "claim_text": "They believe that this is the reason the UN uses this as their symbol.", "debunking_information": "The UN emblem is a map projection of the world centered on the North Pole, symbolizing global unity, not a reference to a flat Earth or Antarctic ice wall.", "severity": "high", "misinformation_type": "factual"}, {"id": 7, "start": 36.41999816894531, "end": 43.779998779296875, "claim_text": "There is also a dome-like barrier called the firmament which surrounds the disk. This is an impenetrable barrier that keeps the atmosphere intact.", "debunking_information": "There is no scientific evidence for a dome-like firmament surrounding the Earth; the atmosphere is held by gravity in a spherical Earth model.", "severity": "high", "misinformation_type": "factual"}, {"id": 9, "start": 47.02000045776367, "end": 49.7400016784668, "claim_text": "According to Flat Earth theory, gravity does not exist.", "debunking_information": "Gravity is a well-established scientific phenomenon explained by physics and observed in numerous experiments and applications.", "severity": "high", "misinformation_type": "factual"}, {"id": 10, "start": 49.7400016784668, "end": 58.619998931884766, "claim_text": "Instead they believe in the universal acceleration, believing that all celestial bodies are accelerating upward at a rate of 9.8 meters per second squared.", "debunking_information": "The concept of universal upward acceleration contradicts observed physics and celestial mechanics, which are explained by gravity and orbital dynamics.", "severity": "high", "misinformation_type": "factual"}, {"id": 11, "start": 58.619998931884766, "end": 70.45999908447266, "claim_text": "They also believe that Earth is not actually spinning and provide counter evidence to disprove the rotation of the planet such as the fact that clouds in the atmosphere are not moving at the rate of 1,000 miles per hour, the rate of the Earth's rotation.", "debunking_information": "The Earth's rotation is well-documented and measurable; atmospheric phenomena like cloud movement are influenced by many factors and do not negate Earth's rotation.", "severity": "high", "misinformation_type": "factual"}, {"id": 12, "start": 70.45999908447266, "end": 82.94000244140625, "claim_text": "Flat Earthers believe that when Copernicus theorized that the Earth moved around the sun, all of the world's religions decided to accept his theories and rather than risk being questioned, the world's religions have a vested interest in furthering the Earth globe idea.", "debunking_information": "This claim oversimplifies history and inaccurately portrays the complex relationship between science and religion; many religious groups have diverse views on cosmology.", "severity": "high", "misinformation_type": "factual"}, {"id": 13, "start": 82.94000244140625, "end": 92.69999694824219, "claim_text": "In turn, Flat Earthers believe that all imagery from the space program has been faked. Some of the most common pieces of evidence are the lack of direct commercial flights between two cities within the southern hemisphere.", "debunking_information": "Space imagery is verified by multiple independent sources; the lack of certain direct flights is due to economic and logistical reasons, not evidence of a conspiracy.", "severity": "high", "misinformation_type": "factual"}], "total_duration": 92.69999694824219}}}, "4": {"url": "https://www.youtube.com/watch?v=KJvsp3Ayzss&ab_channel=ArirangNews", "created_at": "2025-05-09T02:47:33.806179", "entries": {"pings": {"entries": [{"id": 1, "start": 27.040000915527344, "end": 33.84000015258789, "claim_text": "There were around 60 cases of hemorrhagic stroke per 10 million given the Pfizer vaccine.", "debunking_information": "Current evidence does not support a clear causal link between the Pfizer COVID-19 vaccine and hemorrhagic stroke at this rate; this figure appears to be unverified or exaggerated.", "severity": "high", "misinformation_type": "factual"}], "total_duration": 33.84000015258789}}}}}