"{'text': \"Gat, Gat everywhere. In Yemen, this poisonous plant has a daily schedule. I am Sheikh Al-Haysi, this is the best type of Gat. All types of Gat. From the dawn of history, Gat has been an inseparable part of Yemen's history, and even today, in the media. Of course, this is number one. Yemen is a place that sometimes looks strange and strange. In this article, there are pictures of us, the Israelis, that look funny. But the addiction to Gat in Yemen is a very serious business. The Center for Strategic Research published data from recent years on the poisonous effect of Gat on the lives of Yemenis. The vast majority of Yemeni men are addicted to Gat, and so are a third of the people. 20% of families in Yemen are on the streets because of Gat, and a third of Yemen's water supply goes to Gat, while Yemen is in a serious water crisis. And what does the person who experienced Yemen from the inside have to say? Moshe Yarimi, a Jew from Yemen, was sent by Israel to Yemen in the 1990s to help the last Yemeni Jews. We met him at the Gat Akiva store in Rosh HaAyin. Today, Yemen is divided into several control zones, and the Jews control only one of them. And yet, Gat's messengers are allowed to cross over to the enemy's lines. And where does all this business of Gat come from during the war against Israel and the attacks of the Jews? In many articles that came from Yemen last year, we saw the Jews carrying Gat in their mouths, showing anger or injuring themselves after American attacks. The growth of Gat and the sugar in the crop have been a central part of the Gat's economy for years. But a few years ago, they realized they were in trouble. The separation is the consumption of Gat. There is no doubt that it causes a lot of trouble. I call on all those who separate, who separate in the consumption of Gat, I call on all those who separate, I call on all those who separate. The vast majority of the basic food products, for example, 90% of the wheat, will come to Yemen. The Saudis have even stopped the wheat, realizing they have to divide the market. The wheat has a new campaign, and they claim they will help farmers who have to plant their Gat seeds. We are distributing 1,000 sacks to the farmers. We are planting trees on Gat, trees on Akka, on Mishu Mishu, on Lod. For years, the governments that replaced them in Yemen have announced the need for Gat. It is unlikely that a stupid person will try to rebel. Now there are initiatives to reduce the impact of the pesticide plant on Yemen, but it is hard to believe that someone will succeed in making this change. The Gat plant is the flesh and blood of Yemen.\", 'segments': [{'id': 0, 'start': 0.0, 'end': 10.0, 'text': ' Gat, Gat everywhere. In Yemen, this poisonous plant has a daily schedule.'}, {'id': 1, 'start': 10.0, 'end': 13.0, 'text': ' I am Sheikh Al-Haysi, this is the best type of Gat.'}, {'id': 2, 'start': 13.0, 'end': 16.0, 'text': ' All types of Gat.'}, {'id': 3, 'start': 16.0, 'end': 20.0, 'text': \" From the dawn of history, Gat has been an inseparable part of Yemen's history,\"}, {'id': 4, 'start': 20.0, 'end': 22.0, 'text': ' and even today, in the media.'}, {'id': 5, 'start': 22.0, 'end': 27.0, 'text': ' Of course, this is number one.'}, {'id': 6, 'start': 31.0, 'end': 35.0, 'text': ' Yemen is a place that sometimes looks strange and strange.'}, {'id': 7, 'start': 35.0, 'end': 38.0, 'text': ' In this article, there are pictures of us, the Israelis, that look funny.'}, {'id': 8, 'start': 38.0, 'end': 41.0, 'text': ' But the addiction to Gat in Yemen is a very serious business.'}, {'id': 9, 'start': 45.0, 'end': 49.0, 'text': ' The Center for Strategic Research published data from recent years'}, {'id': 10, 'start': 49.0, 'end': 51.0, 'text': ' on the poisonous effect of Gat on the lives of Yemenis.'}, {'id': 11, 'start': 51.0, 'end': 55.0, 'text': ' The vast majority of Yemeni men are addicted to Gat, and so are a third of the people.'}, {'id': 12, 'start': 55.0, 'end': 58.0, 'text': ' 20% of families in Yemen are on the streets because of Gat,'}, {'id': 13, 'start': 58.0, 'end': 61.0, 'text': \" and a third of Yemen's water supply goes to Gat,\"}, {'id': 14, 'start': 61.0, 'end': 63.0, 'text': ' while Yemen is in a serious water crisis.'}, {'id': 15, 'start': 73.0, 'end': 75.0, 'text': ' And what does the person who experienced Yemen from the inside have to say?'}, {'id': 16, 'start': 75.0, 'end': 79.0, 'text': ' Moshe Yarimi, a Jew from Yemen, was sent by Israel to Yemen in the 1990s'}, {'id': 17, 'start': 79.0, 'end': 82.0, 'text': ' to help the last Yemeni Jews.'}, {'id': 18, 'start': 82.0, 'end': 85.0, 'text': ' We met him at the Gat Akiva store in Rosh HaAyin.'}, {'id': 19, 'start': 113.0, 'end': 116.0, 'text': ' Today, Yemen is divided into several control zones,'}, {'id': 20, 'start': 116.0, 'end': 118.0, 'text': ' and the Jews control only one of them.'}, {'id': 21, 'start': 118.0, 'end': 121.0, 'text': \" And yet, Gat's messengers are allowed to cross over to the enemy's lines.\"}, {'id': 22, 'start': 128.0, 'end': 130.0, 'text': ' And where does all this business of Gat come from'}, {'id': 23, 'start': 130.0, 'end': 133.0, 'text': ' during the war against Israel and the attacks of the Jews?'}, {'id': 24, 'start': 136.0, 'end': 139.0, 'text': ' In many articles that came from Yemen last year,'}, {'id': 25, 'start': 139.0, 'end': 141.0, 'text': ' we saw the Jews carrying Gat in their mouths,'}, {'id': 26, 'start': 141.0, 'end': 144.0, 'text': ' showing anger or injuring themselves after American attacks.'}, {'id': 27, 'start': 148.0, 'end': 150.0, 'text': ' The growth of Gat and the sugar in the crop'}, {'id': 28, 'start': 150.0, 'end': 153.0, 'text': \" have been a central part of the Gat's economy for years.\"}, {'id': 29, 'start': 153.0, 'end': 155.0, 'text': ' But a few years ago, they realized they were in trouble.'}, {'id': 30, 'start': 155.0, 'end': 158.0, 'text': ' The separation is the consumption of Gat.'}, {'id': 31, 'start': 158.0, 'end': 161.0, 'text': ' There is no doubt that it causes a lot of trouble.'}, {'id': 32, 'start': 161.0, 'end': 164.0, 'text': ' I call on all those who separate,'}, {'id': 33, 'start': 164.0, 'end': 167.0, 'text': ' who separate in the consumption of Gat,'}, {'id': 34, 'start': 167.0, 'end': 169.0, 'text': ' I call on all those who separate,'}, {'id': 35, 'start': 169.0, 'end': 171.0, 'text': ' I call on all those who separate.'}, {'id': 36, 'start': 171.0, 'end': 173.0, 'text': ' The vast majority of the basic food products,'}, {'id': 37, 'start': 173.0, 'end': 175.0, 'text': ' for example, 90% of the wheat,'}, {'id': 38, 'start': 175.0, 'end': 176.0, 'text': ' will come to Yemen.'}, {'id': 39, 'start': 176.0, 'end': 178.0, 'text': ' The Saudis have even stopped the wheat,'}, {'id': 40, 'start': 178.0, 'end': 180.0, 'text': ' realizing they have to divide the market.'}, {'id': 41, 'start': 180.0, 'end': 182.0, 'text': ' The wheat has a new campaign,'}, {'id': 42, 'start': 182.0, 'end': 184.0, 'text': ' and they claim they will help farmers'}, {'id': 43, 'start': 184.0, 'end': 186.0, 'text': ' who have to plant their Gat seeds.'}, {'id': 44, 'start': 186.0, 'end': 189.0, 'text': ' We are distributing 1,000 sacks to the farmers.'}, {'id': 45, 'start': 189.0, 'end': 191.0, 'text': ' We are planting trees on Gat,'}, {'id': 46, 'start': 191.0, 'end': 194.0, 'text': ' trees on Akka, on Mishu Mishu, on Lod.'}, {'id': 47, 'start': 194.0, 'end': 196.0, 'text': ' For years, the governments that replaced them in Yemen'}, {'id': 48, 'start': 196.0, 'end': 198.0, 'text': ' have announced the need for Gat.'}, {'id': 49, 'start': 199.0, 'end': 202.0, 'text': ' It is unlikely that a stupid person will try to rebel.'}, {'id': 50, 'start': 202.0, 'end': 204.0, 'text': ' Now there are initiatives to reduce the impact'}, {'id': 51, 'start': 204.0, 'end': 206.0, 'text': ' of the pesticide plant on Yemen,'}, {'id': 52, 'start': 206.0, 'end': 208.0, 'text': ' but it is hard to believe that someone will succeed'}, {'id': 53, 'start': 208.0, 'end': 209.0, 'text': ' in making this change.'}, {'id': 54, 'start': 209.0, 'end': 212.0, 'text': ' The Gat plant is the flesh and blood of Yemen.'}]}"