"{'text': \"20 years since he was assassinated and the story of Madeleine McCain continues to catch up with headlines around the world. Here's one in the front of the Sun today, and I was going through it with Ellie earlier, and it just makes me sick. It really makes me sick. The Sun newspaper and the four American channels revealed in a documentary film that was released yesterday the ideas that lead to the assassination in Germany. To think that this man, Christian Bruckner, kidnapped and murdered Madeleine on a public place in Portugal. If we can show pictures of him at key Madeleine locations, we can place him at the scene of an alleged confession. We've got stories where he describes his wish to abduct small children. The ideas were revealed in 2016 at an assassination at Bruckner's office. The police who searched the place found dozens of children's swimsuits, tattoos, chemical substances, bullets, and even a picture of small girls. But the more the gun looks, the more it seems that the police are kidnappers who were found in Bruckner's dog's grave. The kidnappers are a lot of pedophilic substances. To cut to the chase, Madeleine McCain, a British 3-year-old girl, went out with her parents in Portugal. At one of the Arabs' homes, the parents went out to dinner close to the room and left the old children when the adult came to check that everything was fine. At 10pm that night, they discovered that Madeleine, Nelma, was in her bed. The bedroom door, where the three children were sleeping, was open much further than we'd left it. I went to close it to about here, and then as I got to here, it suddenly slammed. And literally as I went back in, the curtains of the bedroom, which were drawn, were closed. It was like a gust of wind kind of just blew them open. I mean, I knew straight away that she'd been taken. The investigation was carried out in several countries. Suspects were arrested and released. The parents were also suspected at some point. But then, about five years ago, Zohar Bruckner became the main suspect. Bruckner, a German citizen, sits in prison for adultery. In Germany, he was sentenced a year ago to several years in prison for child molestation, but in October, the court dismissed him. We believe that the decision is wrong, so we will appeal to the Bundesgerichtshof, the German Supreme Court. Bruckner is still not guilty of Madeleine's murder. There are no conclusive evidence, and he denies it. But in Germany, he murdered her. And do you have no doubt that Madeleine McCann has been murdered? Yes. Because of the evidence we have, there's no doubt. Madeleine McCann is dead, and Christian B. murdered her. At this point, time is running out. If there is no further investigation against Bruckner, or if the court decision does not change, this man will be released in September. I can't say if the evidence in the Medi-Case will be enough for an arrest warrant in the Medi-Case. This week, Madeleine's family members were sentenced to 18 years in prison for child molestation. This young, blonde girl was sentenced to death, despite the latest developments, which may never be known.\", 'segments': [{'id': 0, 'start': 0.0, 'end': 4.71999979019165, 'text': ' 20 years since he was assassinated and the story of Madeleine McCain continues to catch up with headlines around the world.'}, {'id': 1, 'start': 4.71999979019165, 'end': 10.15999984741211, 'text': \" Here's one in the front of the Sun today, and I was going through it with Ellie earlier, and it just makes me sick.\"}, {'id': 2, 'start': 10.15999984741211, 'end': 11.359999656677246, 'text': ' It really makes me sick.'}, {'id': 3, 'start': 11.359999656677246, 'end': 15.4399995803833, 'text': ' The Sun newspaper and the four American channels revealed in a documentary film that was released yesterday'}, {'id': 4, 'start': 15.4399995803833, 'end': 18.040000915527344, 'text': ' the ideas that lead to the assassination in Germany.'}, {'id': 5, 'start': 18.040000915527344, 'end': 23.920000076293945, 'text': ' To think that this man, Christian Bruckner, kidnapped and murdered Madeleine on a public place in Portugal.'}, {'id': 6, 'start': 23.920000076293945, 'end': 30.799999237060547, 'text': ' If we can show pictures of him at key Madeleine locations, we can place him at the scene of an alleged confession.'}, {'id': 7, 'start': 30.799999237060547, 'end': 37.31999969482422, 'text': \" We've got stories where he describes his wish to abduct small children.\"}, {'id': 8, 'start': 37.31999969482422, 'end': 41.79999923706055, 'text': \" The ideas were revealed in 2016 at an assassination at Bruckner's office.\"}, {'id': 9, 'start': 41.79999923706055, 'end': 45.91999816894531, 'text': \" The police who searched the place found dozens of children's swimsuits,\"}, {'id': 10, 'start': 45.91999816894531, 'end': 52.0, 'text': ' tattoos, chemical substances, bullets, and even a picture of small girls.'}, {'id': 11, 'start': 52.0, 'end': 58.79999923706055, 'text': \" But the more the gun looks, the more it seems that the police are kidnappers who were found in Bruckner's dog's grave.\"}, {'id': 12, 'start': 58.79999923706055, 'end': 61.47999954223633, 'text': ' The kidnappers are a lot of pedophilic substances.'}, {'id': 13, 'start': 74.63999938964844, 'end': 79.95999908447266, 'text': ' To cut to the chase, Madeleine McCain, a British 3-year-old girl, went out with her parents in Portugal.'}, {'id': 14, 'start': 79.95999908447266, 'end': 84.4800033569336, 'text': \" At one of the Arabs' homes, the parents went out to dinner close to the room and left the old children\"}, {'id': 15, 'start': 84.4800033569336, 'end': 87.72000122070312, 'text': ' when the adult came to check that everything was fine.'}, {'id': 16, 'start': 87.72000122070312, 'end': 92.36000061035156, 'text': ' At 10pm that night, they discovered that Madeleine, Nelma, was in her bed.'}, {'id': 17, 'start': 92.36000061035156, 'end': 98.36000061035156, 'text': \" The bedroom door, where the three children were sleeping, was open much further than we'd left it.\"}, {'id': 18, 'start': 98.36000061035156, 'end': 106.44000244140625, 'text': ' I went to close it to about here, and then as I got to here, it suddenly slammed.'}, {'id': 19, 'start': 106.44000244140625, 'end': 113.5199966430664, 'text': ' And literally as I went back in, the curtains of the bedroom, which were drawn, were closed.'}, {'id': 20, 'start': 113.5199966430664, 'end': 117.72000122070312, 'text': ' It was like a gust of wind kind of just blew them open.'}, {'id': 21, 'start': 117.72000122070312, 'end': 123.5999984741211, 'text': \" I mean, I knew straight away that she'd been taken.\"}, {'id': 22, 'start': 123.5999984741211, 'end': 127.19999694824219, 'text': ' The investigation was carried out in several countries. Suspects were arrested and released.'}, {'id': 23, 'start': 127.19999694824219, 'end': 129.75999450683594, 'text': ' The parents were also suspected at some point.'}, {'id': 24, 'start': 129.75999450683594, 'end': 135.75999450683594, 'text': ' But then, about five years ago, Zohar Bruckner became the main suspect.'}, {'id': 25, 'start': 135.8000030517578, 'end': 139.72000122070312, 'text': ' Bruckner, a German citizen, sits in prison for adultery.'}, {'id': 26, 'start': 139.72000122070312, 'end': 143.8000030517578, 'text': ' In Germany, he was sentenced a year ago to several years in prison for child molestation,'}, {'id': 27, 'start': 143.8000030517578, 'end': 146.9199981689453, 'text': ' but in October, the court dismissed him.'}, {'id': 28, 'start': 146.9199981689453, 'end': 155.1199951171875, 'text': ' We believe that the decision is wrong, so we will appeal to the Bundesgerichtshof, the German Supreme Court.'}, {'id': 29, 'start': 155.1199951171875, 'end': 157.44000244140625, 'text': \" Bruckner is still not guilty of Madeleine's murder.\"}, {'id': 30, 'start': 157.44000244140625, 'end': 160.0, 'text': ' There are no conclusive evidence, and he denies it.'}, {'id': 31, 'start': 160.0, 'end': 162.9199981689453, 'text': ' But in Germany, he murdered her.'}, {'id': 32, 'start': 162.9199981689453, 'end': 166.8000030517578, 'text': ' And do you have no doubt that Madeleine McCann has been murdered?'}, {'id': 33, 'start': 166.8000030517578, 'end': 172.39999389648438, 'text': \" Yes. Because of the evidence we have, there's no doubt.\"}, {'id': 34, 'start': 172.39999389648438, 'end': 177.0, 'text': ' Madeleine McCann is dead, and Christian B. murdered her.'}, {'id': 35, 'start': 177.0, 'end': 178.47999572753906, 'text': ' At this point, time is running out.'}, {'id': 36, 'start': 178.47999572753906, 'end': 182.47999572753906, 'text': ' If there is no further investigation against Bruckner, or if the court decision does not change,'}, {'id': 37, 'start': 182.47999572753906, 'end': 185.1999969482422, 'text': ' this man will be released in September.'}, {'id': 38, 'start': 185.1999969482422, 'end': 192.27999877929688, 'text': \" I can't say if the evidence in the Medi-Case will be enough for an arrest warrant in the Medi-Case.\"}, {'id': 39, 'start': 192.27999877929688, 'end': 197.16000366210938, 'text': \" This week, Madeleine's family members were sentenced to 18 years in prison for child molestation.\"}, {'id': 40, 'start': 197.16000366210938, 'end': 200.32000732421875, 'text': ' This young, blonde girl was sentenced to death,'}, {'id': 41, 'start': 200.32000732421875, 'end': 204.32000732421875, 'text': ' despite the latest developments, which may never be known.'}]}"