"{'text': \"President Trump's about to hold a news conference. We'll watch for that Oval Office announcing what he calls a full and comprehensive trade deal with the United Kingdom. The first in what the White House hopes will be a series of agreements designed to level the field with America's trading partners around the world. And markets jumping a bit higher on the news. You can see that there. Just a little bit of a bump up and we will take it on a day where we could even also have a Pope announcement today. Maybe this hour. I thought it was going to be a big hour. I wouldn't leave your TV. I think the Treasury Secretary, Scott Besson, you know, he's got big meetings this coming weekend with the Chinese. They're gonna meet up in Switzerland. I think it was kind of a last-minute deal that they arranged. But it's a good thing because they're gonna start the process of starting the talks. Yes. Which throughout this whole little winding trip here, we all pretty much know. You have to have a negotiation even to start talking. Yeah, but that but but that road begins in Washington and it ends in Beijing and somehow someway at some point they're gonna have to reach a deal. Via Switzerland. All right. For more on this, Hugh Hewitt is a radio talk show host and a Fox News contributor. Hi, Hugh. Good to see you. You talked to President Trump. Let's play a little bit of that. You know, we had China making a trillion dollars. Think of it. A trillion dollars under Biden. A trillion dollars more, actually. Six billion dollars a day. We were losing on trade. We'll see how it goes. We have a big meeting on Saturday in Switzerland with some of the guys going over there. Scott and some other guys, very good guys. So within this hour, we will probably hear from the president, scheduled for about 29 minutes from now, about the UK. What else did you take away from that conversation? Well, I added in Jimmy Lai to the conversation about Chinese negotiations because the Chinese dissident is probably struggling to stay alive. And his son comes and makes the rounds in American media. And President Trump and Secretary of State Rubio have both emphasized Jimmy Lai's got to get out of prison before he dies. So they're gonna add that on the table in Switzerland. That was important. But mostly the key takeaway that made the news is the president said, again, Iran has two choices and only two. Either we bomb you nicely or we bomb you gently. Or we destroy the centrifuges nicely or we bomb you viciously. And I think he's made that very abundantly clear. Every program, everywhere he appears, you can have one from column A or you get column B. And I like that message. It was very clear yesterday. Okay, let's move to Iran. You asked him about that as well. Key comments from the president. Then I'll follow up with J.D. Vance. Watch here. I'd much rather make a deal, you know, a really verified deal. We want total verification. We can do that. But I would much prefer a strong, verified deal where we actually blow them up. But blow them up or just denuke them. But the other alternative, there are only two alternatives there. Blow them up nicely or blow them up viciously. You can react to that, Hugh. And I think what J.D. Vance said later in the day, he says there is a deal here that would really bring Iran into the global economy. Now, that was one of the appeals that they were making to Kim Jong-un in North Korea when they met in Vietnam. In the end, that deal did not get done. Do you think Iran is in a different posture, that they would want to be a part of it? Yes, Bill, I do. I think Iran is about to collapse financially. Yeah, they're about to collapse financially. They didn't have enough fuel during the winter. Their vulnerability after the Israeli strikes to air attacks is complete. Their proxies have been destroyed. The Houthis have thrown in the towel after President Trump turned up the heat. So whatever Ayatollah Khamenei wants to do, the supreme leader, he has at his back only the IRGC. And he has a very restless population that has tried to rise up two or three different times. Under this president, they would get support. Under the past president, they wouldn't have. They didn't when President Obama took office and there was the attempt at a green revolution in Iran. So I think their back is against the wall. And if they want to sacrifice everything, our B-2s are parked at Diego Garcia, along with the IDF's fighter pilots and our two carrier groups. They don't stand a chance. They really don't want it to come to blows. And I think what the president said yesterday is they have to make a choice. We bomb them or we go in and we watch them blow up their centrifuges and turn over their enriched uranium. It's very clear. Hugh, also, we have seen that President Biden and the former first lady, they are out and about doing a little media tour in advance of some of these books that are coming out about them and questioning them. You asked President Trump about Biden and competency yesterday. Here's what he said. Well, I don't think he was competent 40 years ago. He was a very average guy. Look at his look at his credentials academically. Look at his look at, you know, look at his old life. He was a glad hander. You know, Helen Hardy had a good personality, but he was a vicious guy. You know, you saw that here. He knew enough to know to go after his opponent. He went after his political opponent. You know, I think it's going to be a long road for the Bidens to try to have some sort of semblance of a good legacy. And I don't know if this media tour will help or hurt them. What do you think? Dan, I don't know how President Biden gets out of the hole he dug for himself. President Trump went on to talk about the famous debate, which basically blew up the Biden campaign and how bad the makeup was and how bad President Biden performed and how it became very obvious very quickly that it was going to be a disaster for President Biden. So we talked about that yesterday. I don't think it's a good idea for President Biden to do interviews with Dr. Biden. I think if he wants to try and rehab his image, he's got to sit down with people like you and Bill or with me or any of the hosts that will ask him fair, competent questions and demonstrate competence. Because the question at the end became, do we have a president for about six months? You know how well how often presidents appear in front of the public. He's just missing in action. And we got through it. Thank goodness. But if he wants to rehab his reputation, he's going to have to do one on ones that aren't softballs and aren't controlled. So you're saying doing The View today is not going to answer the mail. Just kidding. You don't have to answer that. Thanks so much. I will. They will prop him up. They will prop him up. Thank you. He needs to talk to you, too. He needs to talk to friendly, competent people. He's welcome here. We got a chair there. Come on. Thank you, Hugh. Nice to see you. I'm Steve Doocy. I'm Brian Kilmeade. And I'm Ainsley Earhart. And click here to subscribe to the Fox News YouTube page to catch our hottest interviews and most compelling analysis.\", 'segments': [{'id': 0, 'start': 0.0, 'end': 5.800000190734863, 'text': \" President Trump's about to hold a news conference. We'll watch for that Oval Office announcing what he calls a full and comprehensive trade deal\"}, {'id': 1, 'start': 6.239999771118164, 'end': 9.520000457763672, 'text': ' with the United Kingdom. The first in what the White House hopes'}, {'id': 2, 'start': 9.800000190734863, 'end': 14.960000038146973, 'text': \" will be a series of agreements designed to level the field with America's trading partners around the world.\"}, {'id': 3, 'start': 15.079999923706055, 'end': 19.059999465942383, 'text': ' And markets jumping a bit higher on the news. You can see that there.'}, {'id': 4, 'start': 19.059999465942383, 'end': 24.799999237060547, 'text': ' Just a little bit of a bump up and we will take it on a day where we could even also have a Pope'}, {'id': 5, 'start': 25.479999542236328, 'end': 27.479999542236328, 'text': ' announcement today. Maybe this hour.'}, {'id': 6, 'start': 27.479999542236328, 'end': 29.479999542236328, 'text': \" I thought it was going to be a big hour. I wouldn't leave your TV.\"}, {'id': 7, 'start': 30.68000030517578, 'end': 35.20000076293945, 'text': \" I think the Treasury Secretary, Scott Besson, you know, he's got big meetings this coming weekend with the Chinese.\"}, {'id': 8, 'start': 35.20000076293945, 'end': 36.400001525878906, 'text': \" They're gonna meet up in Switzerland.\"}, {'id': 9, 'start': 36.400001525878906, 'end': 38.880001068115234, 'text': ' I think it was kind of a last-minute deal that they arranged.'}, {'id': 10, 'start': 38.880001068115234, 'end': 43.959999084472656, 'text': \" But it's a good thing because they're gonna start the process of starting the talks.\"}, {'id': 11, 'start': 44.040000915527344, 'end': 48.20000076293945, 'text': ' Yes. Which throughout this whole little winding trip here, we all pretty much know.'}, {'id': 12, 'start': 48.20000076293945, 'end': 50.15999984741211, 'text': ' You have to have a negotiation even to start talking.'}, {'id': 13, 'start': 50.15999984741211, 'end': 56.2400016784668, 'text': ' Yeah, but that but but that road begins in Washington and it ends in Beijing and somehow someway at some point'}, {'id': 14, 'start': 56.2400016784668, 'end': 58.31999969482422, 'text': \" they're gonna have to reach a deal. Via Switzerland.\"}, {'id': 15, 'start': 58.31999969482422, 'end': 62.119998931884766, 'text': ' All right. For more on this, Hugh Hewitt is a radio talk show host and a Fox News contributor.'}, {'id': 16, 'start': 62.119998931884766, 'end': 65.5, 'text': \" Hi, Hugh. Good to see you. You talked to President Trump. Let's play a little bit of that.\"}, {'id': 17, 'start': 68.04000091552734, 'end': 74.72000122070312, 'text': ' You know, we had China making a trillion dollars. Think of it. A trillion dollars under Biden. A trillion dollars more, actually.'}, {'id': 18, 'start': 75.36000061035156, 'end': 77.36000061035156, 'text': ' Six billion dollars a day.'}, {'id': 19, 'start': 78.04000091552734, 'end': 84.12000274658203, 'text': \" We were losing on trade. We'll see how it goes. We have a big meeting on\"}, {'id': 20, 'start': 84.5999984741211, 'end': 86.5999984741211, 'text': ' Saturday in Switzerland'}, {'id': 21, 'start': 86.95999908447266, 'end': 91.27999877929688, 'text': ' with some of the guys going over there. Scott and some other guys, very good guys.'}, {'id': 22, 'start': 91.63999938964844, 'end': 98.16000366210938, 'text': ' So within this hour, we will probably hear from the president, scheduled for about 29 minutes from now, about the UK.'}, {'id': 23, 'start': 98.19999694824219, 'end': 100.19999694824219, 'text': ' What else did you take away from that conversation?'}, {'id': 24, 'start': 101.80000305175781, 'end': 109.4800033569336, 'text': ' Well, I added in Jimmy Lai to the conversation about Chinese negotiations because the Chinese dissident is probably'}, {'id': 25, 'start': 110.0, 'end': 117.36000061035156, 'text': ' struggling to stay alive. And his son comes and makes the rounds in American media. And President Trump and Secretary of State Rubio have both'}, {'id': 26, 'start': 118.16000366210938, 'end': 120.87999725341797, 'text': \" emphasized Jimmy Lai's got to get out of prison before he dies.\"}, {'id': 27, 'start': 120.87999725341797, 'end': 123.76000213623047, 'text': \" So they're gonna add that on the table in Switzerland. That was important.\"}, {'id': 28, 'start': 123.76000213623047, 'end': 128.6999969482422, 'text': ' But mostly the key takeaway that made the news is the president said, again,'}, {'id': 29, 'start': 129.0800018310547, 'end': 135.8000030517578, 'text': ' Iran has two choices and only two. Either we bomb you nicely or we bomb you gently. Or we destroy the centrifuges nicely'}, {'id': 30, 'start': 135.8000030517578, 'end': 142.0399932861328, 'text': \" or we bomb you viciously. And I think he's made that very abundantly clear. Every program, everywhere\"}, {'id': 31, 'start': 142.0399932861328, 'end': 148.0800018310547, 'text': ' he appears, you can have one from column A or you get column B. And I like that message. It was very clear yesterday.'}, {'id': 32, 'start': 148.24000549316406, 'end': 153.0, 'text': \" Okay, let's move to Iran. You asked him about that as well. Key comments from the president.\"}, {'id': 33, 'start': 153.0, 'end': 155.1199951171875, 'text': \" Then I'll follow up with J.D. Vance. Watch here.\"}, {'id': 34, 'start': 155.72000122070312, 'end': 162.16000366210938, 'text': \" I'd much rather make a deal, you know, a really verified deal. We want total verification. We can do that.\"}, {'id': 35, 'start': 162.16000366210938, 'end': 167.44000244140625, 'text': ' But I would much prefer a strong, verified deal where we actually blow them up.'}, {'id': 36, 'start': 167.9199981689453, 'end': 171.5399932861328, 'text': ' But blow them up or just denuke them.'}, {'id': 37, 'start': 171.8800048828125, 'end': 177.24000549316406, 'text': ' But the other alternative, there are only two alternatives there. Blow them up nicely or blow them up viciously.'}, {'id': 38, 'start': 177.47999572753906, 'end': 181.1199951171875, 'text': ' You can react to that, Hugh. And I think what J.D. Vance said later in the day,'}, {'id': 39, 'start': 181.1199951171875, 'end': 185.9199981689453, 'text': ' he says there is a deal here that would really bring Iran into the global economy.'}, {'id': 40, 'start': 186.39999389648438, 'end': 192.9600067138672, 'text': ' Now, that was one of the appeals that they were making to Kim Jong-un in North Korea when they met in Vietnam.'}, {'id': 41, 'start': 193.32000732421875, 'end': 195.55999755859375, 'text': ' In the end, that deal did not get done.'}, {'id': 42, 'start': 197.1999969482422, 'end': 202.1999969482422, 'text': ' Do you think Iran is in a different posture, that they would want to be a part of it?'}, {'id': 43, 'start': 202.1999969482422, 'end': 206.8000030517578, 'text': ' Yes, Bill, I do. I think Iran is about to collapse financially.'}, {'id': 44, 'start': 207.24000549316406, 'end': 211.3800048828125, 'text': \" Yeah, they're about to collapse financially. They didn't have enough fuel during the winter.\"}, {'id': 45, 'start': 212.17999267578125, 'end': 217.25999450683594, 'text': ' Their vulnerability after the Israeli strikes to air attacks is complete.'}, {'id': 46, 'start': 217.33999633789062, 'end': 218.86000061035156, 'text': ' Their proxies have been destroyed.'}, {'id': 47, 'start': 218.89999389648438, 'end': 223.05999755859375, 'text': ' The Houthis have thrown in the towel after President Trump turned up the heat.'}, {'id': 48, 'start': 223.5, 'end': 230.4600067138672, 'text': ' So whatever Ayatollah Khamenei wants to do, the supreme leader, he has at his back only the IRGC.'}, {'id': 49, 'start': 230.5, 'end': 234.94000244140625, 'text': ' And he has a very restless population that has tried to rise up two or three different times.'}, {'id': 50, 'start': 234.94000244140625, 'end': 236.5399932861328, 'text': ' Under this president, they would get support.'}, {'id': 51, 'start': 236.97999572753906, 'end': 238.5399932861328, 'text': \" Under the past president, they wouldn't have.\"}, {'id': 52, 'start': 238.5800018310547, 'end': 243.4600067138672, 'text': \" They didn't when President Obama took office and there was the attempt at a green revolution in Iran.\"}, {'id': 53, 'start': 243.77999877929688, 'end': 246.05999755859375, 'text': ' So I think their back is against the wall.'}, {'id': 54, 'start': 246.3800048828125, 'end': 256.739990234375, 'text': \" And if they want to sacrifice everything, our B-2s are parked at Diego Garcia, along with the IDF's fighter pilots and our two carrier groups.\"}, {'id': 55, 'start': 257.17999267578125, 'end': 258.5, 'text': \" They don't stand a chance.\"}, {'id': 56, 'start': 258.5400085449219, 'end': 260.260009765625, 'text': \" They really don't want it to come to blows.\"}, {'id': 57, 'start': 260.70001220703125, 'end': 264.5799865722656, 'text': ' And I think what the president said yesterday is they have to make a choice.'}, {'id': 58, 'start': 264.739990234375, 'end': 270.3800048828125, 'text': ' We bomb them or we go in and we watch them blow up their centrifuges and turn over their enriched uranium.'}, {'id': 59, 'start': 270.3800048828125, 'end': 271.1400146484375, 'text': \" It's very clear.\"}, {'id': 60, 'start': 271.82000732421875, 'end': 281.1000061035156, 'text': ' Hugh, also, we have seen that President Biden and the former first lady, they are out and about doing a little media tour in advance of some of these books that are coming out about them and questioning them.'}, {'id': 61, 'start': 281.3399963378906, 'end': 284.5799865722656, 'text': ' You asked President Trump about Biden and competency yesterday.'}, {'id': 62, 'start': 284.6199951171875, 'end': 285.260009765625, 'text': \" Here's what he said.\"}, {'id': 63, 'start': 287.5400085449219, 'end': 289.82000732421875, 'text': \" Well, I don't think he was competent 40 years ago.\"}, {'id': 64, 'start': 290.1400146484375, 'end': 292.05999755859375, 'text': ' He was a very average guy.'}, {'id': 65, 'start': 293.05999755859375, 'end': 296.2200012207031, 'text': ' Look at his look at his credentials academically.'}, {'id': 66, 'start': 296.2200012207031, 'end': 299.05999755859375, 'text': ' Look at his look at, you know, look at his old life.'}, {'id': 67, 'start': 299.3800048828125, 'end': 300.6199951171875, 'text': ' He was a glad hander.'}, {'id': 68, 'start': 300.6600036621094, 'end': 305.2200012207031, 'text': ' You know, Helen Hardy had a good personality, but he was a vicious guy.'}, {'id': 69, 'start': 305.260009765625, 'end': 306.5400085449219, 'text': ' You know, you saw that here.'}, {'id': 70, 'start': 306.5799865722656, 'end': 309.5799865722656, 'text': ' He knew enough to know to go after his opponent.'}, {'id': 71, 'start': 309.5799865722656, 'end': 311.2200012207031, 'text': ' He went after his political opponent.'}, {'id': 72, 'start': 312.2200012207031, 'end': 319.739990234375, 'text': \" You know, I think it's going to be a long road for the Bidens to try to have some sort of semblance of a good legacy.\"}, {'id': 73, 'start': 319.7799987792969, 'end': 323.260009765625, 'text': \" And I don't know if this media tour will help or hurt them.\"}, {'id': 74, 'start': 323.5, 'end': 324.0199890136719, 'text': ' What do you think?'}, {'id': 75, 'start': 326.17999267578125, 'end': 329.6600036621094, 'text': \" Dan, I don't know how President Biden gets out of the hole he dug for himself.\"}, {'id': 76, 'start': 330.7799987792969, 'end': 344.8599853515625, 'text': ' President Trump went on to talk about the famous debate, which basically blew up the Biden campaign and how bad the makeup was and how bad President Biden performed and how it became very obvious very quickly that it was going to be a disaster for President Biden.'}, {'id': 77, 'start': 344.8599853515625, 'end': 346.29998779296875, 'text': ' So we talked about that yesterday.'}, {'id': 78, 'start': 346.6199951171875, 'end': 350.6600036621094, 'text': \" I don't think it's a good idea for President Biden to do interviews with Dr.\"}, {'id': 79, 'start': 350.6600036621094, 'end': 362.3800048828125, 'text': \" Biden. I think if he wants to try and rehab his image, he's got to sit down with people like you and Bill or with me or any of the hosts that will ask him fair, competent questions and demonstrate competence.\"}, {'id': 80, 'start': 362.3800048828125, 'end': 366.8599853515625, 'text': ' Because the question at the end became, do we have a president for about six months?'}, {'id': 81, 'start': 367.29998779296875, 'end': 370.3800048828125, 'text': ' You know how well how often presidents appear in front of the public.'}, {'id': 82, 'start': 370.6199951171875, 'end': 371.8999938964844, 'text': \" He's just missing in action.\"}, {'id': 83, 'start': 371.8999938964844, 'end': 373.3399963378906, 'text': ' And we got through it. Thank goodness.'}, {'id': 84, 'start': 373.3399963378906, 'end': 379.4200134277344, 'text': \" But if he wants to rehab his reputation, he's going to have to do one on ones that aren't softballs and aren't controlled.\"}, {'id': 85, 'start': 379.5400085449219, 'end': 383.5, 'text': \" So you're saying doing The View today is not going to answer the mail.\"}, {'id': 86, 'start': 384.6600036621094, 'end': 386.29998779296875, 'text': \" Just kidding. You don't have to answer that.\"}, {'id': 87, 'start': 387.8599853515625, 'end': 389.6600036621094, 'text': ' Thanks so much. I will.'}, {'id': 88, 'start': 389.6600036621094, 'end': 390.7799987792969, 'text': ' They will prop him up.'}, {'id': 89, 'start': 391.1000061035156, 'end': 392.05999755859375, 'text': ' They will prop him up.'}, {'id': 90, 'start': 392.1000061035156, 'end': 394.0199890136719, 'text': ' Thank you. He needs to talk to you, too.'}, {'id': 91, 'start': 394.05999755859375, 'end': 395.8599853515625, 'text': ' He needs to talk to friendly, competent people.'}, {'id': 92, 'start': 395.8599853515625, 'end': 396.8599853515625, 'text': \" He's welcome here.\"}, {'id': 93, 'start': 396.94000244140625, 'end': 398.3800048828125, 'text': ' We got a chair there. Come on.'}, {'id': 94, 'start': 399.05999755859375, 'end': 400.2200012207031, 'text': ' Thank you, Hugh. Nice to see you.'}, {'id': 95, 'start': 400.3399963378906, 'end': 402.17999267578125, 'text': \" I'm Steve Doocy. I'm Brian Kilmeade.\"}, {'id': 96, 'start': 402.17999267578125, 'end': 403.17999267578125, 'text': \" And I'm Ainsley Earhart.\"}, {'id': 97, 'start': 403.17999267578125, 'end': 409.5400085449219, 'text': ' And click here to subscribe to the Fox News YouTube page to catch our hottest interviews and most compelling analysis.'}]}"