"{'text': \"President Trump, appearing on Hugh Hewitt's radio show, gave a very stern warning to Iran. Take a look. I would much prefer a strong, verified deal where we actually blow him up, but blow him up or just denuke him. But the other alternative, there are only two alternatives there, blow him up nicely or blow him up viciously. CBN's Chris Mitchell joins us now from Jerusalem. Chris, what can you tell us about Trump's developing Iran nuclear plan? Well, Raj, that's a good word, developing, and it seems to be morphing from one time to another. For example, he just played that clip from Hugh Hewitt, and he says they can either have their centrifuges destroyed violently or perhaps voluntarily. But on the other hand, he's also said that they haven't decided yet whether or not they're going to allow Iran to enrich uranium. They've also said maybe Iran should have a civilian nuclear program. And I can tell you over here, Raj, in Israel, they're very concerned about how this deal may or may not turn out. I think they're encouraged that the latest round of talks has been postponed. They think that is a good thing. But I think just a few weeks ago or maybe a couple of months ago, Israel was feeling this was a window of opportunity to finally eliminate Iran's nuclear program. We saw all the military assets coming in from the U.S., the B-2 bombers, the B-52 bombers, as well as what the assets that it was giving to Israel. And so there was a sense that this is the window of opportunity, because everybody knows that Iran is so close to getting at least enough enriched uranium to build one, two, or more nuclear bombs. So with this advancement of Iran to a nuclear weapon and the assets, military assets, people thought this was going to be the window of opportunity to go ahead and finally hit the sites. Well, exactly to your point about the idea of the United States or Israel attacking Iran, let me read you a quote from the IRGC, the Islamic Revolutionary Guards chief, Hussein Salami. He said that if the United States or Israel were to strike Iran, quote, I'm using a serious warning. If you make one wrong move, we will open up the gates of hell on you. So Chris, do you see the United States or Israel attacking Iran anytime soon? Well, it just remains to be seen. It's a real fluid situation. President Trump's coming to the Middle East next week. He's going to visit Saudi Arabia and the UAE, maybe Qatar. And I don't think anything's going to happen until then. So it's really uncertain time right now whether or not the US and or Israel will strike them. It's going to complicate things, Raj, if there's a US-Iran deal. And then what will Israel do? Israel is committed to destroy these sites. They feel it's an existential threat to the Jewish state. Benjamin Netanyahu spent much of his life warning about a nuclear Iran. So if there's a scenario where the Iranians and the US come to a deal, what does that leave Israel? And that's really the concern that many people have over here. When people hear that threat by the Iranian general, they kind of wonder, well, they tried twice already. They tried last April. They tried last October, 300 and more missiles, rockets, drones, UAVs, and 95 or more percent, maybe 99 percent. So I think those kind of threats really don't really resonate right here in Israel. Well, you know, the Middle East is obviously unpredictable. You know, who would have thought that, you know, that the Golan Heights would have been recognized and the capital would have been moved to Jerusalem, the Abraham Accords? But now I feel like with Trump being unpredictable himself, you know, it's even more unpredictable. You did a story yesterday about, you know, back channel talks between Syria and Israel. There's just a lot of moving pieces. Just when you have things kind of figured out, you're like, well, maybe I don't understand. So this is one last question, because you brought it up. And I do think it's interesting. Obviously, Trump is headed to the Middle East. And this is kind of a tangent, but I think it's worth making because I think it is connected. Do you see Saudi Arabia joining the Abraham Accords? And that being, you know, Saudi Arabia and Iran obviously have issues with each other. So it's all related. Do you see this trip facilitating something momentous like that? I do feel like Saudi Arabia will join the Abraham Accords. Whether or not it's this trip, I'm not sure. I know the focus will in part be on economics. They call this MAGA in the desert. There's going to be an economic summit. I think part of what's going on will be the economic investment by Saudi Arabia and the UAE in particular into the U.S. But eventually, I think it may happen. And I think we'll have to see how Gaza resolves, whether or not Israel is going to take over all of Gaza, what's going to happen to the population, what's going to happen to Trump's plan to kind of, you know, make this the, you know, the Singapore of the Mediterranean and what kind of involvement we'll see with Saudi Arabia and UAE. So my answer is yes, I think it's going to happen. I'm not sure it's going to happen right now, but eventually I think it will. But things have to play out. Well, Chris, obviously, we're going to have to have you back on again and again and again. Obviously, you know, just to speak with my wife the other day, I was looking at my algorithm. Obviously, I'm very invested in what's happening in the Middle East. And on one side of my algorithm, you have this whole Iran nuclear facility program. And then literally the next story is about how Abu Dhabi is creating a new Disneyland. It's like the Middle East is such an interesting place. There's always things happening. But we're going to have to have you back on because, Chris Mitchell, not only are you a wealth of information, I trust you. I know that you are just so full of the Holy Spirit. And I think CBN is very fortunate to have you. So, Chris Mitchell, thank you so much, my friend. Hey, it's great to be with you, Raja. Let me just end with this. You know, I just encourage people to pray. Pray for the peace of Jerusalem. Pray for the wisdom for Israeli leaders. They certainly need it. Pray for a newly appointed ambassador, Mike Huckabee here. There was an event for him the other night. He's in a very strategic position. And certainly pray for President Trump and his visit coming up.\", 'segments': [{'id': 0, 'start': 0.0, 'end': 7.599999904632568, 'text': \" President Trump, appearing on Hugh Hewitt's radio show, gave a very stern warning to Iran.\"}, {'id': 1, 'start': 7.599999904632568, 'end': 8.600000381469727, 'text': ' Take a look.'}, {'id': 2, 'start': 8.600000381469727, 'end': 14.520000457763672, 'text': ' I would much prefer a strong, verified deal where we actually blow him up, but blow him'}, {'id': 3, 'start': 14.520000457763672, 'end': 17.440000534057617, 'text': ' up or just denuke him.'}, {'id': 4, 'start': 17.440000534057617, 'end': 21.280000686645508, 'text': ' But the other alternative, there are only two alternatives there, blow him up nicely'}, {'id': 5, 'start': 21.280000686645508, 'end': 22.959999084472656, 'text': ' or blow him up viciously.'}, {'id': 6, 'start': 22.959999084472656, 'end': 26.520000457763672, 'text': \" CBN's Chris Mitchell joins us now from Jerusalem.\"}, {'id': 7, 'start': 27.1200008392334, 'end': 31.559999465942383, 'text': \" Chris, what can you tell us about Trump's developing Iran nuclear plan?\"}, {'id': 8, 'start': 31.559999465942383, 'end': 36.79999923706055, 'text': \" Well, Raj, that's a good word, developing, and it seems to be morphing from one time\"}, {'id': 9, 'start': 36.79999923706055, 'end': 37.79999923706055, 'text': ' to another.'}, {'id': 10, 'start': 37.79999923706055, 'end': 44.560001373291016, 'text': ' For example, he just played that clip from Hugh Hewitt, and he says they can either have'}, {'id': 11, 'start': 44.560001373291016, 'end': 53.119998931884766, 'text': ' their centrifuges destroyed violently or perhaps voluntarily.'}, {'id': 12, 'start': 53.119998931884766, 'end': 57.959999084472656, 'text': \" But on the other hand, he's also said that they haven't decided yet whether or not they're\"}, {'id': 13, 'start': 57.959999084472656, 'end': 61.720001220703125, 'text': ' going to allow Iran to enrich uranium.'}, {'id': 14, 'start': 61.720001220703125, 'end': 67.12000274658203, 'text': \" They've also said maybe Iran should have a civilian nuclear program.\"}, {'id': 15, 'start': 67.12000274658203, 'end': 72.9000015258789, 'text': \" And I can tell you over here, Raj, in Israel, they're very concerned about how this deal\"}, {'id': 16, 'start': 72.9000015258789, 'end': 75.23999786376953, 'text': ' may or may not turn out.'}, {'id': 17, 'start': 75.23999786376953, 'end': 80.86000061035156, 'text': \" I think they're encouraged that the latest round of talks has been postponed.\"}, {'id': 18, 'start': 80.86000061035156, 'end': 82.41999816894531, 'text': ' They think that is a good thing.'}, {'id': 19, 'start': 82.41999816894531, 'end': 87.41999816894531, 'text': ' But I think just a few weeks ago or maybe a couple of months ago, Israel was feeling'}, {'id': 20, 'start': 87.41999816894531, 'end': 93.44000244140625, 'text': \" this was a window of opportunity to finally eliminate Iran's nuclear program.\"}, {'id': 21, 'start': 93.44000244140625, 'end': 101.26000213623047, 'text': ' We saw all the military assets coming in from the U.S., the B-2 bombers, the B-52 bombers,'}, {'id': 22, 'start': 101.26000213623047, 'end': 105.69999694824219, 'text': ' as well as what the assets that it was giving to Israel.'}, {'id': 23, 'start': 105.69999694824219, 'end': 109.69999694824219, 'text': ' And so there was a sense that this is the window of opportunity, because everybody knows'}, {'id': 24, 'start': 109.69999694824219, 'end': 116.45999908447266, 'text': ' that Iran is so close to getting at least enough enriched uranium to build one, two,'}, {'id': 25, 'start': 116.45999908447266, 'end': 117.9800033569336, 'text': ' or more nuclear bombs.'}, {'id': 26, 'start': 117.9800033569336, 'end': 126.41999816894531, 'text': ' So with this advancement of Iran to a nuclear weapon and the assets, military assets, people'}, {'id': 27, 'start': 126.41999816894531, 'end': 130.4199981689453, 'text': ' thought this was going to be the window of opportunity to go ahead and finally hit the'}, {'id': 28, 'start': 130.4199981689453, 'end': 131.4199981689453, 'text': ' sites.'}, {'id': 29, 'start': 131.4199981689453, 'end': 135.6999969482422, 'text': ' Well, exactly to your point about the idea of the United States or Israel attacking Iran,'}, {'id': 30, 'start': 135.6999969482422, 'end': 140.5800018310547, 'text': ' let me read you a quote from the IRGC, the Islamic Revolutionary Guards chief, Hussein Salami.'}, {'id': 31, 'start': 140.5800018310547, 'end': 146.4600067138672, 'text': \" He said that if the United States or Israel were to strike Iran, quote, I'm using a serious warning.\"}, {'id': 32, 'start': 146.4600067138672, 'end': 154.02000427246094, 'text': ' If you make one wrong move, we will open up the gates of hell on you.'}, {'id': 33, 'start': 154.02000427246094, 'end': 160.17999267578125, 'text': ' So Chris, do you see the United States or Israel attacking Iran anytime soon?'}, {'id': 34, 'start': 160.17999267578125, 'end': 162.33999633789062, 'text': ' Well, it just remains to be seen.'}, {'id': 35, 'start': 162.33999633789062, 'end': 163.89999389648438, 'text': \" It's a real fluid situation.\"}, {'id': 36, 'start': 164.4600067138672, 'end': 167.05999755859375, 'text': \" President Trump's coming to the Middle East next week.\"}, {'id': 37, 'start': 167.05999755859375, 'end': 171.5, 'text': \" He's going to visit Saudi Arabia and the UAE, maybe Qatar.\"}, {'id': 38, 'start': 171.5, 'end': 175.05999755859375, 'text': \" And I don't think anything's going to happen until then.\"}, {'id': 39, 'start': 175.05999755859375, 'end': 182.5399932861328, 'text': \" So it's really uncertain time right now whether or not the US and or Israel will strike them.\"}, {'id': 40, 'start': 182.5399932861328, 'end': 188.4199981689453, 'text': \" It's going to complicate things, Raj, if there's a US-Iran deal.\"}, {'id': 41, 'start': 188.4199981689453, 'end': 190.17999267578125, 'text': ' And then what will Israel do?'}, {'id': 42, 'start': 190.17999267578125, 'end': 193.94000244140625, 'text': ' Israel is committed to destroy these sites.'}, {'id': 43, 'start': 193.94000244140625, 'end': 197.86000061035156, 'text': \" They feel it's an existential threat to the Jewish state.\"}, {'id': 44, 'start': 197.86000061035156, 'end': 202.5, 'text': ' Benjamin Netanyahu spent much of his life warning about a nuclear Iran.'}, {'id': 45, 'start': 202.5, 'end': 210.17999267578125, 'text': \" So if there's a scenario where the Iranians and the US come to a deal, what does that leave Israel?\"}, {'id': 46, 'start': 210.17999267578125, 'end': 214.13999938964844, 'text': \" And that's really the concern that many people have over here.\"}, {'id': 47, 'start': 214.5399932861328, 'end': 223.82000732421875, 'text': ' When people hear that threat by the Iranian general, they kind of wonder, well, they tried twice already.'}, {'id': 48, 'start': 223.82000732421875, 'end': 225.17999267578125, 'text': ' They tried last April.'}, {'id': 49, 'start': 225.17999267578125, 'end': 236.22000122070312, 'text': ' They tried last October, 300 and more missiles, rockets, drones, UAVs, and 95 or more percent, maybe 99 percent.'}, {'id': 50, 'start': 236.22000122070312, 'end': 243.4199981689453, 'text': \" So I think those kind of threats really don't really resonate right here in Israel.\"}, {'id': 51, 'start': 243.5, 'end': 246.3800048828125, 'text': ' Well, you know, the Middle East is obviously unpredictable.'}, {'id': 52, 'start': 246.3800048828125, 'end': 253.74000549316406, 'text': ' You know, who would have thought that, you know, that the Golan Heights would have been recognized and the capital would have been moved to Jerusalem, the Abraham Accords?'}, {'id': 53, 'start': 253.74000549316406, 'end': 258.29998779296875, 'text': \" But now I feel like with Trump being unpredictable himself, you know, it's even more unpredictable.\"}, {'id': 54, 'start': 258.29998779296875, 'end': 263.82000732421875, 'text': ' You did a story yesterday about, you know, back channel talks between Syria and Israel.'}, {'id': 55, 'start': 263.82000732421875, 'end': 265.7799987792969, 'text': \" There's just a lot of moving pieces.\"}, {'id': 56, 'start': 265.7799987792969, 'end': 269.5, 'text': \" Just when you have things kind of figured out, you're like, well, maybe I don't understand.\"}, {'id': 57, 'start': 269.5, 'end': 271.6199951171875, 'text': ' So this is one last question, because you brought it up.'}, {'id': 58, 'start': 271.6199951171875, 'end': 273.4200134277344, 'text': \" And I do think it's interesting.\"}, {'id': 59, 'start': 273.4200134277344, 'end': 275.0199890136719, 'text': ' Obviously, Trump is headed to the Middle East.'}, {'id': 60, 'start': 275.0199890136719, 'end': 280.5, 'text': \" And this is kind of a tangent, but I think it's worth making because I think it is connected.\"}, {'id': 61, 'start': 280.5, 'end': 286.82000732421875, 'text': ' Do you see Saudi Arabia joining the Abraham Accords?'}, {'id': 62, 'start': 286.82000732421875, 'end': 290.4200134277344, 'text': ' And that being, you know, Saudi Arabia and Iran obviously have issues with each other.'}, {'id': 63, 'start': 290.4200134277344, 'end': 291.3399963378906, 'text': \" So it's all related.\"}, {'id': 64, 'start': 291.3399963378906, 'end': 295.7799987792969, 'text': ' Do you see this trip facilitating something momentous like that?'}, {'id': 65, 'start': 295.8999938964844, 'end': 299.5, 'text': ' I do feel like Saudi Arabia will join the Abraham Accords.'}, {'id': 66, 'start': 299.5, 'end': 302.3800048828125, 'text': \" Whether or not it's this trip, I'm not sure.\"}, {'id': 67, 'start': 302.3800048828125, 'end': 305.1400146484375, 'text': ' I know the focus will in part be on economics.'}, {'id': 68, 'start': 305.1400146484375, 'end': 307.3800048828125, 'text': ' They call this MAGA in the desert.'}, {'id': 69, 'start': 307.3800048828125, 'end': 309.29998779296875, 'text': \" There's going to be an economic summit.\"}, {'id': 70, 'start': 309.29998779296875, 'end': 316.8599853515625, 'text': \" I think part of what's going on will be the economic investment by Saudi Arabia and the UAE in particular into the U.S.\"}, {'id': 71, 'start': 316.8599853515625, 'end': 318.7799987792969, 'text': ' But eventually, I think it may happen.'}, {'id': 72, 'start': 318.7799987792969, 'end': 338.3800048828125, 'text': \" And I think we'll have to see how Gaza resolves, whether or not Israel is going to take over all of Gaza, what's going to happen to the population, what's going to happen to Trump's plan to kind of, you know, make this the, you know, the Singapore of the Mediterranean and what kind of involvement we'll see with Saudi Arabia and UAE.\"}, {'id': 73, 'start': 338.3800048828125, 'end': 341.29998779296875, 'text': \" So my answer is yes, I think it's going to happen.\"}, {'id': 74, 'start': 341.29998779296875, 'end': 344.9800109863281, 'text': \" I'm not sure it's going to happen right now, but eventually I think it will.\"}, {'id': 75, 'start': 344.9800109863281, 'end': 346.5400085449219, 'text': ' But things have to play out.'}, {'id': 76, 'start': 346.6600036621094, 'end': 350.17999267578125, 'text': \" Well, Chris, obviously, we're going to have to have you back on again and again and again.\"}, {'id': 77, 'start': 350.17999267578125, 'end': 353.6600036621094, 'text': ' Obviously, you know, just to speak with my wife the other day, I was looking at my algorithm.'}, {'id': 78, 'start': 353.6600036621094, 'end': 356.3399963378906, 'text': \" Obviously, I'm very invested in what's happening in the Middle East.\"}, {'id': 79, 'start': 356.3399963378906, 'end': 360.94000244140625, 'text': ' And on one side of my algorithm, you have this whole Iran nuclear facility program.'}, {'id': 80, 'start': 360.94000244140625, 'end': 365.29998779296875, 'text': ' And then literally the next story is about how Abu Dhabi is creating a new Disneyland.'}, {'id': 81, 'start': 365.29998779296875, 'end': 367.9800109863281, 'text': \" It's like the Middle East is such an interesting place.\"}, {'id': 82, 'start': 367.9800109863281, 'end': 369.94000244140625, 'text': \" There's always things happening.\"}, {'id': 83, 'start': 369.94000244140625, 'end': 375.4200134277344, 'text': \" But we're going to have to have you back on because, Chris Mitchell, not only are you a wealth of information, I trust you.\"}, {'id': 84, 'start': 375.4200134277344, 'end': 379.260009765625, 'text': ' I know that you are just so full of the Holy Spirit.'}, {'id': 85, 'start': 379.260009765625, 'end': 381.739990234375, 'text': ' And I think CBN is very fortunate to have you.'}, {'id': 86, 'start': 381.739990234375, 'end': 383.5799865722656, 'text': ' So, Chris Mitchell, thank you so much, my friend.'}, {'id': 87, 'start': 383.5799865722656, 'end': 384.8999938964844, 'text': \" Hey, it's great to be with you, Raja.\"}, {'id': 88, 'start': 384.8999938964844, 'end': 386.0199890136719, 'text': ' Let me just end with this.'}, {'id': 89, 'start': 386.0199890136719, 'end': 388.0199890136719, 'text': ' You know, I just encourage people to pray.'}, {'id': 90, 'start': 388.0199890136719, 'end': 389.70001220703125, 'text': ' Pray for the peace of Jerusalem.'}, {'id': 91, 'start': 389.70001220703125, 'end': 391.6199951171875, 'text': ' Pray for the wisdom for Israeli leaders.'}, {'id': 92, 'start': 391.6199951171875, 'end': 392.7799987792969, 'text': ' They certainly need it.'}, {'id': 93, 'start': 392.7799987792969, 'end': 397.5400085449219, 'text': ' Pray for a newly appointed ambassador, Mike Huckabee here.'}, {'id': 94, 'start': 397.5400085449219, 'end': 399.1400146484375, 'text': ' There was an event for him the other night.'}, {'id': 95, 'start': 399.1400146484375, 'end': 401.3399963378906, 'text': \" He's in a very strategic position.\"}, {'id': 96, 'start': 401.3399963378906, 'end': 405.05999755859375, 'text': ' And certainly pray for President Trump and his visit coming up.'}]}"