"{'text': \"An anti-Israel mob stormed and took over Columbia University's Butler Library during finals week, I might add. Take a look. Alicia Baker, a junior at Columbia, joins us now. Alicia, what can you tell us about this event? Yeah, so a mob basically barged right in through the front door into Butler Library, walked up the stairs, you know, pushed through public safety, and essentially took over the main reading room in Butler, where hundreds of students were studying for finals, writing final essays, you know, using the books, and basically locked down the room and started protesting very loudly. And so what ended up happening is that most students left the room. Some were actually ended up being ended up being trapped, and some people left thinking this might be quick, leaving their laptops, and ended up not being able to get their laptops back for hours because the mob basically locked themselves in and the building had to be locked down. At the same time, a group of protesters gathered outside the gates to join in the fun and to shout things, to chant. They tried to push in through public safety to join the protesters inside the building, while at the same time, the protesters inside the building ended up trying to push their way out without showing their identification. Luckily, Columbia's public safety did a phenomenal job basically ensuring that no protester would leave that room without showing their ID. So now we're in a position where there could potentially be real accountability for these people. So how does this make you feel? Obviously you're Jewish and you're, you know, pro-Israel, outspoken. How does this make you feel as a student at Columbia when you see things like this happening? I mean, obviously this group of people, these protesters, have no regard for the value of higher education and no regard for their peers. I mean, taking over the main library during finals should be proof of that. It's the best proof of that. I'm actually really heartened and happy by the way that the Columbia administration and public safety responded to this incident. Public safety held their ground, you know, wishing the best and for a full recovery for the two public safety officers that were actually injured during the whole ordeal. And Columbia's administration was very clear, this kind of behavior is intolerable. And when it got to the point when they, you know, realized that nobody was going to show their IDs to leave, they called in the NYPD for backup instead of negotiating with these people. And that's exactly what leaders should do. And that, you know, so I'm feeling very, you know, heartened and happy by the great progress that we saw and the great response from our administration and our public safety officers. Well, you know, there's reports online that, you know, somewhere between 70 to 80 people were arrested by the NYPD. My question to you is, what's the goal of, what are they trying to accomplish by doing this? You know, I think this movement has been pretty clear about their goals. I think on a micro level, it is basically disrupt until everyone knows that they feel that the state of Israel doesn't have the right to exist. But on a more, you know, broad level, it's not just about trying to isolate and ostracize Jewish students on campus. It's not just about supporting Hamas and terrorism around the world. It's also a deeply anti-Western, anti-American agenda. And this is a group that has shown that just as they support resistance, quote unquote, by any means necessary in the Middle East, which obviously includes killing civilians, which Hamas did on October 7th, they also support resistance here in America by any means necessary. Disruption, you know, intimidation, harassment, assault, these are all things that this movement has perpetrated in the name of their agenda. Well, let me ask you this, maybe in closing. Obviously, there's going to be a bunch of trolls in the comment section. Obviously, these people that, you know, storm the library probably aren't going to be the most level-headed people. But let's say for once, you actually were sitting across from someone who kind of, you know, lowered their defenses and said, all right, fine, Alicia, I'll have a conversation with you. And you're sitting across and they're not hiding behind a keyboard. They're not hiding behind a kafia or sunglasses. You're actually having a conversation one-to-one with someone like this. What would you want them to know? I would want them to know that, you know, from the very beginning, I and so many of my friends and peers in the Jewish community and our non-Jewish allies are committed at Columbia to the values of higher education, to the values of dialogue, you know, to making this a place where everyone feels like they can learn safely and where professors are not indoctrinating students, but engaging with students and engaging with diverse viewpoints. And with regard to the Middle East that, you know, I love and support Israel. It's a deeply important part of my Jewish identity. And it's a deeply important part of who I am. Israelis are a fundamental part of the Jewish people as well, obviously, you know, half of the Jewish people live in Israel and we're looking for ways to make life better for everyone, right? Israel is a beacon of hope for the Middle East. And, you know, we should be looking for ways to increase peace and to increase prosperity for the entire region. My brother, thank you so much and good luck with your finals. Thank you, sir.\", 'segments': [{'id': 0, 'start': 0.0, 'end': 7.28000020980835, 'text': \" An anti-Israel mob stormed and took over Columbia University's Butler Library\"}, {'id': 1, 'start': 7.28000020980835, 'end': 10.079999923706055, 'text': ' during finals week, I might add. Take a look.'}, {'id': 2, 'start': 30.0, 'end': 38.720001220703125, 'text': ' Alicia Baker, a junior at Columbia, joins us now. Alicia, what can you tell us about this event?'}, {'id': 3, 'start': 39.91999816894531, 'end': 45.7599983215332, 'text': ' Yeah, so a mob basically barged right in through the front door into Butler Library,'}, {'id': 4, 'start': 46.31999969482422, 'end': 51.84000015258789, 'text': ' walked up the stairs, you know, pushed through public safety, and essentially took over the'}, {'id': 5, 'start': 51.84000015258789, 'end': 57.84000015258789, 'text': ' main reading room in Butler, where hundreds of students were studying for finals, writing final'}, {'id': 6, 'start': 57.84000015258789, 'end': 63.68000030517578, 'text': ' essays, you know, using the books, and basically locked down the room and started protesting very'}, {'id': 7, 'start': 63.68000030517578, 'end': 69.36000061035156, 'text': ' loudly. And so what ended up happening is that most students left the room. Some were actually'}, {'id': 8, 'start': 69.36000061035156, 'end': 73.5999984741211, 'text': ' ended up being ended up being trapped, and some people left thinking this might be quick,'}, {'id': 9, 'start': 74.16000366210938, 'end': 79.68000030517578, 'text': ' leaving their laptops, and ended up not being able to get their laptops back for hours because the'}, {'id': 10, 'start': 79.68000030517578, 'end': 86.16000366210938, 'text': ' mob basically locked themselves in and the building had to be locked down. At the same time, a group of'}, {'id': 11, 'start': 86.16000366210938, 'end': 94.16000366210938, 'text': ' protesters gathered outside the gates to join in the fun and to shout things, to chant. They tried'}, {'id': 12, 'start': 94.16000366210938, 'end': 99.36000061035156, 'text': ' to push in through public safety to join the protesters inside the building, while at the same'}, {'id': 13, 'start': 99.36000061035156, 'end': 104.87999725341797, 'text': ' time, the protesters inside the building ended up trying to push their way out without showing their'}, {'id': 14, 'start': 104.87999725341797, 'end': 111.83999633789062, 'text': \" identification. Luckily, Columbia's public safety did a phenomenal job basically ensuring that no\"}, {'id': 15, 'start': 111.83999633789062, 'end': 118.16000366210938, 'text': \" protester would leave that room without showing their ID. So now we're in a position where there\"}, {'id': 16, 'start': 118.16000366210938, 'end': 123.44000244140625, 'text': ' could potentially be real accountability for these people. So how does this make you feel? Obviously'}, {'id': 17, 'start': 123.44000244140625, 'end': 129.0399932861328, 'text': \" you're Jewish and you're, you know, pro-Israel, outspoken. How does this make you feel as a student\"}, {'id': 18, 'start': 129.0399932861328, 'end': 133.60000610351562, 'text': ' at Columbia when you see things like this happening? I mean, obviously this group of people, these'}, {'id': 19, 'start': 133.60000610351562, 'end': 140.0800018310547, 'text': ' protesters, have no regard for the value of higher education and no regard for their peers. I mean,'}, {'id': 20, 'start': 140.0800018310547, 'end': 144.63999938964844, 'text': \" taking over the main library during finals should be proof of that. It's the best proof\"}, {'id': 21, 'start': 144.63999938964844, 'end': 152.55999755859375, 'text': \" of that. I'm actually really heartened and happy by the way that the Columbia administration and\"}, {'id': 22, 'start': 152.55999755859375, 'end': 158.32000732421875, 'text': ' public safety responded to this incident. Public safety held their ground, you know, wishing the'}, {'id': 23, 'start': 158.32000732421875, 'end': 162.55999755859375, 'text': ' best and for a full recovery for the two public safety officers that were actually injured during'}, {'id': 24, 'start': 162.55999755859375, 'end': 168.8800048828125, 'text': \" the whole ordeal. And Columbia's administration was very clear, this kind of behavior is intolerable.\"}, {'id': 25, 'start': 168.8800048828125, 'end': 174.55999755859375, 'text': ' And when it got to the point when they, you know, realized that nobody was going to show their IDs'}, {'id': 26, 'start': 174.55999755859375, 'end': 179.1999969482422, 'text': ' to leave, they called in the NYPD for backup instead of negotiating with these people. And'}, {'id': 27, 'start': 179.1999969482422, 'end': 184.72000122070312, 'text': \" that's exactly what leaders should do. And that, you know, so I'm feeling very, you know, heartened\"}, {'id': 28, 'start': 184.72000122070312, 'end': 190.47999572753906, 'text': ' and happy by the great progress that we saw and the great response from our administration and'}, {'id': 29, 'start': 190.47999572753906, 'end': 194.24000549316406, 'text': \" our public safety officers. Well, you know, there's reports online that, you know, somewhere\"}, {'id': 30, 'start': 194.24000549316406, 'end': 202.16000366210938, 'text': \" between 70 to 80 people were arrested by the NYPD. My question to you is, what's the goal of,\"}, {'id': 31, 'start': 202.16000366210938, 'end': 207.0399932861328, 'text': ' what are they trying to accomplish by doing this? You know, I think this movement has been pretty'}, {'id': 32, 'start': 207.0399932861328, 'end': 215.60000610351562, 'text': ' clear about their goals. I think on a micro level, it is basically disrupt until everyone knows that'}, {'id': 33, 'start': 215.60000610351562, 'end': 219.67999267578125, 'text': \" they feel that the state of Israel doesn't have the right to exist. But on a more, you know,\"}, {'id': 34, 'start': 219.67999267578125, 'end': 226.16000366210938, 'text': \" broad level, it's not just about trying to isolate and ostracize Jewish students on campus.\"}, {'id': 35, 'start': 226.16000366210938, 'end': 233.1199951171875, 'text': \" It's not just about supporting Hamas and terrorism around the world. It's also a deeply anti-Western,\"}, {'id': 36, 'start': 233.1199951171875, 'end': 238.9600067138672, 'text': ' anti-American agenda. And this is a group that has shown that just as they support resistance,'}, {'id': 37, 'start': 238.9600067138672, 'end': 243.75999450683594, 'text': ' quote unquote, by any means necessary in the Middle East, which obviously includes killing'}, {'id': 38, 'start': 243.75999450683594, 'end': 250.39999389648438, 'text': ' civilians, which Hamas did on October 7th, they also support resistance here in America by any'}, {'id': 39, 'start': 250.39999389648438, 'end': 257.8399963378906, 'text': ' means necessary. Disruption, you know, intimidation, harassment, assault, these are all things that'}, {'id': 40, 'start': 257.8399963378906, 'end': 263.2799987792969, 'text': ' this movement has perpetrated in the name of their agenda. Well, let me ask you this, maybe in'}, {'id': 41, 'start': 263.2799987792969, 'end': 268.239990234375, 'text': \" closing. Obviously, there's going to be a bunch of trolls in the comment section. Obviously, these\"}, {'id': 42, 'start': 268.239990234375, 'end': 273.760009765625, 'text': \" people that, you know, storm the library probably aren't going to be the most level-headed people.\"}, {'id': 43, 'start': 273.760009765625, 'end': 279.8399963378906, 'text': \" But let's say for once, you actually were sitting across from someone who kind of, you know,\"}, {'id': 44, 'start': 280.55999755859375, 'end': 284.8800048828125, 'text': \" lowered their defenses and said, all right, fine, Alicia, I'll have a conversation with you.\"}, {'id': 45, 'start': 284.8800048828125, 'end': 288.4800109863281, 'text': \" And you're sitting across and they're not hiding behind a keyboard. They're not hiding behind a\"}, {'id': 46, 'start': 288.4800109863281, 'end': 293.2799987792969, 'text': \" kafia or sunglasses. You're actually having a conversation one-to-one with someone like this.\"}, {'id': 47, 'start': 294.0, 'end': 299.44000244140625, 'text': ' What would you want them to know? I would want them to know that, you know, from the very beginning,'}, {'id': 48, 'start': 300.0799865722656, 'end': 306.0, 'text': ' I and so many of my friends and peers in the Jewish community and our non-Jewish allies'}, {'id': 49, 'start': 306.55999755859375, 'end': 312.32000732421875, 'text': ' are committed at Columbia to the values of higher education, to the values of dialogue,'}, {'id': 50, 'start': 312.32000732421875, 'end': 317.0400085449219, 'text': ' you know, to making this a place where everyone feels like they can learn safely and where'}, {'id': 51, 'start': 317.0400085449219, 'end': 322.1600036621094, 'text': ' professors are not indoctrinating students, but engaging with students and engaging with'}, {'id': 52, 'start': 322.1600036621094, 'end': 328.6400146484375, 'text': ' diverse viewpoints. And with regard to the Middle East that, you know, I love and support Israel.'}, {'id': 53, 'start': 328.6400146484375, 'end': 333.1199951171875, 'text': \" It's a deeply important part of my Jewish identity. And it's a deeply important part of who I am.\"}, {'id': 54, 'start': 333.67999267578125, 'end': 339.20001220703125, 'text': ' Israelis are a fundamental part of the Jewish people as well, obviously, you know, half of'}, {'id': 55, 'start': 339.20001220703125, 'end': 344.3999938964844, 'text': \" the Jewish people live in Israel and we're looking for ways to make life better for everyone,\"}, {'id': 56, 'start': 344.3999938964844, 'end': 348.9599914550781, 'text': ' right? Israel is a beacon of hope for the Middle East. And, you know, we should be looking for ways'}, {'id': 57, 'start': 348.9599914550781, 'end': 353.5199890136719, 'text': ' to increase peace and to increase prosperity for the entire region.'}, {'id': 58, 'start': 353.5199890136719, 'end': 355.8399963378906, 'text': ' My brother, thank you so much and good luck with your finals.'}, {'id': 59, 'start': 356.4800109863281, 'end': 357.2799987792969, 'text': ' Thank you, sir.'}]}"