"{'text': \"The V.A. secretary joins us now. Secretary Collins thanks so much for coming on National Report. We've had more than 100 days of Trump administration 2.0. Can you share an update about what your office has been able to accomplish during this time and maybe some notable changes. I'd love to. It's good to see you all again as well. Look 100 days in the V.A. is forming up and getting focused on our mission of being a veteran centric organization back to a service organization not just an organization that happens to take care of veterans. We're only going to be dealing with our veterans making sure we're doing everything possible there. And so what we've been doing is I mean and we've talked about this a little bit before we got rid of D.A. we put the American flag in the P.O.W. my flag is the only things that will be flown here. We've already started a restructuring reorganization look to make sure that we're actually spending the monies and the people and placing people where we actually need them. As the clip just said is we were coming into this from my hearing the other day. We put billions of dollars and thousands of people into the problem at the V.A. but yet our wait times and our backlogs all went the wrong direction. So we're looking at that right now. We're able to move some money. We've been able to move several hundred million dollars away from contracts that stuff that we should have been doing anyway. PowerPoints meeting notes things like that and moving those into you know more of a health care centric looking at our community care structures. So those are the kind of things we're looking at. But it's a whole taking a big organization and moving it back to its main mission of being about veterans. Absolutely. One of the Mr. Secretary one of the biggest pushbacks at least that we've seen thus far is job cuts. The Washington Post just put out a is it really a scathing opinion piece about your handling of the V.A. and we just have a few points of it here. It reads Collins has announced the goal of eliminating 15 percent of V.A. staff some eighty three thousand jobs without any word about how he intends to go about it. This has spread fear among staff and veterans alike that health care will be curtailed. You have a response to that sir. Yeah well I'm glad there are still jobs for opinion writers to write opinions that are not based in fact. And I think the interesting thing is here is I'd also like to ask them well they want me to handle this in public. And I think you know what. Let's just go out and put all of our jobs out. Here's who we're looking to cut. What would scare them more knowing that we're taking career employees senior leadership our consultants our political staff looking at our total employee population to see if they're actually in the proper position to do what we need to do to take care of veterans or what they like for us just to talk about that in public and say well these groups over here we're thinking about getting rid of or these groups we're thinking about getting rid of. You see what we're doing is are we doing a proper job and making sure that we're taking care of veterans. So what I want to do is in a proper way without with a scalpel as opposed to what the Democrats and like I said some of the opinion writers in The Washington Post want to think they want everything out there so that they can leak it spin it and turn it into a divisive thing. We're looking at this as saying what does the VA need to do to be more veteran centric. And we're going to do that in the proper way. We're going to do it with a very measured approach. We're not measuring twice and cutting once. We're measuring three times. And again is that goal going to be the total that we have. Maybe maybe not. But I'm also not going to play that out on the backs of our employees who are actually still doing their job working hard. We need to get input from even from them which are what we're doing in our group to make sure we're doing it right. So I'm just not going to you know downplay to some opinion writer who wants to continue a scare tactic toward our veterans. Yeah understood. Well maybe here's a story they might be interested in. The White Gloves survivor outreach team. We understand this is a new initiative. Can you tell our viewers briefly what it what it entails. Yeah I can. And it really what we're doing is for the survivors that are you know experiencing one of the worst times their life. We're making sure that they the way that they can transition to the benefits that they're still available to them and getting them through that difficult time is something we're going to handle with the most utmost care and is a white glove treatment if you would. Because there's been some times when you know going through the fight for work and for anybody who's lost a loved one. You know I've had the experience of my mother passing away and you deal with the very cold nature of you know the issues of funerals and benefits and insurance. We're wanting to make sure that when they come to the V.A. to make sure that what they have coming to them is there that we're going to make it as smooth and as seamless as possible so that we can be there to comfort them in their time of need not to be a hindrance in their time of need. Love that. Love that. All right. Secretary Doug Collins joining us today. We do appreciate that Mr. Secretary. Thank you so much. Great appreciate it. See you all again. Information true is freedom is Newsmax. It's real news for real people.\", 'segments': [{'id': 0, 'start': 0.0, 'end': 7.239999771118164, 'text': \" The V.A. secretary joins us now. Secretary Collins thanks so much for coming on National Report. We've had more than 100\"}, {'id': 1, 'start': 7.239999771118164, 'end': 15.479999542236328, 'text': ' days of Trump administration 2.0. Can you share an update about what your office has been able to accomplish during this'}, {'id': 2, 'start': 15.479999542236328, 'end': 23.239999771118164, 'text': \" time and maybe some notable changes. I'd love to. It's good to see you all again as well. Look 100 days in the V.A. is forming\"}, {'id': 3, 'start': 23.239999771118164, 'end': 30.1200008392334, 'text': ' up and getting focused on our mission of being a veteran centric organization back to a service organization not just an'}, {'id': 4, 'start': 30.1200008392334, 'end': 34.91999816894531, 'text': \" organization that happens to take care of veterans. We're only going to be dealing with our veterans making sure we're doing\"}, {'id': 5, 'start': 34.91999816894531, 'end': 39.2400016784668, 'text': \" everything possible there. And so what we've been doing is I mean and we've talked about this a little bit before we got rid of\"}, {'id': 6, 'start': 39.2400016784668, 'end': 45.20000076293945, 'text': \" D.A. we put the American flag in the P.O.W. my flag is the only things that will be flown here. We've already started a\"}, {'id': 7, 'start': 45.20000076293945, 'end': 51.279998779296875, 'text': \" restructuring reorganization look to make sure that we're actually spending the monies and the people and placing people where we\"}, {'id': 8, 'start': 51.279998779296875, 'end': 56.79999923706055, 'text': ' actually need them. As the clip just said is we were coming into this from my hearing the other day. We put billions of'}, {'id': 9, 'start': 56.79999923706055, 'end': 63.279998779296875, 'text': ' dollars and thousands of people into the problem at the V.A. but yet our wait times and our backlogs all went the wrong'}, {'id': 10, 'start': 63.279998779296875, 'end': 68.5199966430664, 'text': \" direction. So we're looking at that right now. We're able to move some money. We've been able to move several hundred million\"}, {'id': 11, 'start': 68.5199966430664, 'end': 74.76000213623047, 'text': ' dollars away from contracts that stuff that we should have been doing anyway. PowerPoints meeting notes things like that and'}, {'id': 12, 'start': 74.76000213623047, 'end': 82.76000213623047, 'text': ' moving those into you know more of a health care centric looking at our community care structures. So those are the kind of'}, {'id': 13, 'start': 82.76000213623047, 'end': 88.12000274658203, 'text': \" things we're looking at. But it's a whole taking a big organization and moving it back to its main mission of being about\"}, {'id': 14, 'start': 88.12000274658203, 'end': 97.19999694824219, 'text': \" veterans. Absolutely. One of the Mr. Secretary one of the biggest pushbacks at least that we've seen thus far is job cuts. The\"}, {'id': 15, 'start': 97.19999694824219, 'end': 104.04000091552734, 'text': ' Washington Post just put out a is it really a scathing opinion piece about your handling of the V.A. and we just have a few'}, {'id': 16, 'start': 104.04000091552734, 'end': 110.68000030517578, 'text': ' points of it here. It reads Collins has announced the goal of eliminating 15 percent of V.A. staff some eighty three thousand'}, {'id': 17, 'start': 110.68000030517578, 'end': 118.44000244140625, 'text': ' jobs without any word about how he intends to go about it. This has spread fear among staff and veterans alike that health care'}, {'id': 18, 'start': 118.76000213623047, 'end': 125.91999816894531, 'text': \" will be curtailed. You have a response to that sir. Yeah well I'm glad there are still jobs for opinion writers to write opinions\"}, {'id': 19, 'start': 125.91999816894531, 'end': 131.67999267578125, 'text': \" that are not based in fact. And I think the interesting thing is here is I'd also like to ask them well they want me to handle\"}, {'id': 20, 'start': 131.67999267578125, 'end': 137.16000366210938, 'text': \" this in public. And I think you know what. Let's just go out and put all of our jobs out. Here's who we're looking to cut. What\"}, {'id': 21, 'start': 137.16000366210938, 'end': 143.52000427246094, 'text': \" would scare them more knowing that we're taking career employees senior leadership our consultants our political staff looking at\"}, {'id': 22, 'start': 143.52000427246094, 'end': 150.52000427246094, 'text': \" our total employee population to see if they're actually in the proper position to do what we need to do to take care of\"}, {'id': 23, 'start': 150.52000427246094, 'end': 155.9600067138672, 'text': \" veterans or what they like for us just to talk about that in public and say well these groups over here we're thinking about\"}, {'id': 24, 'start': 155.9600067138672, 'end': 161.47999572753906, 'text': \" getting rid of or these groups we're thinking about getting rid of. You see what we're doing is are we doing a proper job and\"}, {'id': 25, 'start': 161.47999572753906, 'end': 167.60000610351562, 'text': \" making sure that we're taking care of veterans. So what I want to do is in a proper way without with a scalpel as opposed to\"}, {'id': 26, 'start': 167.60000610351562, 'end': 174.1199951171875, 'text': ' what the Democrats and like I said some of the opinion writers in The Washington Post want to think they want everything out'}, {'id': 27, 'start': 174.1199951171875, 'end': 180.60000610351562, 'text': \" there so that they can leak it spin it and turn it into a divisive thing. We're looking at this as saying what does the VA need to\"}, {'id': 28, 'start': 180.60000610351562, 'end': 186.32000732421875, 'text': \" do to be more veteran centric. And we're going to do that in the proper way. We're going to do it with a very measured approach.\"}, {'id': 29, 'start': 186.32000732421875, 'end': 192.0800018310547, 'text': \" We're not measuring twice and cutting once. We're measuring three times. And again is that goal going to be the total that we\"}, {'id': 30, 'start': 192.0800018310547, 'end': 198.60000610351562, 'text': \" have. Maybe maybe not. But I'm also not going to play that out on the backs of our employees who are actually still doing their job\"}, {'id': 31, 'start': 198.60000610351562, 'end': 204.63999938964844, 'text': \" working hard. We need to get input from even from them which are what we're doing in our group to make sure we're doing it right. So\"}, {'id': 32, 'start': 204.63999938964844, 'end': 212.75999450683594, 'text': \" I'm just not going to you know downplay to some opinion writer who wants to continue a scare tactic toward our veterans. Yeah\"}, {'id': 33, 'start': 213.1199951171875, 'end': 220.36000061035156, 'text': \" understood. Well maybe here's a story they might be interested in. The White Gloves survivor outreach team. We understand this is a\"}, {'id': 34, 'start': 220.36000061035156, 'end': 227.0, 'text': \" new initiative. Can you tell our viewers briefly what it what it entails. Yeah I can. And it really what we're doing is for the\"}, {'id': 35, 'start': 227.0, 'end': 233.52000427246094, 'text': \" survivors that are you know experiencing one of the worst times their life. We're making sure that they the way that they can\"}, {'id': 36, 'start': 233.52000427246094, 'end': 240.1999969482422, 'text': \" transition to the benefits that they're still available to them and getting them through that difficult time is something we're going\"}, {'id': 37, 'start': 240.1999969482422, 'end': 245.9600067138672, 'text': \" to handle with the most utmost care and is a white glove treatment if you would. Because there's been some times when you know\"}, {'id': 38, 'start': 246.0, 'end': 252.27999877929688, 'text': \" going through the fight for work and for anybody who's lost a loved one. You know I've had the experience of my mother passing away\"}, {'id': 39, 'start': 252.27999877929688, 'end': 258.9599914550781, 'text': \" and you deal with the very cold nature of you know the issues of funerals and benefits and insurance. We're wanting to make sure that\"}, {'id': 40, 'start': 258.9599914550781, 'end': 264.3599853515625, 'text': \" when they come to the V.A. to make sure that what they have coming to them is there that we're going to make it as smooth and as\"}, {'id': 41, 'start': 264.3999938964844, 'end': 270.7200012207031, 'text': ' seamless as possible so that we can be there to comfort them in their time of need not to be a hindrance in their time of need. Love'}, {'id': 42, 'start': 270.7200012207031, 'end': 277.0799865722656, 'text': ' that. Love that. All right. Secretary Doug Collins joining us today. We do appreciate that Mr. Secretary. Thank you so much. Great'}, {'id': 43, 'start': 277.0799865722656, 'end': 277.9200134277344, 'text': ' appreciate it. See you all again.'}, {'id': 44, 'start': 279.79998779296875, 'end': 280.79998779296875, 'text': ' Information'}, {'id': 45, 'start': 282.5199890136719, 'end': 283.0400085449219, 'text': ' true'}, {'id': 46, 'start': 285.3999938964844, 'end': 286.32000732421875, 'text': ' is freedom'}, {'id': 47, 'start': 288.5199890136719, 'end': 293.6400146484375, 'text': \" is Newsmax. It's real news for real people.\"}]}"