"{'text': \"Fox News alert, Arab Spring Breakers are taking over Columbia, again. Over a hundred college jihadis stormed into the campus library and tore the place up. After holding the library hostage, the radicals demanded Columbia let their people go. But the university had different plans. No one can leave unless you show ID. The rioters weren't thrilled and tried to bum rush their way out. Let us go! Let us go! Let us go! Let us go! Let us go! Let us go! Let us go! Let us go! Let us go! Let us go! Let us go! Columbia University is going to have to cut around 180 staff members because the Trump administration has announced it's cancelling $400 million in federal funding. The Columbia University announced these cuts overnight. The Ivy League school was targeted for these cuts because of its failure to protect Jewish students from anti-Semitic harassment. I'm having trouble feeling sorry for Columbia here. Yeah, that's absolutely right. The things that the Trump administration is asking from these universities are things that they already owe their students in exchange for federal funding. We have civil rights laws that they are expected to follow, which they really failed to do in the case of Jewish students. I'm not one who felt that Jewish students were actually unsafe. I don't like that language. I think it diminishes the power that we have in our community. I don't think they were physically unsafe, but what they were, Rita, was they were discriminated against by an administration that treats all of its students one way and its Jewish students another way, and it expected them to just eat the harassment that they were facing, and that is discriminatory. And as a result, the Trump administration has withdrawn its funding. It's such an amazing moment. I mean, you know, as a Jewish American, to see the president standing up for my rights, it's a really, really wonderful thing that's happening. Unfortunately, many, many Jews in America are on the left and are Democrats, about two-thirds to three-quarters of the community, and so they don't really recognize what a gift this is. That does not diminish the fact that the Trump administration is standing up for our community in a very unique and unprecedented way, and I am very grateful for it.\", 'segments': [{'id': 0, 'start': 0.0, 'end': 4.159999847412109, 'text': ' Fox News alert, Arab Spring Breakers are taking over Columbia, again.'}, {'id': 1, 'start': 4.159999847412109, 'end': 8.800000190734863, 'text': ' Over a hundred college jihadis stormed into the campus library and tore the place up.'}, {'id': 2, 'start': 9.4399995803833, 'end': 13.359999656677246, 'text': ' After holding the library hostage, the radicals demanded Columbia let their people go.'}, {'id': 3, 'start': 13.920000076293945, 'end': 19.280000686645508, 'text': ' But the university had different plans. No one can leave unless you show ID.'}, {'id': 4, 'start': 20.0, 'end': 23.440000534057617, 'text': \" The rioters weren't thrilled and tried to bum rush their way out.\"}, {'id': 5, 'start': 30.0, 'end': 45.040000915527344, 'text': ' Let us go! Let us go!'}, {'id': 6, 'start': 90.0, 'end': 119.04000091552734, 'text': ' Let us go!'}, {'id': 7, 'start': 119.04000091552734, 'end': 140.0800018310547, 'text': ' Let us go!'}, {'id': 8, 'start': 149.0399932861328, 'end': 162.0800018310547, 'text': ' Let us go!'}, {'id': 9, 'start': 179.0399932861328, 'end': 200.0800018310547, 'text': ' Let us go!'}, {'id': 10, 'start': 209.0399932861328, 'end': 238.0800018310547, 'text': ' Let us go!'}, {'id': 11, 'start': 239.0399932861328, 'end': 268.0799865722656, 'text': ' Let us go!'}, {'id': 12, 'start': 269.0400085449219, 'end': 298.0799865722656, 'text': ' Let us go!'}, {'id': 13, 'start': 299.0400085449219, 'end': 312.0799865722656, 'text': ' Let us go!'}, {'id': 14, 'start': 312.0799865722656, 'end': 324.7200012207031, 'text': ' Let us go!'}, {'id': 15, 'start': 324.7200012207031, 'end': 330.79998779296875, 'text': ' Columbia University is going to have to cut around 180 staff members because the Trump'}, {'id': 16, 'start': 330.79998779296875, 'end': 337.20001220703125, 'text': \" administration has announced it's cancelling $400 million in federal funding. The Columbia\"}, {'id': 17, 'start': 337.20001220703125, 'end': 344.3999938964844, 'text': ' University announced these cuts overnight. The Ivy League school was targeted for these cuts'}, {'id': 18, 'start': 344.3999938964844, 'end': 350.32000732421875, 'text': ' because of its failure to protect Jewish students from anti-Semitic harassment.'}, {'id': 19, 'start': 351.0400085449219, 'end': 354.1600036621094, 'text': \" I'm having trouble feeling sorry for Columbia here.\"}, {'id': 20, 'start': 356.1600036621094, 'end': 361.8399963378906, 'text': \" Yeah, that's absolutely right. The things that the Trump administration is asking from these\"}, {'id': 21, 'start': 361.8399963378906, 'end': 367.9200134277344, 'text': ' universities are things that they already owe their students in exchange for federal funding.'}, {'id': 22, 'start': 368.6400146484375, 'end': 373.1199951171875, 'text': ' We have civil rights laws that they are expected to follow, which they really failed to do in the'}, {'id': 23, 'start': 373.1199951171875, 'end': 380.0799865722656, 'text': \" case of Jewish students. I'm not one who felt that Jewish students were actually unsafe. I don't like\"}, {'id': 24, 'start': 380.0799865722656, 'end': 386.1600036621094, 'text': \" that language. I think it diminishes the power that we have in our community. I don't think they\"}, {'id': 25, 'start': 386.1600036621094, 'end': 391.6000061035156, 'text': ' were physically unsafe, but what they were, Rita, was they were discriminated against by an'}, {'id': 26, 'start': 391.6000061035156, 'end': 397.2799987792969, 'text': ' administration that treats all of its students one way and its Jewish students another way, and it'}, {'id': 27, 'start': 397.2799987792969, 'end': 403.20001220703125, 'text': ' expected them to just eat the harassment that they were facing, and that is discriminatory.'}, {'id': 28, 'start': 403.20001220703125, 'end': 408.0, 'text': \" And as a result, the Trump administration has withdrawn its funding. It's such an amazing moment.\"}, {'id': 29, 'start': 408.0, 'end': 414.239990234375, 'text': \" I mean, you know, as a Jewish American, to see the president standing up for my rights, it's a really,\"}, {'id': 30, 'start': 414.239990234375, 'end': 419.67999267578125, 'text': \" really wonderful thing that's happening. Unfortunately, many, many Jews in America\"}, {'id': 31, 'start': 419.67999267578125, 'end': 424.32000732421875, 'text': ' are on the left and are Democrats, about two-thirds to three-quarters of the community,'}, {'id': 32, 'start': 424.32000732421875, 'end': 428.79998779296875, 'text': \" and so they don't really recognize what a gift this is. That does not diminish the fact\"}, {'id': 33, 'start': 428.79998779296875, 'end': 432.239990234375, 'text': ' that the Trump administration is standing up for our community'}, {'id': 34, 'start': 432.239990234375, 'end': 436.4800109863281, 'text': ' in a very unique and unprecedented way, and I am very grateful for it.'}]}"