"{'text': \"I hate to be the bearer of bad news, but ISIS has a message for America. Yeah, it seems that ISIS is actually making somewhat of a return right now, at least in popularity. And I do think it has something to do with Israel-Palestine. I'll give you my thoughts on this after. I'm Tal the Traveling Clat, your favorite white colonizer. Let's take a look. ISIS releases a new disturbing propaganda video threatening that you must leave. That's insane. I mean, with the power of AI now, they can really bring their wildest dreams to reality. I know it's kind of a small window here, but if you can't really tell what's going on in the video, essentially you have these ISIS soldiers atop of the White House bringing down an American flag. They toss a flag off the rooftop, then a missile goes off, and then they're raising the ISIS flag in the White House. And things are on fire as America is burning. You know, you have to understand something. Since the October 7th war broke out, there's been a resurgence. I would even call it kind of like an awakening amongst Muslims all over the world. And Muslims are now deeply divided. Muslims now hold themselves as the Muslims who want to be more moderate. And I would say that it's unfortunately a very small minority of the global Muslims that are like this. And the Muslims who want to have a global caliphate again, they want to bring on the glory days of Islam once more, which they never really existed because the glory days of Islam were just Arab colonization through the Middle East and North Africa. Yeah, there were certain periods of time where advances in science and technology were made and health, and it was great, but all while they were colonizing and murdering millions of people throughout the Middle East and North Africa. That part is not really talked about too much. And being a Jew who comes from a Mizrahi background, we were directly affected by that, so I have to always talk about it. But you now have the Muslim world casted into this side of, do we want to fight the West eternally in a battle against the West, against Western values, and try to really establish a caliphate once more, an Islamic caliphate. The people in ISIS, who are now head of the country Syria once again, are 100% in to make that a reality. They believe in that concept and they want to make it a reality, they're pushing for it. Now, the Muslims in the West are very emboldened by this ideology because they see themselves as the others in the West. Instead of assimilating and instead of wanting to be a part of the Western countries that they're in, they actually look down on the Western nations. And we've covered a video on this in the past, like even like Epic City, when you saw that video of the Muslims talking about how they're laughing and they're shocked at this idea of a Bangladeshi immigrant who's able to come to America and rename streets in America off the names of Islamic conquestors slash colonizers, warlords. And they're shocked that you allow them to do this. And that's how we end up with videos like this from ISIS, because they see the light at the end of the tunnel, which is an Islamic caliphate in America. They're not joking about it. It may be funny to us in the West, it may be funny to you, you may be like, oh, they'll never be able to do it. They're taking it seriously. And they're going to keep bothering you. They're going to keep trying to kill people. And they may never succeed. But their terrorism puts all of our lives in danger. This ideology, they take it seriously. They're believing in it. And they think they can actually do it. So I would say heed their warning, because if in 2025, we're sitting here in a reality where ISIS is making AI videos announcing that they want to take over the United States of America. You've had a very big emboldening of extremist Islam since the October 7th war. The blood was spilled in the most ruthless ways. You have to imagine, there's a lot of really reprived, disgusting people out there who watch the videos of October 7th, not in fear and shock and awe like the rest of us. But they watch those videos of October 7th in honor, in inspiration. And they hold those videos in their sick, twisted minds. And you don't know who they are. You don't know who they could be. They could be anybody. But they might try to attempt that. Those videos, when Hamas put them out, they put them out to embarrass the Jewish people and Israel first and foremost. But they also put them out to inspire. And you see what happened just this last week with the Jewish community in Syria. They're very much inspired by October 7th. You saw what happened in Kashmir, where Pakistani terrorists started murdering Indian Hindus and Muslims. And you saw how they were inspired to do it. I'm telling you, you've got to be really careful moving forward in the future. You've got to watch your back. The world is becoming a dangerous place. And I'm not saying this to fear monger. It's the truth. I'll see you guys in the next one. I love you a long time. Goodbye, clouts. If you believe in my content and want to support me, just know your help is needed. There's a bunch of great ways to support me, being PayPal, buy me a coffee, or joining my Patreon community down below. Patreon is the best way to support my channel. And you'll get a bunch of cool perks depending on what tier you join. Another great way to support me is by buying my merchandise on thetravellingclout.com. I regularly drop new merch designs like this beautiful hat or this amazing shirt, where you can support the channel and get something cool for yourself. I also have an amazing Discord community with people from all over the world. Thank you so much for your support.\", 'segments': [{'id': 0, 'start': 0.0, 'end': 5.0, 'text': ' I hate to be the bearer of bad news, but ISIS has a message for America.'}, {'id': 1, 'start': 5.0, 'end': 11.0, 'text': ' Yeah, it seems that ISIS is actually making somewhat of a return right now, at least in popularity.'}, {'id': 2, 'start': 11.0, 'end': 15.0, 'text': \" And I do think it has something to do with Israel-Palestine. I'll give you my thoughts on this after.\"}, {'id': 3, 'start': 15.0, 'end': 18.0, 'text': \" I'm Tal the Traveling Clat, your favorite white colonizer. Let's take a look.\"}, {'id': 4, 'start': 18.0, 'end': 25.0, 'text': ' ISIS releases a new disturbing propaganda video threatening that you must leave.'}, {'id': 5, 'start': 48.0, 'end': 63.0, 'text': \" That's insane. I mean, with the power of AI now, they can really bring their wildest dreams to reality.\"}, {'id': 6, 'start': 63.0, 'end': 69.0, 'text': \" I know it's kind of a small window here, but if you can't really tell what's going on in the video,\"}, {'id': 7, 'start': 69.0, 'end': 74.0, 'text': ' essentially you have these ISIS soldiers atop of the White House bringing down an American flag.'}, {'id': 8, 'start': 74.0, 'end': 84.0, 'text': \" They toss a flag off the rooftop, then a missile goes off, and then they're raising the ISIS flag in the White House.\"}, {'id': 9, 'start': 84.0, 'end': 88.0, 'text': ' And things are on fire as America is burning.'}, {'id': 10, 'start': 88.0, 'end': 94.0, 'text': ' You know, you have to understand something.'}, {'id': 11, 'start': 94.0, 'end': 99.0, 'text': \" Since the October 7th war broke out, there's been a resurgence.\"}, {'id': 12, 'start': 99.0, 'end': 103.0, 'text': ' I would even call it kind of like an awakening amongst Muslims all over the world.'}, {'id': 13, 'start': 103.0, 'end': 106.0, 'text': ' And Muslims are now deeply divided.'}, {'id': 14, 'start': 106.0, 'end': 110.0, 'text': ' Muslims now hold themselves as the Muslims who want to be more moderate.'}, {'id': 15, 'start': 110.0, 'end': 115.0, 'text': \" And I would say that it's unfortunately a very small minority of the global Muslims that are like this.\"}, {'id': 16, 'start': 115.0, 'end': 123.0, 'text': ' And the Muslims who want to have a global caliphate again, they want to bring on the glory days of Islam once more,'}, {'id': 17, 'start': 123.0, 'end': 129.0, 'text': ' which they never really existed because the glory days of Islam were just Arab colonization through the Middle East and North Africa.'}, {'id': 18, 'start': 129.0, 'end': 134.0, 'text': ' Yeah, there were certain periods of time where advances in science and technology were made and health, and it was great,'}, {'id': 19, 'start': 134.0, 'end': 140.0, 'text': ' but all while they were colonizing and murdering millions of people throughout the Middle East and North Africa.'}, {'id': 20, 'start': 140.0, 'end': 143.0, 'text': ' That part is not really talked about too much.'}, {'id': 21, 'start': 143.0, 'end': 151.0, 'text': ' And being a Jew who comes from a Mizrahi background, we were directly affected by that, so I have to always talk about it.'}, {'id': 22, 'start': 151.0, 'end': 164.0, 'text': ' But you now have the Muslim world casted into this side of, do we want to fight the West eternally in a battle against the West, against Western values,'}, {'id': 23, 'start': 164.0, 'end': 171.0, 'text': ' and try to really establish a caliphate once more, an Islamic caliphate.'}, {'id': 24, 'start': 171.0, 'end': 179.0, 'text': ' The people in ISIS, who are now head of the country Syria once again, are 100% in to make that a reality.'}, {'id': 25, 'start': 179.0, 'end': 183.0, 'text': \" They believe in that concept and they want to make it a reality, they're pushing for it.\"}, {'id': 26, 'start': 183.0, 'end': 192.0, 'text': ' Now, the Muslims in the West are very emboldened by this ideology because they see themselves as the others in the West.'}, {'id': 27, 'start': 192.0, 'end': 198.0, 'text': \" Instead of assimilating and instead of wanting to be a part of the Western countries that they're in, they actually look down on the Western nations.\"}, {'id': 28, 'start': 198.0, 'end': 205.0, 'text': \" And we've covered a video on this in the past, like even like Epic City, when you saw that video of the Muslims talking about how they're laughing\"}, {'id': 29, 'start': 205.0, 'end': 218.0, 'text': \" and they're shocked at this idea of a Bangladeshi immigrant who's able to come to America and rename streets in America off the names of Islamic conquestors slash colonizers, warlords.\"}, {'id': 30, 'start': 218.0, 'end': 222.0, 'text': \" And they're shocked that you allow them to do this.\"}, {'id': 31, 'start': 222.0, 'end': 229.0, 'text': \" And that's how we end up with videos like this from ISIS, because they see the light at the end of the tunnel, which is an Islamic caliphate in America.\"}, {'id': 32, 'start': 229.0, 'end': 231.0, 'text': \" They're not joking about it.\"}, {'id': 33, 'start': 231.0, 'end': 235.0, 'text': \" It may be funny to us in the West, it may be funny to you, you may be like, oh, they'll never be able to do it.\"}, {'id': 34, 'start': 235.0, 'end': 237.0, 'text': \" They're taking it seriously.\"}, {'id': 35, 'start': 237.0, 'end': 239.0, 'text': \" And they're going to keep bothering you.\"}, {'id': 36, 'start': 239.0, 'end': 241.0, 'text': \" They're going to keep trying to kill people.\"}, {'id': 37, 'start': 241.0, 'end': 243.0, 'text': ' And they may never succeed.'}, {'id': 38, 'start': 243.0, 'end': 247.0, 'text': ' But their terrorism puts all of our lives in danger.'}, {'id': 39, 'start': 247.0, 'end': 251.0, 'text': ' This ideology, they take it seriously.'}, {'id': 40, 'start': 251.0, 'end': 252.0, 'text': \" They're believing in it.\"}, {'id': 41, 'start': 252.0, 'end': 254.0, 'text': ' And they think they can actually do it.'}, {'id': 42, 'start': 254.0, 'end': 264.0, 'text': \" So I would say heed their warning, because if in 2025, we're sitting here in a reality where ISIS is making AI videos announcing that they want to take over the United States of America.\"}, {'id': 43, 'start': 264.0, 'end': 271.0, 'text': \" You've had a very big emboldening of extremist Islam since the October 7th war.\"}, {'id': 44, 'start': 271.0, 'end': 274.0, 'text': ' The blood was spilled in the most ruthless ways.'}, {'id': 45, 'start': 274.0, 'end': 284.0, 'text': \" You have to imagine, there's a lot of really reprived, disgusting people out there who watch the videos of October 7th, not in fear and shock and awe like the rest of us.\"}, {'id': 46, 'start': 284.0, 'end': 289.0, 'text': ' But they watch those videos of October 7th in honor, in inspiration.'}, {'id': 47, 'start': 289.0, 'end': 292.0, 'text': ' And they hold those videos in their sick, twisted minds.'}, {'id': 48, 'start': 292.0, 'end': 294.0, 'text': \" And you don't know who they are.\"}, {'id': 49, 'start': 294.0, 'end': 296.0, 'text': \" You don't know who they could be.\"}, {'id': 50, 'start': 296.0, 'end': 298.0, 'text': ' They could be anybody.'}, {'id': 51, 'start': 298.0, 'end': 300.0, 'text': ' But they might try to attempt that.'}, {'id': 52, 'start': 300.0, 'end': 306.0, 'text': ' Those videos, when Hamas put them out, they put them out to embarrass the Jewish people and Israel first and foremost.'}, {'id': 53, 'start': 306.0, 'end': 309.0, 'text': ' But they also put them out to inspire.'}, {'id': 54, 'start': 309.0, 'end': 313.0, 'text': ' And you see what happened just this last week with the Jewish community in Syria.'}, {'id': 55, 'start': 313.0, 'end': 315.0, 'text': \" They're very much inspired by October 7th.\"}, {'id': 56, 'start': 315.0, 'end': 323.0, 'text': ' You saw what happened in Kashmir, where Pakistani terrorists started murdering Indian Hindus and Muslims.'}, {'id': 57, 'start': 323.0, 'end': 326.0, 'text': ' And you saw how they were inspired to do it.'}, {'id': 58, 'start': 326.0, 'end': 330.0, 'text': \" I'm telling you, you've got to be really careful moving forward in the future.\"}, {'id': 59, 'start': 330.0, 'end': 331.0, 'text': \" You've got to watch your back.\"}, {'id': 60, 'start': 331.0, 'end': 333.0, 'text': ' The world is becoming a dangerous place.'}, {'id': 61, 'start': 333.0, 'end': 335.0, 'text': \" And I'm not saying this to fear monger.\"}, {'id': 62, 'start': 335.0, 'end': 336.0, 'text': \" It's the truth.\"}, {'id': 63, 'start': 336.0, 'end': 337.0, 'text': \" I'll see you guys in the next one.\"}, {'id': 64, 'start': 337.0, 'end': 338.0, 'text': ' I love you a long time.'}, {'id': 65, 'start': 338.0, 'end': 339.0, 'text': ' Goodbye, clouts.'}, {'id': 66, 'start': 339.0, 'end': 342.0, 'text': ' If you believe in my content and want to support me, just know your help is needed.'}, {'id': 67, 'start': 342.0, 'end': 349.0, 'text': \" There's a bunch of great ways to support me, being PayPal, buy me a coffee, or joining my Patreon community down below.\"}, {'id': 68, 'start': 349.0, 'end': 351.0, 'text': ' Patreon is the best way to support my channel.'}, {'id': 69, 'start': 351.0, 'end': 354.0, 'text': \" And you'll get a bunch of cool perks depending on what tier you join.\"}, {'id': 70, 'start': 354.0, 'end': 357.0, 'text': ' Another great way to support me is by buying my merchandise on thetravellingclout.com.'}, {'id': 71, 'start': 357.0, 'end': 365.0, 'text': ' I regularly drop new merch designs like this beautiful hat or this amazing shirt, where you can support the channel and get something cool for yourself.'}, {'id': 72, 'start': 365.0, 'end': 368.0, 'text': ' I also have an amazing Discord community with people from all over the world.'}, {'id': 73, 'start': 368.0, 'end': 370.0, 'text': ' Thank you so much for your support.'}]}"