"{'text': \"Breaking news, dozens of pro-Palestinian protesters have stormed Columbia University's Butler Library. Okay, Fox 5's Linda Schmitz live outside the campus in Morningside Heights. Linda, what's the situation like right now? Okay, it's one of those typical situations that we've seen many times before here at Columbia since last spring. But I want, David, I want you to just pan over here so we can see a whole big group of police officers. Do me a favor, just slide out of the way here. Police of NYPD gathered here outside Butler Library here on the campus of Columbia University as well as campus security. David, if you can go ahead and come back to me now. What we are waiting for, this is the back entrance to the library. They have been bringing some of the protesters out here in handcuffs, handcuffed behind their back. They are not being arrested by the NYPD, instead they are being arrested by public safety officers. Now those public safety officers were hired by the university. That was one of the requests by the Trump administration if the university wanted to have its $400 million in federal funding restored. Now go ahead, take a look at this video here because this is video that was posted on X from some of the students who were inside Butler Library when the one room was taken over by about 100 massed protesters that happened about 3.15 this afternoon. Now this is, keep in mind, students here are studying for finals and this is what was going on starting at about 3.15 this afternoon. Now let's take a look at the chopper footage here. This is outside Butler Library which is on campus and you can see there's probably a group of about 100 students, some of them wanting to get into the library in order to study but then there's some scuffling going on in the group there because some of the protesters ended up coming outside the library and interacting with the students who wanted nothing to do with this demonstration. In addition, we've got some video here. This is just one of the protesters who was arrested again by public safety officers here at the campus and we're not sure if the people being arrested or any of those protesters, we're not sure who is a student and who is not at this particular time. Now Columbia University issuing this statement, quote, it is completely unacceptable that some individuals are choosing to disrupt academic activities as our students are studying and preparing for final exams. These disruptions of our campus and academic activities will not be tolerated. Individuals found to be in violation of university rules and policies will face disciplinary consequences. And again, as I said at the top, this is something new. The university now has new rules as a result of demands from the Trump administration and the Trump administration's attempt to cut down on antisemitism and to eliminate it here, not just on college campuses but across the country. One of the rules is you're not allowed to wear masks anymore on campus here for a protest. So everybody that was part of that protest group, they all had masks on. They were in violation of the university policy. So obviously you are not allowed to take over any of the buildings, any of the rooms, any of the living quarters here on campus, period. So now we're going to have to wait and see the disciplinary procedures, what's going to be happening next, and what is exactly going to happen with these protesters if they are in fact students. But again, this is still going on. Most of the students have been brought out, the protesters. They are either on campus or they have been taken away in handcuffs. Back inside to you. Alright, thanks Linda.\", 'segments': [{'id': 0, 'start': 0.0, 'end': 5.71999979019165, 'text': \" Breaking news, dozens of pro-Palestinian protesters have stormed Columbia University's Butler\"}, {'id': 1, 'start': 5.71999979019165, 'end': 6.71999979019165, 'text': ' Library.'}, {'id': 2, 'start': 6.71999979019165, 'end': 9.880000114440918, 'text': \" Okay, Fox 5's Linda Schmitz live outside the campus in Morningside Heights.\"}, {'id': 3, 'start': 9.880000114440918, 'end': 12.0, 'text': \" Linda, what's the situation like right now?\"}, {'id': 4, 'start': 12.0, 'end': 17.719999313354492, 'text': \" Okay, it's one of those typical situations that we've seen many times before here at\"}, {'id': 5, 'start': 17.719999313354492, 'end': 19.239999771118164, 'text': ' Columbia since last spring.'}, {'id': 6, 'start': 19.239999771118164, 'end': 22.559999465942383, 'text': ' But I want, David, I want you to just pan over here so we can see a whole big group'}, {'id': 7, 'start': 22.559999465942383, 'end': 23.559999465942383, 'text': ' of police officers.'}, {'id': 8, 'start': 23.559999465942383, 'end': 26.559999465942383, 'text': ' Do me a favor, just slide out of the way here.'}, {'id': 9, 'start': 26.559999465942383, 'end': 32.439998626708984, 'text': ' Police of NYPD gathered here outside Butler Library here on the campus of Columbia University'}, {'id': 10, 'start': 32.439998626708984, 'end': 34.08000183105469, 'text': ' as well as campus security.'}, {'id': 11, 'start': 34.08000183105469, 'end': 36.84000015258789, 'text': ' David, if you can go ahead and come back to me now.'}, {'id': 12, 'start': 36.84000015258789, 'end': 40.47999954223633, 'text': ' What we are waiting for, this is the back entrance to the library.'}, {'id': 13, 'start': 40.47999954223633, 'end': 45.47999954223633, 'text': ' They have been bringing some of the protesters out here in handcuffs, handcuffed behind their'}, {'id': 14, 'start': 45.47999954223633, 'end': 46.47999954223633, 'text': ' back.'}, {'id': 15, 'start': 46.47999954223633, 'end': 52.720001220703125, 'text': ' They are not being arrested by the NYPD, instead they are being arrested by public safety officers.'}, {'id': 16, 'start': 52.720001220703125, 'end': 56.47999954223633, 'text': ' Now those public safety officers were hired by the university.'}, {'id': 17, 'start': 56.47999954223633, 'end': 61.279998779296875, 'text': ' That was one of the requests by the Trump administration if the university wanted to'}, {'id': 18, 'start': 61.279998779296875, 'end': 64.63999938964844, 'text': ' have its $400 million in federal funding restored.'}, {'id': 19, 'start': 64.63999938964844, 'end': 68.91999816894531, 'text': ' Now go ahead, take a look at this video here because this is video that was posted on X'}, {'id': 20, 'start': 68.91999816894531, 'end': 73.4800033569336, 'text': ' from some of the students who were inside Butler Library when the one room was taken'}, {'id': 21, 'start': 73.4800033569336, 'end': 79.0999984741211, 'text': ' over by about 100 massed protesters that happened about 3.15 this afternoon.'}, {'id': 22, 'start': 79.0999984741211, 'end': 84.68000030517578, 'text': ' Now this is, keep in mind, students here are studying for finals and this is what was going'}, {'id': 23, 'start': 84.68000030517578, 'end': 87.76000213623047, 'text': ' on starting at about 3.15 this afternoon.'}, {'id': 24, 'start': 87.76000213623047, 'end': 90.27999877929688, 'text': \" Now let's take a look at the chopper footage here.\"}, {'id': 25, 'start': 90.27999877929688, 'end': 95.68000030517578, 'text': \" This is outside Butler Library which is on campus and you can see there's probably a\"}, {'id': 26, 'start': 95.68000030517578, 'end': 100.95999908447266, 'text': ' group of about 100 students, some of them wanting to get into the library in order to'}, {'id': 27, 'start': 100.95999908447266, 'end': 105.0, 'text': \" study but then there's some scuffling going on in the group there because some of the\"}, {'id': 28, 'start': 105.0, 'end': 111.08000183105469, 'text': ' protesters ended up coming outside the library and interacting with the students who wanted'}, {'id': 29, 'start': 111.08000183105469, 'end': 113.68000030517578, 'text': ' nothing to do with this demonstration.'}, {'id': 30, 'start': 113.68000030517578, 'end': 115.4000015258789, 'text': \" In addition, we've got some video here.\"}, {'id': 31, 'start': 115.4000015258789, 'end': 121.04000091552734, 'text': ' This is just one of the protesters who was arrested again by public safety officers'}, {'id': 32, 'start': 121.04000091552734, 'end': 128.60000610351562, 'text': \" here at the campus and we're not sure if the people being arrested or any of those protesters,\"}, {'id': 33, 'start': 128.60000610351562, 'end': 133.16000366210938, 'text': \" we're not sure who is a student and who is not at this particular time.\"}, {'id': 34, 'start': 133.16000366210938, 'end': 139.0, 'text': ' Now Columbia University issuing this statement, quote, it is completely unacceptable that'}, {'id': 35, 'start': 139.0, 'end': 144.1199951171875, 'text': ' some individuals are choosing to disrupt academic activities as our students are studying'}, {'id': 36, 'start': 144.1199951171875, 'end': 146.36000061035156, 'text': ' and preparing for final exams.'}, {'id': 37, 'start': 146.36000061035156, 'end': 152.24000549316406, 'text': ' These disruptions of our campus and academic activities will not be tolerated.'}, {'id': 38, 'start': 152.24000549316406, 'end': 158.0800018310547, 'text': ' Individuals found to be in violation of university rules and policies will face disciplinary'}, {'id': 39, 'start': 158.0800018310547, 'end': 159.75999450683594, 'text': ' consequences.'}, {'id': 40, 'start': 159.75999450683594, 'end': 163.27999877929688, 'text': ' And again, as I said at the top, this is something new.'}, {'id': 41, 'start': 163.27999877929688, 'end': 169.27999877929688, 'text': ' The university now has new rules as a result of demands from the Trump administration and'}, {'id': 42, 'start': 169.27999877929688, 'end': 175.32000732421875, 'text': \" the Trump administration's attempt to cut down on antisemitism and to eliminate it here,\"}, {'id': 43, 'start': 175.32000732421875, 'end': 178.16000366210938, 'text': ' not just on college campuses but across the country.'}, {'id': 44, 'start': 178.16000366210938, 'end': 183.47999572753906, 'text': \" One of the rules is you're not allowed to wear masks anymore on campus here for a protest.\"}, {'id': 45, 'start': 183.47999572753906, 'end': 186.9600067138672, 'text': ' So everybody that was part of that protest group, they all had masks on.'}, {'id': 46, 'start': 186.9600067138672, 'end': 189.8000030517578, 'text': ' They were in violation of the university policy.'}, {'id': 47, 'start': 189.83999633789062, 'end': 195.16000366210938, 'text': ' So obviously you are not allowed to take over any of the buildings, any of the rooms, any'}, {'id': 48, 'start': 195.16000366210938, 'end': 199.67999267578125, 'text': ' of the living quarters here on campus, period.'}, {'id': 49, 'start': 199.67999267578125, 'end': 204.1199951171875, 'text': \" So now we're going to have to wait and see the disciplinary procedures, what's going\"}, {'id': 50, 'start': 204.1199951171875, 'end': 208.47999572753906, 'text': ' to be happening next, and what is exactly going to happen with these protesters if they'}, {'id': 51, 'start': 208.47999572753906, 'end': 210.36000061035156, 'text': ' are in fact students.'}, {'id': 52, 'start': 210.36000061035156, 'end': 212.8000030517578, 'text': ' But again, this is still going on.'}, {'id': 53, 'start': 212.8000030517578, 'end': 215.83999633789062, 'text': ' Most of the students have been brought out, the protesters.'}, {'id': 54, 'start': 215.8800048828125, 'end': 220.0800018310547, 'text': ' They are either on campus or they have been taken away in handcuffs.'}, {'id': 55, 'start': 220.0800018310547, 'end': 221.0800018310547, 'text': ' Back inside to you.'}, {'id': 56, 'start': 221.0800018310547, 'end': 221.9199981689453, 'text': ' Alright, thanks Linda.'}]}"