"{'text': \"You know, Alyssa Slotkin, senator from Michigan, she said, you shouldn't be using oligarch. It's over people's head. You've gotten criticized from other people. Free Beacon says Bernie Sanders spent $221,000 on private jets fighting the oligarchy tour paid for by friends of Bernie Sanders, that you've spent millions of dollars in campaign funds on private jet travel over the years. How do you push back on both of those things? When's the last time you saw Donald Trump during a campaign mode at National Airport? No, no, no. No, he doesn't. But he's also not fighting the oligarchy. No. You run a campaign and you do three or four or five rallies in a week. The only way you can get around to talk to 30,000 people, think I'm going to be sitting on a waiting line at United waiting while 30,000 people are waiting. That's the only way you can get around. No apologies for that. That's what campaign travel is about. We've done it in the past. We're going to do it in the future. It's time to check in again on the lunatic asylum masquerading as a news network known as MSNBC. But let's listen to this hot take from Joe Scarborough, AOC may be more progressive than a lot of people. I also understand that she's one of the most articulate, exciting people in the democratic field. She goes out with Bernie Sanders and and yeah, she just draws so many people very good, very effective in hearings. They need somebody young like AOC. And again, it's not about ideology. You know, they she can carry the message forward for a democratic party that really needs to reach out to younger Americans. Yes. Let's have a look at just how articulate and impressive AOC is prepared to be dazzled by her rare genius. Even as a waitress, if any of you all else have gotten gone like completely mad, like, whatever, you know, and like or whatever, like, just like it's like, like, like this, like, like, like what people are starting to see, at least in the occupation of Palestine. You use the term the occupation of Palestine. What did you mean by that? Oh, I think what I meant is like the the settlements that are increasing in some of these areas and in places where we're Palestinians are experiencing difficulty in access to their housing and homes. Do you think you can expand on that? Yeah. I mean, I think I'd also just I I am not the expert geopolitics on this issue, you know.\", 'segments': [{'id': 0, 'start': 0.0, 'end': 4.400000095367432, 'text': \" You know, Alyssa Slotkin, senator from Michigan, she said, you shouldn't be using oligarch.\"}, {'id': 1, 'start': 4.400000095367432, 'end': 6.119999885559082, 'text': \" It's over people's head.\"}, {'id': 2, 'start': 6.119999885559082, 'end': 8.0, 'text': \" You've gotten criticized from other people.\"}, {'id': 3, 'start': 8.0, 'end': 14.15999984741211, 'text': ' Free Beacon says Bernie Sanders spent $221,000 on private jets fighting the oligarchy tour'}, {'id': 4, 'start': 14.15999984741211, 'end': 18.68000030517578, 'text': \" paid for by friends of Bernie Sanders, that you've spent millions of dollars in campaign\"}, {'id': 5, 'start': 18.68000030517578, 'end': 21.959999084472656, 'text': ' funds on private jet travel over the years.'}, {'id': 6, 'start': 21.959999084472656, 'end': 23.520000457763672, 'text': ' How do you push back on both of those things?'}, {'id': 7, 'start': 23.520000457763672, 'end': 28.799999237060547, 'text': \" When's the last time you saw Donald Trump during a campaign mode at National Airport?\"}, {'id': 8, 'start': 28.799999237060547, 'end': 29.799999237060547, 'text': ' No, no, no.'}, {'id': 9, 'start': 29.799999237060547, 'end': 30.799999237060547, 'text': \" No, he doesn't.\"}, {'id': 10, 'start': 30.799999237060547, 'end': 32.560001373291016, 'text': \" But he's also not fighting the oligarchy.\"}, {'id': 11, 'start': 32.560001373291016, 'end': 33.560001373291016, 'text': ' No.'}, {'id': 12, 'start': 33.560001373291016, 'end': 37.880001068115234, 'text': ' You run a campaign and you do three or four or five rallies in a week.'}, {'id': 13, 'start': 37.880001068115234, 'end': 41.52000045776367, 'text': \" The only way you can get around to talk to 30,000 people, think I'm going to be sitting\"}, {'id': 14, 'start': 41.52000045776367, 'end': 45.84000015258789, 'text': ' on a waiting line at United waiting while 30,000 people are waiting.'}, {'id': 15, 'start': 45.84000015258789, 'end': 47.08000183105469, 'text': \" That's the only way you can get around.\"}, {'id': 16, 'start': 47.08000183105469, 'end': 48.36000061035156, 'text': ' No apologies for that.'}, {'id': 17, 'start': 48.36000061035156, 'end': 50.20000076293945, 'text': \" That's what campaign travel is about.\"}, {'id': 18, 'start': 50.20000076293945, 'end': 51.20000076293945, 'text': \" We've done it in the past.\"}, {'id': 19, 'start': 51.20000076293945, 'end': 80.16000366210938, 'text': \" We're going to do it in the future.\"}, {'id': 20, 'start': 231.1999969482422, 'end': 239.0, 'text': \" It's time to check in again on the lunatic asylum masquerading as a news network known\"}, {'id': 21, 'start': 239.0, 'end': 240.67999267578125, 'text': ' as MSNBC.'}, {'id': 22, 'start': 240.67999267578125, 'end': 246.1199951171875, 'text': \" But let's listen to this hot take from Joe Scarborough, AOC may be more progressive than\"}, {'id': 23, 'start': 246.1199951171875, 'end': 247.1199951171875, 'text': ' a lot of people.'}, {'id': 24, 'start': 247.1199951171875, 'end': 254.39999389648438, 'text': \" I also understand that she's one of the most articulate, exciting people in the democratic\"}, {'id': 25, 'start': 254.39999389648438, 'end': 255.39999389648438, 'text': ' field.'}, {'id': 26, 'start': 255.39999389648438, 'end': 260.55999755859375, 'text': ' She goes out with Bernie Sanders and and yeah, she just draws so many people very good, very'}, {'id': 27, 'start': 260.55999755859375, 'end': 261.79998779296875, 'text': ' effective in hearings.'}, {'id': 28, 'start': 261.79998779296875, 'end': 263.9599914550781, 'text': ' They need somebody young like AOC.'}, {'id': 29, 'start': 263.9599914550781, 'end': 266.7200012207031, 'text': \" And again, it's not about ideology.\"}, {'id': 30, 'start': 266.7200012207031, 'end': 271.7200012207031, 'text': ' You know, they she can carry the message forward for a democratic party that really'}, {'id': 31, 'start': 271.7200012207031, 'end': 274.8399963378906, 'text': ' needs to reach out to younger Americans.'}, {'id': 32, 'start': 274.8399963378906, 'end': 275.8399963378906, 'text': ' Yes.'}, {'id': 33, 'start': 275.8399963378906, 'end': 282.20001220703125, 'text': \" Let's have a look at just how articulate and impressive AOC is prepared to be dazzled by\"}, {'id': 34, 'start': 282.20001220703125, 'end': 284.239990234375, 'text': ' her rare genius.'}, {'id': 35, 'start': 284.239990234375, 'end': 295.760009765625, 'text': ' Even as a waitress, if any of you all else have gotten gone like completely mad, like,'}, {'id': 36, 'start': 296.1600036621094, 'end': 302.6000061035156, 'text': \" whatever, you know, and like or whatever, like, just like it's like, like, like this,\"}, {'id': 37, 'start': 302.6000061035156, 'end': 312.8399963378906, 'text': ' like, like, like what people are starting to see, at least in the occupation of Palestine.'}, {'id': 38, 'start': 312.8399963378906, 'end': 316.0, 'text': ' You use the term the occupation of Palestine.'}, {'id': 39, 'start': 316.0, 'end': 318.1199951171875, 'text': ' What did you mean by that?'}, {'id': 40, 'start': 318.1199951171875, 'end': 325.7200012207031, 'text': ' Oh, I think what I meant is like the the settlements that are increasing in some of'}, {'id': 41, 'start': 325.7200012207031, 'end': 335.3999938964844, 'text': \" these areas and in places where we're Palestinians are experiencing difficulty in access to their\"}, {'id': 42, 'start': 335.3999938964844, 'end': 337.1600036621094, 'text': ' housing and homes.'}, {'id': 43, 'start': 337.1600036621094, 'end': 338.44000244140625, 'text': ' Do you think you can expand on that?'}, {'id': 44, 'start': 338.44000244140625, 'end': 339.44000244140625, 'text': ' Yeah.'}, {'id': 45, 'start': 339.44000244140625, 'end': 344.3999938964844, 'text': \" I mean, I think I'd also just I I am not the expert geopolitics on this issue, you know.\"}]}"