"{'text': \"A Fox News exclusive satellite images revealing the location of a previously unknown Iranian nuclear site. Now, the facility spans nearly 2,500 acres, and this is a big discovery. Jillian Turner has more from the State Department. Good morning, Jillian. Pretty explosive, Dana. These satellite images that we have obtained exclusively show the alleged site location and even the layout of the secret previously unknown nuclear weapons facilities inside Iran. This, of course, raises fresh concerns about the regime's role in these ongoing nuclear talks with the Trump administration. The National Council of Resistance of Iran has collected intelligence from sources on the ground inside Iran that locate this nuclear weapons facility in what is called Semnan Province, far from the regime's already known nuclear sites. It's code-named the Rainbow Site by Iran's officials, and it spans nearly 2,500 acres. It's been operating, as far as we can discern, for over a decade, under the cover of a chemical production company that's called Deba Energy Seba. The so-called Rainbow Site is reportedly being used primarily to extract tritium. It is a material that's used to boost nuclear weapons, with no real civil or commercial applications. Iran paid to Iran's longstanding claim they just want nuclear power for peaceful purposes. Is it the U.S. position that Iran can have an enrichment program as long as it doesn't reach a weapons range? We haven't made that decision yet. We will, but we haven't made that decision yet. Just yesterday, the vice president insisted that the nuclear negotiations with Iran are going swimmingly. Take a listen. So without prejudging the negotiations, I will say so far so good. We've been very happy by how the Iranians have responded to some of the points that we've made. Dana, once again, so this intelligence, these aerial satellite photos, plus some video that a little too long to share with you guys on the air, were shared exclusively with Fox News. It was obtained by sources operating on the ground inside Iran, given to us by Iran's opposition movement here inside the United States. Pretty explosive. Yes. All right. Let's take a look at that and we will track it.\", 'segments': [{'id': 0, 'start': 0.0, 'end': 6.340000152587891, 'text': ' A Fox News exclusive satellite images revealing the location of a previously unknown Iranian'}, {'id': 1, 'start': 6.340000152587891, 'end': 7.340000152587891, 'text': ' nuclear site.'}, {'id': 2, 'start': 7.340000152587891, 'end': 12.119999885559082, 'text': ' Now, the facility spans nearly 2,500 acres, and this is a big discovery.'}, {'id': 3, 'start': 12.119999885559082, 'end': 14.119999885559082, 'text': ' Jillian Turner has more from the State Department.'}, {'id': 4, 'start': 14.119999885559082, 'end': 15.960000038146973, 'text': ' Good morning, Jillian.'}, {'id': 5, 'start': 15.960000038146973, 'end': 17.040000915527344, 'text': ' Pretty explosive, Dana.'}, {'id': 6, 'start': 17.040000915527344, 'end': 22.31999969482422, 'text': ' These satellite images that we have obtained exclusively show the alleged site location'}, {'id': 7, 'start': 22.31999969482422, 'end': 27.399999618530273, 'text': ' and even the layout of the secret previously unknown nuclear weapons facilities inside'}, {'id': 8, 'start': 27.399999618530273, 'end': 28.399999618530273, 'text': ' Iran.'}, {'id': 9, 'start': 28.399999618530273, 'end': 34.08000183105469, 'text': \" This, of course, raises fresh concerns about the regime's role in these ongoing nuclear\"}, {'id': 10, 'start': 34.08000183105469, 'end': 36.63999938964844, 'text': ' talks with the Trump administration.'}, {'id': 11, 'start': 36.63999938964844, 'end': 41.119998931884766, 'text': ' The National Council of Resistance of Iran has collected intelligence from sources on'}, {'id': 12, 'start': 41.119998931884766, 'end': 47.15999984741211, 'text': ' the ground inside Iran that locate this nuclear weapons facility in what is called Semnan'}, {'id': 13, 'start': 47.15999984741211, 'end': 51.52000045776367, 'text': \" Province, far from the regime's already known nuclear sites.\"}, {'id': 14, 'start': 51.52000045776367, 'end': 58.36000061035156, 'text': \" It's code-named the Rainbow Site by Iran's officials, and it spans nearly 2,500 acres.\"}, {'id': 15, 'start': 58.36000061035156, 'end': 63.099998474121094, 'text': \" It's been operating, as far as we can discern, for over a decade, under the cover of a chemical\"}, {'id': 16, 'start': 63.099998474121094, 'end': 67.36000061035156, 'text': \" production company that's called Deba Energy Seba.\"}, {'id': 17, 'start': 67.36000061035156, 'end': 72.08000183105469, 'text': ' The so-called Rainbow Site is reportedly being used primarily to extract tritium.'}, {'id': 18, 'start': 72.08000183105469, 'end': 77.31999969482422, 'text': \" It is a material that's used to boost nuclear weapons, with no real civil or commercial\"}, {'id': 19, 'start': 77.31999969482422, 'end': 78.31999969482422, 'text': ' applications.'}, {'id': 20, 'start': 78.31999969482422, 'end': 84.16000366210938, 'text': \" Iran paid to Iran's longstanding claim they just want nuclear power for peaceful purposes.\"}, {'id': 21, 'start': 84.16000366210938, 'end': 89.36000061035156, 'text': \" Is it the U.S. position that Iran can have an enrichment program as long as it doesn't\"}, {'id': 22, 'start': 89.36000061035156, 'end': 90.36000061035156, 'text': ' reach a weapons range?'}, {'id': 23, 'start': 90.36000061035156, 'end': 92.16000366210938, 'text': \" We haven't made that decision yet.\"}, {'id': 24, 'start': 92.16000366210938, 'end': 95.83999633789062, 'text': \" We will, but we haven't made that decision yet.\"}, {'id': 25, 'start': 95.83999633789062, 'end': 100.31999969482422, 'text': ' Just yesterday, the vice president insisted that the nuclear negotiations with Iran are'}, {'id': 26, 'start': 100.31999969482422, 'end': 101.63999938964844, 'text': ' going swimmingly.'}, {'id': 27, 'start': 101.63999938964844, 'end': 102.63999938964844, 'text': ' Take a listen.'}, {'id': 28, 'start': 102.63999938964844, 'end': 108.04000091552734, 'text': ' So without prejudging the negotiations, I will say so far so good.'}, {'id': 29, 'start': 108.04000091552734, 'end': 113.12000274658203, 'text': \" We've been very happy by how the Iranians have responded to some of the points that\"}, {'id': 30, 'start': 113.12000274658203, 'end': 114.12000274658203, 'text': \" we've made.\"}, {'id': 31, 'start': 114.12000274658203, 'end': 121.23999786376953, 'text': ' Dana, once again, so this intelligence, these aerial satellite photos, plus some video that'}, {'id': 32, 'start': 121.23999786376953, 'end': 125.44000244140625, 'text': ' a little too long to share with you guys on the air, were shared exclusively with Fox'}, {'id': 33, 'start': 125.44000244140625, 'end': 126.44000244140625, 'text': ' News.'}, {'id': 34, 'start': 126.44000244140625, 'end': 131.32000732421875, 'text': \" It was obtained by sources operating on the ground inside Iran, given to us by Iran's\"}, {'id': 35, 'start': 131.32000732421875, 'end': 133.9199981689453, 'text': ' opposition movement here inside the United States.'}, {'id': 36, 'start': 133.9199981689453, 'end': 134.9199981689453, 'text': ' Pretty explosive.'}, {'id': 37, 'start': 134.9199981689453, 'end': 135.9199981689453, 'text': ' Yes.'}, {'id': 38, 'start': 135.9199981689453, 'end': 136.9199981689453, 'text': ' All right.'}, {'id': 39, 'start': 136.9199981689453, 'end': 150.83999633789062, 'text': \" Let's take a look at that and we will track it.\"}]}"