"{'text': \"After Donald Trump announced a cessation of back and forth hostilities with the Houthis, he says he has a big announcement coming as he prepares to depart for the Middle East. What is it? Joining us to share his thoughts is Alex Treiman, CEO and Jerusalem bureau chief with Jewish News Syndicate. Alex, always good to talk with you. So Trump says he'll make a very, very big earth-shattering announcement, as big as it gets just before leaving for Saudi Arabia, Qatar and the UAE next week. So if you look at the timing, could it possibly be an expansion of the Abrahamic Accords? What do you think? Gary, nice to be with you. Certainly people speculating that it could be some kind of normalization agreement between Saudi Arabia and Israel. Many had assumed that you would not get to such an agreement during the war, especially as Israel is now preparing to have a new offensive inside the Gaza Strip, and the Iranian nuclear threat is yet to be diffused. There are also people that are suggesting that it may be an announcement regarding Iran. There was reports on Persian media, which we're still trying to confirm, that the new president, Pazashkian, may even be meeting with Donald Trump in Saudi Arabia during the trip. So we're still trying to look to confirm those reports, and we don't know what's ultimately going to happen. But it could be that President Trump is going to announce that there's been some kind of breakthrough in the talks with Iran. So a lot of possibilities, and the president really keeps people guessing with regard to major announcements. Well, I want to talk about Iran in a moment, but back to this whole idea of the Abrahamic Accords expansion there. What would that mean for the Middle East and Israel? Well, Saudi Arabia has really been considered the prize from the beginning with regard to any kind of normalization agreements with Israel, Saudi Arabia being the cradle of Sunni Islam. But I think for Israel, for the Saudis, this could be a major economic boost for the region. The president would like to see the creation of some kind of alternative pipeline coming from the Arab world and a new trade route, basically going from India through the Gulf States onto Israel, which could then transport goods to Europe and to the Western world. So there's a lot of possibilities if a normalization agreement could be reached. Yeah, and it would further isolate Iran. And onto Iran, U.S. nuclear negotiator, presidential envoy Steve Witkoff, has received some criticism here in the U.S. as a fine business negotiator, but one who doesn't really understand the Iranian mindset and the Middle East. So do you agree with that? And what's the danger of miscalculating, not understanding Islam and Iran? Well, you have the same negotiator who doesn't really have much experience at all as a diplomat, you know, a businessman who is leading the negotiations with the Qataris and Hamas for the release of hostages in Gaza. The same one who is leading negotiations with Iran. The same one who's meeting with Vladimir Putin regarding negotiations to end the war between Russia and Ukraine. And you had Witkoff also apparently negotiating with the Houthis. So each one of these theaters that Witkoff is negotiating on has a unique culture. The Russians are nothing like the Iranians, which are nothing like the Houthis, which are nothing like the Qataris and Hamas. And unless you really understand the culture of the place in which you're entering into negotiations, you could be played. Well, let's pray he understands the Islamic concept of Tahrir. What about Gaza? Trump says there are only 21 hostages still alive. Is that accurate? It may prove a bit difficult, I think, to negotiate their release with Operation Gideon's chariots in full force, the expanded IDF military effort there. What do you think? Well, the estimates are that there's anywhere from 21 to 24 living hostages out of 59 missing Israelis remaining in the Gaza Strip. And it's been the Israeli position that the only way that you get Hamas to make a reconciliation and to offer to release hostages is when they feel like they are under threat. Unless they have the motivation to release hostages, they're not going to release hostages because those are the only cards that they have. And some members of the U.S. Congress are concerned that Israel is not allowing humanitarian aid to get through to the Palestinians in Gaza. So what do you see happening there? I've heard that trusted groups may be allowed in. And how dangerous would that be for those humanitarian relief workers? Well, I mean, it's just an unbelievable double standard that you have Hamas declaring war on the state of Israel on October 7th with over 6,000 people crossing the border, murdering 1,200 people, kidnapping 250 others, injuring thousands. And then Israel going into the Gaza Strip in order to remove the terrorists from power and to try to find their hostages. And the international community is putting a demand on Israel to be the one facilitating the delivery of humanitarian aid into an enemy population. I mean, you just have never seen anything like that. Hamas is still a potent military force, much smaller than they were at the beginning. So whoever is going to be delivering humanitarian aid, it's a very dangerous endeavor in one of the world's most backwards and damaged and dangerous theaters. Yes, not an easy task. Okay, Alex Tremon, JNS Jerusalem Bureau Chief. Always good to talk with you, Alex, and get your insights. Thank you. God bless you. \", 'segments': [{'id': 0, 'start': 0.0, 'end': 7.639999866485596, 'text': ' After Donald Trump announced a cessation of back and forth hostilities with the Houthis,'}, {'id': 1, 'start': 7.639999866485596, 'end': 12.460000038146973, 'text': ' he says he has a big announcement coming as he prepares to depart for the Middle East.'}, {'id': 2, 'start': 12.460000038146973, 'end': 13.460000038146973, 'text': ' What is it?'}, {'id': 3, 'start': 13.460000038146973, 'end': 18.860000610351562, 'text': ' Joining us to share his thoughts is Alex Treiman, CEO and Jerusalem bureau chief with Jewish'}, {'id': 4, 'start': 18.860000610351562, 'end': 19.860000610351562, 'text': ' News Syndicate.'}, {'id': 5, 'start': 19.860000610351562, 'end': 22.059999465942383, 'text': ' Alex, always good to talk with you.'}, {'id': 6, 'start': 22.059999465942383, 'end': 26.5, 'text': \" So Trump says he'll make a very, very big earth-shattering announcement, as big as it\"}, {'id': 7, 'start': 26.5, 'end': 31.5, 'text': ' gets just before leaving for Saudi Arabia, Qatar and the UAE next week.'}, {'id': 8, 'start': 31.5, 'end': 37.18000030517578, 'text': ' So if you look at the timing, could it possibly be an expansion of the Abrahamic Accords?'}, {'id': 9, 'start': 37.18000030517578, 'end': 38.18000030517578, 'text': ' What do you think?'}, {'id': 10, 'start': 38.18000030517578, 'end': 41.060001373291016, 'text': ' Gary, nice to be with you.'}, {'id': 11, 'start': 41.060001373291016, 'end': 44.97999954223633, 'text': ' Certainly people speculating that it could be some kind of normalization agreement between'}, {'id': 12, 'start': 44.97999954223633, 'end': 48.84000015258789, 'text': ' Saudi Arabia and Israel.'}, {'id': 13, 'start': 48.84000015258789, 'end': 54.34000015258789, 'text': ' Many had assumed that you would not get to such an agreement during the war, especially'}, {'id': 14, 'start': 54.58000183105469, 'end': 60.65999984741211, 'text': ' as Israel is now preparing to have a new offensive inside the Gaza Strip, and the Iranian nuclear'}, {'id': 15, 'start': 60.65999984741211, 'end': 64.26000213623047, 'text': ' threat is yet to be diffused.'}, {'id': 16, 'start': 64.26000213623047, 'end': 70.5, 'text': ' There are also people that are suggesting that it may be an announcement regarding Iran.'}, {'id': 17, 'start': 70.5, 'end': 75.9800033569336, 'text': \" There was reports on Persian media, which we're still trying to confirm, that the new\"}, {'id': 18, 'start': 75.9800033569336, 'end': 82.30000305175781, 'text': ' president, Pazashkian, may even be meeting with Donald Trump in Saudi Arabia during the'}, {'id': 19, 'start': 82.30000305175781, 'end': 83.30000305175781, 'text': ' trip.'}, {'id': 20, 'start': 83.30000305175781, 'end': 87.26000213623047, 'text': \" So we're still trying to look to confirm those reports, and we don't know what's ultimately\"}, {'id': 21, 'start': 87.26000213623047, 'end': 88.26000213623047, 'text': ' going to happen.'}, {'id': 22, 'start': 88.26000213623047, 'end': 92.05999755859375, 'text': \" But it could be that President Trump is going to announce that there's been some kind of\"}, {'id': 23, 'start': 92.05999755859375, 'end': 94.54000091552734, 'text': ' breakthrough in the talks with Iran.'}, {'id': 24, 'start': 94.54000091552734, 'end': 100.73999786376953, 'text': ' So a lot of possibilities, and the president really keeps people guessing with regard to'}, {'id': 25, 'start': 100.73999786376953, 'end': 101.9000015258789, 'text': ' major announcements.'}, {'id': 26, 'start': 101.9000015258789, 'end': 106.77999877929688, 'text': ' Well, I want to talk about Iran in a moment, but back to this whole idea of the Abrahamic'}, {'id': 27, 'start': 106.77999877929688, 'end': 110.30000305175781, 'text': ' Accords expansion there.'}, {'id': 28, 'start': 110.30000305175781, 'end': 113.18000030517578, 'text': ' What would that mean for the Middle East and Israel?'}, {'id': 29, 'start': 113.18000030517578, 'end': 117.5, 'text': ' Well, Saudi Arabia has really been considered the prize from the beginning with regard to'}, {'id': 30, 'start': 117.5, 'end': 123.41999816894531, 'text': ' any kind of normalization agreements with Israel, Saudi Arabia being the cradle of Sunni'}, {'id': 31, 'start': 123.41999816894531, 'end': 124.5, 'text': ' Islam.'}, {'id': 32, 'start': 124.5, 'end': 131.05999755859375, 'text': ' But I think for Israel, for the Saudis, this could be a major economic boost for the region.'}, {'id': 33, 'start': 131.05999755859375, 'end': 136.4600067138672, 'text': ' The president would like to see the creation of some kind of alternative pipeline coming'}, {'id': 34, 'start': 136.6199951171875, 'end': 144.4600067138672, 'text': ' from the Arab world and a new trade route, basically going from India through the Gulf'}, {'id': 35, 'start': 144.4600067138672, 'end': 151.05999755859375, 'text': ' States onto Israel, which could then transport goods to Europe and to the Western world.'}, {'id': 36, 'start': 151.05999755859375, 'end': 154.82000732421875, 'text': \" So there's a lot of possibilities if a normalization agreement could be reached.\"}, {'id': 37, 'start': 154.82000732421875, 'end': 157.3800048828125, 'text': ' Yeah, and it would further isolate Iran.'}, {'id': 38, 'start': 157.3800048828125, 'end': 164.47999572753906, 'text': ' And onto Iran, U.S. nuclear negotiator, presidential envoy Steve Witkoff, has received some criticism'}, {'id': 39, 'start': 164.47999572753906, 'end': 169.0, 'text': \" here in the U.S. as a fine business negotiator, but one who doesn't really understand the\"}, {'id': 40, 'start': 169.0, 'end': 171.60000610351562, 'text': ' Iranian mindset and the Middle East.'}, {'id': 41, 'start': 171.60000610351562, 'end': 173.32000732421875, 'text': ' So do you agree with that?'}, {'id': 42, 'start': 173.32000732421875, 'end': 178.0800018310547, 'text': \" And what's the danger of miscalculating, not understanding Islam and Iran?\"}, {'id': 43, 'start': 178.0800018310547, 'end': 184.75999450683594, 'text': \" Well, you have the same negotiator who doesn't really have much experience at all as a diplomat,\"}, {'id': 44, 'start': 184.75999450683594, 'end': 190.60000610351562, 'text': ' you know, a businessman who is leading the negotiations with the Qataris and Hamas for'}, {'id': 45, 'start': 190.60000610351562, 'end': 192.32000732421875, 'text': ' the release of hostages in Gaza.'}, {'id': 46, 'start': 192.32000732421875, 'end': 195.8800048828125, 'text': ' The same one who is leading negotiations with Iran.'}, {'id': 47, 'start': 195.8800048828125, 'end': 200.55999755859375, 'text': \" The same one who's meeting with Vladimir Putin regarding negotiations to end the war between\"}, {'id': 48, 'start': 200.55999755859375, 'end': 201.55999755859375, 'text': ' Russia and Ukraine.'}, {'id': 49, 'start': 201.55999755859375, 'end': 206.55999755859375, 'text': ' And you had Witkoff also apparently negotiating with the Houthis.'}, {'id': 50, 'start': 206.55999755859375, 'end': 215.63999938964844, 'text': ' So each one of these theaters that Witkoff is negotiating on has a unique culture.'}, {'id': 51, 'start': 215.63999938964844, 'end': 219.1999969482422, 'text': ' The Russians are nothing like the Iranians, which are nothing like the Houthis, which'}, {'id': 52, 'start': 219.1999969482422, 'end': 221.67999267578125, 'text': ' are nothing like the Qataris and Hamas.'}, {'id': 53, 'start': 222.0399932861328, 'end': 226.27999877929688, 'text': \" And unless you really understand the culture of the place in which you're entering into\"}, {'id': 54, 'start': 226.27999877929688, 'end': 228.72000122070312, 'text': ' negotiations, you could be played.'}, {'id': 55, 'start': 228.72000122070312, 'end': 234.16000366210938, 'text': \" Well, let's pray he understands the Islamic concept of Tahrir.\"}, {'id': 56, 'start': 234.16000366210938, 'end': 235.1999969482422, 'text': ' What about Gaza?'}, {'id': 57, 'start': 235.1999969482422, 'end': 238.0399932861328, 'text': ' Trump says there are only 21 hostages still alive.'}, {'id': 58, 'start': 238.0399932861328, 'end': 239.0800018310547, 'text': ' Is that accurate?'}, {'id': 59, 'start': 239.0800018310547, 'end': 243.83999633789062, 'text': \" It may prove a bit difficult, I think, to negotiate their release with Operation Gideon's\"}, {'id': 60, 'start': 243.83999633789062, 'end': 247.83999633789062, 'text': ' chariots in full force, the expanded IDF military effort there.'}, {'id': 61, 'start': 247.83999633789062, 'end': 248.83999633789062, 'text': ' What do you think?'}, {'id': 62, 'start': 249.0, 'end': 256.55999755859375, 'text': \" Well, the estimates are that there's anywhere from 21 to 24 living hostages out of 59 missing\"}, {'id': 63, 'start': 256.55999755859375, 'end': 258.9599914550781, 'text': ' Israelis remaining in the Gaza Strip.'}, {'id': 64, 'start': 258.9599914550781, 'end': 266.3599853515625, 'text': \" And it's been the Israeli position that the only way that you get Hamas to make a reconciliation\"}, {'id': 65, 'start': 266.3599853515625, 'end': 271.3599853515625, 'text': ' and to offer to release hostages is when they feel like they are under threat.'}, {'id': 66, 'start': 271.3599853515625, 'end': 276.6000061035156, 'text': \" Unless they have the motivation to release hostages, they're not going to release hostages\"}, {'id': 67, 'start': 276.8800048828125, 'end': 279.0400085449219, 'text': ' because those are the only cards that they have.'}, {'id': 68, 'start': 279.0400085449219, 'end': 283.32000732421875, 'text': ' And some members of the U.S. Congress are concerned that Israel is not allowing humanitarian'}, {'id': 69, 'start': 283.32000732421875, 'end': 286.4800109863281, 'text': ' aid to get through to the Palestinians in Gaza.'}, {'id': 70, 'start': 286.4800109863281, 'end': 288.8399963378906, 'text': ' So what do you see happening there?'}, {'id': 71, 'start': 288.8399963378906, 'end': 291.20001220703125, 'text': \" I've heard that trusted groups may be allowed in.\"}, {'id': 72, 'start': 291.20001220703125, 'end': 295.0, 'text': ' And how dangerous would that be for those humanitarian relief workers?'}, {'id': 73, 'start': 295.0, 'end': 300.67999267578125, 'text': \" Well, I mean, it's just an unbelievable double standard that you have Hamas declaring war\"}, {'id': 74, 'start': 300.67999267578125, 'end': 305.9599914550781, 'text': ' on the state of Israel on October 7th with over 6,000 people crossing the border, murdering'}, {'id': 75, 'start': 305.9599914550781, 'end': 311.1600036621094, 'text': ' 1,200 people, kidnapping 250 others, injuring thousands.'}, {'id': 76, 'start': 311.1600036621094, 'end': 315.5199890136719, 'text': ' And then Israel going into the Gaza Strip in order to remove the terrorists from power'}, {'id': 77, 'start': 315.5199890136719, 'end': 317.55999755859375, 'text': ' and to try to find their hostages.'}, {'id': 78, 'start': 317.55999755859375, 'end': 322.0, 'text': ' And the international community is putting a demand on Israel to be the one facilitating'}, {'id': 79, 'start': 322.0, 'end': 325.55999755859375, 'text': ' the delivery of humanitarian aid into an enemy population.'}, {'id': 80, 'start': 325.55999755859375, 'end': 328.6000061035156, 'text': ' I mean, you just have never seen anything like that.'}, {'id': 81, 'start': 328.6000061035156, 'end': 334.760009765625, 'text': ' Hamas is still a potent military force, much smaller than they were at the beginning.'}, {'id': 82, 'start': 334.760009765625, 'end': 340.7200012207031, 'text': \" So whoever is going to be delivering humanitarian aid, it's a very dangerous endeavor in one\"}, {'id': 83, 'start': 340.7200012207031, 'end': 346.32000732421875, 'text': \" of the world's most backwards and damaged and dangerous theaters.\"}, {'id': 84, 'start': 346.32000732421875, 'end': 348.1600036621094, 'text': ' Yes, not an easy task.'}, {'id': 85, 'start': 348.1600036621094, 'end': 351.3599853515625, 'text': ' Okay, Alex Tremon, JNS Jerusalem Bureau Chief.'}, {'id': 86, 'start': 351.3599853515625, 'end': 354.0, 'text': ' Always good to talk with you, Alex, and get your insights.'}, {'id': 87, 'start': 354.0, 'end': 355.0, 'text': ' Thank you.'}, {'id': 88, 'start': 355.0, 'end': 356.0, 'text': ' God bless you.'}, {'id': 89, 'start': 356.0, 'end': 356.0, 'text': ''}]}"