"{'text': \"Welcome to ILTV's Security Brief, I'm Khaled Ben-David. Each week we'll focus on the latest developments relating to security and defense here in Israel and the Middle East. And we start with our roundup of the top stories over the past week. Israel has struck back at the Houthis, with some 20 Israeli Air Force fighter jets bombing targets in the Yemen port of Hodeidah that were used for the transfer of Iranian weapons and military equipment, as well as a concrete factory in the town of Bajil. This after a ballistic missile launched from Yemen hit an open area inside Ben Gurion Airport, lightly injuring six people and causing some two dozen airlines to cancel their flights to Israel. This marked the first time the Houthis have succeeded in targeting the airport, as both Israel's Arrow and the U.S.'s THAAD air defense systems failed to intercept the missile. A preliminary investigation is blaming technical malfunctions for that failure. The Israeli cabinet has approved plans to expand IDF operations in Gaza that include asserting military control over the entire territory, while moving residents towards the southern half of the Strip. The cabinet also approved a new plan to resume distributing humanitarian aid via U.S. contractors, bypassing U.N. agencies that Israel sees as compromised by collaboration with Hamas. The new operation is expected to get underway only after President Trump's planned visit to the region next week, and the call-up of tens of thousands of more reserve soldiers. Chief of Staff Eyal Zamir says the buildup is necessary to pressure Hamas to release more hostages, although the strategy is being criticized by some hostage families who are pressing for an immediate deal. Prime Minister Benjamin Netanyahu said the operation, dubbed Gideon's Chariots, represents a new strategy in Gaza. Meanwhile, fierce fighting continues throughout Gaza as IDF forces clash with Hamas fighters. In Rafah, the 205th Armored Brigade, known as the Iron Fist, is conducting an operation to destroy terror infrastructures both above and below ground, during which they uncovered a large weapons cache, stored nearby buildings used as a school and hospital. Elsewhere in Rafah, two soldiers, Captain Noam Ravid and Staff Sergeant Yali Siror, were killed Saturday by an explosive device in a booby-trapped terror tunnel. Another soldier, Sergeant Major Dejan Daniel Sahalo, died in a car accident during military activity just outside Gaza, raising the fatalities among troops there since the Gaza operation began to 417. During military operations in Judea and Samaria, the IDF arrested two suspects in Nablus and Tubas on charges of inciting on social media with calls to murder Jews and to continue the arson attacks suspected of spreading fires across central Israel on Independence Day. During the fires, the Israeli Air Force deployed its own fire trucks and fighters to battle those blazes, along with Yassour helicopters and Samson firefighting aircraft, while IDF ground troops insisted in evacuating civilians from the danger zone. And in our big story this week, we focus on Iran. The U.S. and Iran have now concluded three rounds of talks on a new nuclear agreement, with a fourth round expected to take place soon in Rome. But reports that the Trump administration is now willing to allow the Iranians to retain their civilian nuclear program, along with limiting uranium enrichment, has Israeli officials concerned that the emerging deal will be too similar to the 2015 agreement Prime Minister Netanyahu opposed as insufficient to stop Tehran regime's ambitions for nuclear weapons. There are those who say now that Israel may have to go it alone in stopping Iran's nuclear drive, but could it do so without America's blessing or cooperation? Does Israel even have that capability? And could it live with a deal that does halt Iran's nuclear program, but not its ballistic missile development or its support for such proxy terror forces as the Houthis, especially after this week's dramatic strike on Ben Gurion Airport by the Iranian-backed Yemeni rebels? Joining me to discuss these questions is retired Israeli Air Force Brigadier General Israel Relik Shafir, who was one of the pilots who took part in the bombing of Iraq's Osirak nuclear reactor in 1981. Relik, thank you for joining us on Security Brief. Let's start with the obvious big question. Even if Israel wanted to go it alone in trying to take out Iran's nuclear program, does it have the military capability to do so? Well, to a very limited extent. Just for an example, a B-2 bomber can carry the bunker buster, which weighs 25,000 pounds. That's this U.S.-manufactured bomb. The heaviest weapon that an Israeli F-15 can take is about 3,000 pounds. That's a big gap. It's a big gap, and it means that the ability to bomb and get into a very deep concrete and stone encampment is limited. So I would say that we can take out some of their program, roll them back a little, but we cannot stop the program altogether. I see. What about, besides bombing, other potential alternatives? For example, covert operations. Just note that just in the past couple of weeks, we've seen some very mysterious explosions in Iran. There was a Shaheed-Rajipur explosion, there was a factory in Mashhad, a power plant. How effective could covert operations, together with or by themselves, be in stopping or delaying the Iran nuclear program? Oh, it can delay, but it won't stop. The program, the Iranian program, has been on from 1988, when Khomeini told his generals at the end of the war with the Iraqis, we need a weapon of leverage. That's when the program started, not seeing Israel as a target, but a fleet. It has turned towards Israel, and that, in order to release the pressure off Saudi Arabia and Egypt, who have been at odds for four or five centuries at least. Right. Now, there have been some reports, Relic, that even as early as this month, Prime Minister Netanyahu was hoping for, or working towards, some kind of military operation or security operation against Iran nuclear reactors, and President Trump ordered a halt to that. He wants to see if diplomacy can work. Obviously, it's a political, a diplomatic question about whether Israel could do that, go ahead without US approval, or even against the wishes of the US. But there is a security element as well, because the US and Israel are so, or certainly Israel is so dependent, or they're co-dependent in the region together. So how wise would it be for Israel to move ahead without US approval, or even a scenario in which it perhaps doesn't even inform the US? Well, that is very unlikely to happen because of the repercussions following that. And remember that Israel is probably the only ally that we have at this time in the Western world. The US has other things in its basket, such as the Ukrainian war, and let's not forget China and Taiwan. Maybe the Chinese will see an attack by the US on Iran as a go-ahead for them to attack Taiwan. So all these actually have to be taken into account when we think of a more global look at what is happening between ourselves and Iran. Right. Now, if the US should reach a deal with Iran that may fall short, for example, of dismantling its civilian nuclear program, at some point the security establishment presumably will be asked by the government if Israel can live with such a deal. What threat does that pose to the security of Israel? How would they likely answer that? The 2015 agreement was supported by a lot of people in Israel who said it's much better to have a limited control as it was in the 2015. But also opposed by some security analysts. Very few. And Netanyahu insisted on going on and pushing for the annulment of that agreement, and as a result what we're seeing now is that Iran is ever closer to a nuclear weapon. So getting them down to an enrichment of about three and a half percent, four percent for civilian use, it's very difficult to explain in the whole world why this can't be done, being able to control all of the sites, including the military sites, by US inspectors. Well, of course, that's part of the key elements of the deal, inspection of those plants, whether that be sufficient. But another criticism of the 2015 deal is it did nothing to address, for example, the ballistic missile program of Iran. And we've seen, unfortunately in Israel, a direct result of that ballistic missile program just this past week with the Houthi successful attack on Ben Gurion Airport. Could Israel live with no limitations at all, or what kind of security threat would it be if there would be a deal with no limitations, for example, on Iran's ballistic missile program or its support for delivering those ballistic missiles to terror groups like the Houthis? It's a good question that has to do with world politics. What about North Korea's ballistic missiles? I understand that, but I'm talking specifically about the security threat those missiles pose to Israel. Yes, but they could take North Korean missiles and use them, and it would be very difficult to push this through the Europeans, who will most likely not support this part of the deal, unfortunately. Right. Well, let's talk a little about that Houthi attack on Ben Gurion Airport. As someone who certainly knows about air defense systems, how is it possible that that one missile managed to evade both the Israel's Ahrar program, which has shown great success in other circumstances, including attacks directly from Iran, and the U.S. THAAD missile system, which many people thought was the really most advanced air defense system that has been created? Well, you could argue which one is the most advanced. Well, neither performed to distinction this past week. That basically, we're talking about a 95% probability of direct hit. We're talking about a closure speed of about two miles per second. And a small miss, or a small change in direction of the target, can cause a miss. Maybe we need three missiles per, to shoot three missiles per Houthi missile to make sure that we're closer to 100. But there is no hermetic answer to these, and we will have to suffer the consequences every now and then if it goes on for a long time. Which does raise the question, though, you talk about adding on, does Israel, is its air defense shield sufficient, given the fact that it's now being attacked in multiple directions? By the Houthis, certainly we've seen direct fire from Iran, always a threat of Hezbollah, and of course, even these militias in Iraq who are allied with Iran. I think we've seen, from April into October of 2024, the ability to stop most of the missiles coming in. Some will come in and create some damage. But just to let you know, one of those missiles, an F-15 fully loaded, has 24 of those missiles stacked up when it goes to bombing. So just to understand the damage that could be caused. Right. I do want to just reference the operation that's been announced in the Gaza Strip, in the context of Israel fighting a multi-front war, and potentially even contemplating a strike on Iran, which would really extend that front. We could see the north really heat up again, direct attacks. Given the scope of the operation planned in Gaza, is the IEDF, does it have the capability to contend with all of these challenges, all potentially at the same time? In Lebanon, in Syria and Iran, and the Houthis, it's all Air Force, and it doesn't take the whole Air Force to take care of those scenarios. In Gaza itself, the Air Force, mainly using RPVs, or UAVs, with the forces to make sure that they're defended as they move along, is the main force. Because the Israeli Air Force does not want to use a one-ton bomb in order to take out small munition depots or terrorists, in order not to create collateral damage. So the Air Force can do all of these missions. It's strong enough and big enough. The ground forces, they will move in probably after Trump leaves, at a certain manner that we don't really know yet how. Understood. And again, just one last point on this. Gaza, Israel's military operation in Gaza, so far as you know, does have the U.S. support, which is crucial, especially when it comes to some of the issues involved, for example, replacing the humanitarian aid system. Does that, in a sense, perhaps limit Israel's options in dealing, perhaps, with Iran, with the Houthis, where the U.S. has told Israel, we're going to handle it, because of the interdependence now of Israel on the U.S. for that kind of military operation, for example, in Gaza? Well, obviously, the political support of the U.S. is of utmost importance. And I don't see Israel acting against Trump's will, else we will see how he deals with his own staff when they misbehave, so to speak. And so Israel doesn't want to go against Trump, because then it will really be alone. And this is something that we probably won't want to do at this time, under any duress. All right. So right now, the game is, the ball is in, it would seem, in Washington's court, and with U.S. President Trump, and these negotiations, and maybe we'll be seeing some answers during his visit, his planned visit to the region next week. Syria is home to over 600,000 Druze, a little over 3% of that nation's total population, and more than half of all the Druze worldwide. Now most live in the country's southwest corner, an area bordering Golan and the Golan Heights in Israel. In recent weeks, more than 100 people have been killed in violence between the Syrian Druze and pro-government Islamist forces. The Syrian Druze have maintained close ties through the years with their fellow Druze in Israel, and in their hour of need, they are calling on Jerusalem for help. And Israel is responding. The Israeli Air Force struck several military targets in and around Damascus over the weekend, in what the government called, quote, a clear message to the Syrian regime to not allow the deployment of forces south of Damascus, or pose any threat to the Druze community. IDF forces also deployed in several Druze villages that sit along Syria's border area with northern Israel, providing aid and security. And some two dozen Druze civilians have been evacuated by the IDF from Syria to the Ziv Hospital in Sfat for medical treatment. Still with us is Israel's Relic Shafir. And Relic, let me ask you, how far can Israel go given, as we've discussed, the stretching of its forces at this time to provide protection for the Syrian Druze? Well, most of the protection would be done by the Air Force, UAVs, or fighter aircraft if needed, to stop any attacking forces from getting close to Sueda, which is the major Druze city. the Syrian regime that should they give their hand to attack the Druze, they will suffer close to Damascus. And we'll see how that will go. Otherwise, a lot of aid and make sure there's an open route to Jordan, which is also acting against the Islamic Brotherhood, has been doing so lately. In Syria. Yes. No, in Jordan itself. In Jordan itself. So it's a concentration of forces to help the Druze, and this is also a sign for the Turks, who are pretty active in the northern part of Syria, not to go further south and actually de-conflict with Israel in that area. Syria has gone back to the pre-1919 Sykes-Picot agreement that actually took all these tribes and drew a line in the sand to make that Syria. Right. It's less a country than now a conglomeration of differing entities. I would say tribes and entities, yes. All right. Well, let's wish the best for the Druze there in Syria, who have been calling on Israel for help. And, of course, Israel owes a debt to the Israeli Druze, who have been so a key part of the Israeli military effort until this very day. Israel Relic, Shafir, thank you for joining us on an ILTV Security Brief. Thank you for having me. And now a final word. Last week, Israel observed its Memorial Day, honoring the over 25,000 men and women who have fallen in defense of Israel and the Jewish national home over the years. Among the many ceremonies held that day was a very special one in Jerusalem, held in memory of some 50 members of Israel's ultra-Orthodox or Haredi community. Some 3,000 attendees took part in a memorial organized by the NGO Netzach Yehuda, named after the battalion created by the IDF to especially enable Haredi soldiers to serve in combat roles without compromising their religious values. The same week, some 400 Haredi men were enlisted in the IDF, but that is just a small percentage of the 10,000 draft notices sent out last year. And some of those who did enlist found themselves harassed by Haredi anti-draft protesters as they made their way to and from recruitment centers. Now the issue of draft exemptions for the Haredi community is a complex one, and there are legitimate disagreements over the best way to integrate the ultra-Orthodox into military or national service, or even to do so. But speaking for myself, as an IDF veteran and the father of IDF veterans, there can be no excuse for the abuse of those Haredi youngsters that are prepared to share the burden of military duty with their Jewish brethren, or the silence of many Haredi political and rabbinical leaders to condemn this outrageous behavior. This is especially so as the IDF is now dealing with a serious manpower shortage as it fights a multi-front war, and many Israelis are contending with the crushing burden of months of reserve duty. Shall your brothers go to war while you just sit here? That's the question Moshe, Moses, asked the tribes of Gad and Reuben, as recorded in Bami Bar, the Bible's book of numbers. It is a question no less relevant in the Israel of today. Thank you for joining us on ITL TV's Security Brief.\", 'segments': [{'id': 0, 'start': 0.0, 'end': 18.200000762939453, 'text': \" Welcome to ILTV's Security Brief, I'm Khaled Ben-David.\"}, {'id': 1, 'start': 18.200000762939453, 'end': 23.559999465942383, 'text': \" Each week we'll focus on the latest developments relating to security and defense here in Israel\"}, {'id': 2, 'start': 23.559999465942383, 'end': 24.920000076293945, 'text': ' and the Middle East.'}, {'id': 3, 'start': 24.920000076293945, 'end': 29.8799991607666, 'text': ' And we start with our roundup of the top stories over the past week.'}, {'id': 4, 'start': 29.8799991607666, 'end': 35.36000061035156, 'text': ' Israel has struck back at the Houthis, with some 20 Israeli Air Force fighter jets bombing'}, {'id': 5, 'start': 35.36000061035156, 'end': 40.439998626708984, 'text': ' targets in the Yemen port of Hodeidah that were used for the transfer of Iranian weapons'}, {'id': 6, 'start': 40.439998626708984, 'end': 46.08000183105469, 'text': ' and military equipment, as well as a concrete factory in the town of Bajil.'}, {'id': 7, 'start': 46.08000183105469, 'end': 52.2400016784668, 'text': ' This after a ballistic missile launched from Yemen hit an open area inside Ben Gurion Airport,'}, {'id': 8, 'start': 52.2400016784668, 'end': 57.619998931884766, 'text': ' lightly injuring six people and causing some two dozen airlines to cancel their flights'}, {'id': 9, 'start': 57.619998931884766, 'end': 58.86000061035156, 'text': ' to Israel.'}, {'id': 10, 'start': 58.86000061035156, 'end': 63.7599983215332, 'text': ' This marked the first time the Houthis have succeeded in targeting the airport, as both'}, {'id': 11, 'start': 63.7599983215332, 'end': 70.83999633789062, 'text': \" Israel's Arrow and the U.S.'s THAAD air defense systems failed to intercept the missile.\"}, {'id': 12, 'start': 70.83999633789062, 'end': 76.91999816894531, 'text': ' A preliminary investigation is blaming technical malfunctions for that failure.'}, {'id': 13, 'start': 76.91999816894531, 'end': 82.63999938964844, 'text': ' The Israeli cabinet has approved plans to expand IDF operations in Gaza that include'}, {'id': 14, 'start': 82.63999938964844, 'end': 87.95999908447266, 'text': ' asserting military control over the entire territory, while moving residents towards'}, {'id': 15, 'start': 88.05999755859375, 'end': 90.13999938964844, 'text': ' the southern half of the Strip.'}, {'id': 16, 'start': 90.13999938964844, 'end': 97.26000213623047, 'text': ' The cabinet also approved a new plan to resume distributing humanitarian aid via U.S. contractors,'}, {'id': 17, 'start': 97.26000213623047, 'end': 104.13999938964844, 'text': ' bypassing U.N. agencies that Israel sees as compromised by collaboration with Hamas.'}, {'id': 18, 'start': 104.13999938964844, 'end': 109.5, 'text': \" The new operation is expected to get underway only after President Trump's planned visit\"}, {'id': 19, 'start': 109.5, 'end': 115.18000030517578, 'text': ' to the region next week, and the call-up of tens of thousands of more reserve soldiers.'}, {'id': 20, 'start': 115.22000122070312, 'end': 120.9000015258789, 'text': ' Chief of Staff Eyal Zamir says the buildup is necessary to pressure Hamas to release'}, {'id': 21, 'start': 120.9000015258789, 'end': 126.66000366210938, 'text': ' more hostages, although the strategy is being criticized by some hostage families who are'}, {'id': 22, 'start': 126.66000366210938, 'end': 129.17999267578125, 'text': ' pressing for an immediate deal.'}, {'id': 23, 'start': 129.17999267578125, 'end': 133.74000549316406, 'text': \" Prime Minister Benjamin Netanyahu said the operation, dubbed Gideon's Chariots, represents\"}, {'id': 24, 'start': 133.74000549316406, 'end': 136.17999267578125, 'text': ' a new strategy in Gaza.'}, {'id': 25, 'start': 145.17999267578125, 'end': 158.10000610351562, 'text': ' Meanwhile, fierce fighting continues throughout Gaza as IDF forces clash with Hamas fighters.'}, {'id': 26, 'start': 158.10000610351562, 'end': 163.33999633789062, 'text': ' In Rafah, the 205th Armored Brigade, known as the Iron Fist, is conducting an operation'}, {'id': 27, 'start': 163.33999633789062, 'end': 169.16000366210938, 'text': ' to destroy terror infrastructures both above and below ground, during which they uncovered'}, {'id': 28, 'start': 169.16000366210938, 'end': 175.55999755859375, 'text': ' a large weapons cache, stored nearby buildings used as a school and hospital.'}, {'id': 29, 'start': 175.55999755859375, 'end': 182.60000610351562, 'text': ' Elsewhere in Rafah, two soldiers, Captain Noam Ravid and Staff Sergeant Yali Siror,'}, {'id': 30, 'start': 182.60000610351562, 'end': 187.60000610351562, 'text': ' were killed Saturday by an explosive device in a booby-trapped terror tunnel.'}, {'id': 31, 'start': 187.60000610351562, 'end': 193.55999755859375, 'text': ' Another soldier, Sergeant Major Dejan Daniel Sahalo, died in a car accident during military'}, {'id': 32, 'start': 193.55999755859375, 'end': 200.1999969482422, 'text': ' activity just outside Gaza, raising the fatalities among troops there since the Gaza operation'}, {'id': 33, 'start': 200.1999969482422, 'end': 204.1199951171875, 'text': ' began to 417.'}, {'id': 34, 'start': 204.1199951171875, 'end': 209.52000427246094, 'text': ' During military operations in Judea and Samaria, the IDF arrested two suspects in Nablus and'}, {'id': 35, 'start': 209.52000427246094, 'end': 216.5800018310547, 'text': ' Tubas on charges of inciting on social media with calls to murder Jews and to continue'}, {'id': 36, 'start': 216.5800018310547, 'end': 223.1999969482422, 'text': ' the arson attacks suspected of spreading fires across central Israel on Independence Day.'}, {'id': 37, 'start': 223.1999969482422, 'end': 229.1199951171875, 'text': ' During the fires, the Israeli Air Force deployed its own fire trucks and fighters to battle'}, {'id': 38, 'start': 229.1199951171875, 'end': 236.36000061035156, 'text': ' those blazes, along with Yassour helicopters and Samson firefighting aircraft, while IDF'}, {'id': 39, 'start': 236.36000061035156, 'end': 241.8800048828125, 'text': ' ground troops insisted in evacuating civilians from the danger zone.'}, {'id': 40, 'start': 241.8800048828125, 'end': 246.02000427246094, 'text': ' And in our big story this week, we focus on Iran.'}, {'id': 41, 'start': 246.02000427246094, 'end': 251.60000610351562, 'text': ' The U.S. and Iran have now concluded three rounds of talks on a new nuclear agreement,'}, {'id': 42, 'start': 251.60000610351562, 'end': 255.60000610351562, 'text': ' with a fourth round expected to take place soon in Rome.'}, {'id': 43, 'start': 255.60000610351562, 'end': 261.5199890136719, 'text': ' But reports that the Trump administration is now willing to allow the Iranians to retain'}, {'id': 44, 'start': 261.5199890136719, 'end': 268.2200012207031, 'text': ' their civilian nuclear program, along with limiting uranium enrichment, has Israeli officials'}, {'id': 45, 'start': 268.2200012207031, 'end': 274.4800109863281, 'text': ' concerned that the emerging deal will be too similar to the 2015 agreement Prime Minister'}, {'id': 46, 'start': 274.4800109863281, 'end': 281.8800048828125, 'text': \" Netanyahu opposed as insufficient to stop Tehran regime's ambitions for nuclear weapons.\"}, {'id': 47, 'start': 281.8800048828125, 'end': 287.0799865722656, 'text': \" There are those who say now that Israel may have to go it alone in stopping Iran's nuclear\"}, {'id': 48, 'start': 287.0799865722656, 'end': 292.6000061035156, 'text': \" drive, but could it do so without America's blessing or cooperation?\"}, {'id': 49, 'start': 292.6000061035156, 'end': 295.32000732421875, 'text': ' Does Israel even have that capability?'}, {'id': 50, 'start': 295.32000732421875, 'end': 300.8399963378906, 'text': \" And could it live with a deal that does halt Iran's nuclear program, but not its ballistic\"}, {'id': 51, 'start': 300.8399963378906, 'end': 307.0, 'text': ' missile development or its support for such proxy terror forces as the Houthis, especially'}, {'id': 52, 'start': 307.0, 'end': 314.8399963378906, 'text': \" after this week's dramatic strike on Ben Gurion Airport by the Iranian-backed Yemeni rebels?\"}, {'id': 53, 'start': 314.8399963378906, 'end': 319.82000732421875, 'text': ' Joining me to discuss these questions is retired Israeli Air Force Brigadier General Israel'}, {'id': 54, 'start': 319.82000732421875, 'end': 326.3599853515625, 'text': \" Relik Shafir, who was one of the pilots who took part in the bombing of Iraq's Osirak\"}, {'id': 55, 'start': 326.3599853515625, 'end': 328.7200012207031, 'text': ' nuclear reactor in 1981.'}, {'id': 56, 'start': 329.239990234375, 'end': 332.55999755859375, 'text': ' Relik, thank you for joining us on Security Brief.'}, {'id': 57, 'start': 332.55999755859375, 'end': 335.55999755859375, 'text': \" Let's start with the obvious big question.\"}, {'id': 58, 'start': 335.55999755859375, 'end': 342.55999755859375, 'text': \" Even if Israel wanted to go it alone in trying to take out Iran's nuclear program, does it\"}, {'id': 59, 'start': 342.55999755859375, 'end': 345.6400146484375, 'text': ' have the military capability to do so?'}, {'id': 60, 'start': 345.6400146484375, 'end': 349.79998779296875, 'text': ' Well, to a very limited extent.'}, {'id': 61, 'start': 349.79998779296875, 'end': 357.1400146484375, 'text': ' Just for an example, a B-2 bomber can carry the bunker buster, which weighs 25,000 pounds.'}, {'id': 62, 'start': 357.1400146484375, 'end': 360.0199890136719, 'text': \" That's this U.S.-manufactured bomb.\"}, {'id': 63, 'start': 360.0199890136719, 'end': 365.29998779296875, 'text': ' The heaviest weapon that an Israeli F-15 can take is about 3,000 pounds.'}, {'id': 64, 'start': 365.29998779296875, 'end': 366.5400085449219, 'text': \" That's a big gap.\"}, {'id': 65, 'start': 366.5400085449219, 'end': 376.94000244140625, 'text': \" It's a big gap, and it means that the ability to bomb and get into a very deep concrete\"}, {'id': 66, 'start': 376.94000244140625, 'end': 384.2200012207031, 'text': ' and stone encampment is limited.'}, {'id': 67, 'start': 384.2200012207031, 'end': 391.0199890136719, 'text': ' So I would say that we can take out some of their program, roll them back a little,'}, {'id': 68, 'start': 391.0199890136719, 'end': 394.05999755859375, 'text': ' but we cannot stop the program altogether.'}, {'id': 69, 'start': 394.05999755859375, 'end': 395.05999755859375, 'text': ' I see.'}, {'id': 70, 'start': 395.05999755859375, 'end': 398.9800109863281, 'text': ' What about, besides bombing, other potential alternatives?'}, {'id': 71, 'start': 398.9800109863281, 'end': 401.82000732421875, 'text': ' For example, covert operations.'}, {'id': 72, 'start': 401.82000732421875, 'end': 407.5400085449219, 'text': \" Just note that just in the past couple of weeks, we've seen some very mysterious explosions\"}, {'id': 73, 'start': 407.5400085449219, 'end': 408.5400085449219, 'text': ' in Iran.'}, {'id': 74, 'start': 408.5400085449219, 'end': 415.17999267578125, 'text': ' There was a Shaheed-Rajipur explosion, there was a factory in Mashhad, a power plant.'}, {'id': 75, 'start': 415.17999267578125, 'end': 422.2200012207031, 'text': ' How effective could covert operations, together with or by themselves, be in stopping or delaying'}, {'id': 76, 'start': 422.2200012207031, 'end': 423.3800048828125, 'text': ' the Iran nuclear program?'}, {'id': 77, 'start': 423.3800048828125, 'end': 426.70001220703125, 'text': \" Oh, it can delay, but it won't stop.\"}, {'id': 78, 'start': 426.70001220703125, 'end': 433.1400146484375, 'text': ' The program, the Iranian program, has been on from 1988, when Khomeini told his generals'}, {'id': 79, 'start': 433.1400146484375, 'end': 439.0199890136719, 'text': ' at the end of the war with the Iraqis, we need a weapon of leverage.'}, {'id': 80, 'start': 439.0199890136719, 'end': 445.05999755859375, 'text': \" That's when the program started, not seeing Israel as a target, but a fleet.\"}, {'id': 81, 'start': 445.05999755859375, 'end': 450.3399963378906, 'text': ' It has turned towards Israel, and that, in order to release the pressure off Saudi Arabia'}, {'id': 82, 'start': 450.3399963378906, 'end': 455.29998779296875, 'text': ' and Egypt, who have been at odds for four or five centuries at least.'}, {'id': 83, 'start': 455.29998779296875, 'end': 456.29998779296875, 'text': ' Right.'}, {'id': 84, 'start': 456.29998779296875, 'end': 461.4200134277344, 'text': ' Now, there have been some reports, Relic, that even as early as this month, Prime Minister'}, {'id': 85, 'start': 461.4200134277344, 'end': 468.0199890136719, 'text': ' Netanyahu was hoping for, or working towards, some kind of military operation or security'}, {'id': 86, 'start': 468.0199890136719, 'end': 473.05999755859375, 'text': ' operation against Iran nuclear reactors, and President Trump ordered a halt to that.'}, {'id': 87, 'start': 473.05999755859375, 'end': 475.5400085449219, 'text': ' He wants to see if diplomacy can work.'}, {'id': 88, 'start': 475.5400085449219, 'end': 481.260009765625, 'text': \" Obviously, it's a political, a diplomatic question about whether Israel could do that,\"}, {'id': 89, 'start': 481.260009765625, 'end': 484.6199951171875, 'text': ' go ahead without US approval, or even against the wishes of the US.'}, {'id': 90, 'start': 484.6199951171875, 'end': 491.1000061035156, 'text': ' But there is a security element as well, because the US and Israel are so, or certainly Israel'}, {'id': 91, 'start': 491.1000061035156, 'end': 494.3800048828125, 'text': \" is so dependent, or they're co-dependent in the region together.\"}, {'id': 92, 'start': 494.3800048828125, 'end': 500.5400085449219, 'text': ' So how wise would it be for Israel to move ahead without US approval, or even a scenario'}, {'id': 93, 'start': 500.5400085449219, 'end': 503.8599853515625, 'text': \" in which it perhaps doesn't even inform the US?\"}, {'id': 94, 'start': 503.8599853515625, 'end': 510.5799865722656, 'text': ' Well, that is very unlikely to happen because of the repercussions following that.'}, {'id': 95, 'start': 510.5799865722656, 'end': 515.5, 'text': ' And remember that Israel is probably the only ally that we have at this time in the Western'}, {'id': 96, 'start': 515.5, 'end': 517.8599853515625, 'text': ' world.'}, {'id': 97, 'start': 517.8599853515625, 'end': 528.8800048828125, 'text': \" The US has other things in its basket, such as the Ukrainian war, and let's not forget\"}, {'id': 98, 'start': 528.8800048828125, 'end': 530.97998046875, 'text': ' China and Taiwan.'}, {'id': 99, 'start': 530.97998046875, 'end': 538.1799926757812, 'text': ' Maybe the Chinese will see an attack by the US on Iran as a go-ahead for them to attack'}, {'id': 100, 'start': 538.1799926757812, 'end': 539.5, 'text': ' Taiwan.'}, {'id': 101, 'start': 539.5, 'end': 546.260009765625, 'text': ' So all these actually have to be taken into account when we think of a more global look'}, {'id': 102, 'start': 546.3800048828125, 'end': 549.3800048828125, 'text': ' at what is happening between ourselves and Iran.'}, {'id': 103, 'start': 549.3800048828125, 'end': 550.3800048828125, 'text': ' Right.'}, {'id': 104, 'start': 550.3800048828125, 'end': 557.8599853515625, 'text': ' Now, if the US should reach a deal with Iran that may fall short, for example, of dismantling'}, {'id': 105, 'start': 557.8599853515625, 'end': 563.1199951171875, 'text': ' its civilian nuclear program, at some point the security establishment presumably will'}, {'id': 106, 'start': 563.1199951171875, 'end': 569.4600219726562, 'text': ' be asked by the government if Israel can live with such a deal.'}, {'id': 107, 'start': 569.4600219726562, 'end': 572.8200073242188, 'text': ' What threat does that pose to the security of Israel?'}, {'id': 108, 'start': 572.8200073242188, 'end': 577.5399780273438, 'text': ' How would they likely answer that?'}, {'id': 109, 'start': 577.5399780273438, 'end': 585.8800048828125, 'text': \" The 2015 agreement was supported by a lot of people in Israel who said it's much better\"}, {'id': 110, 'start': 585.8800048828125, 'end': 590.8200073242188, 'text': ' to have a limited control as it was in the 2015.'}, {'id': 111, 'start': 590.8200073242188, 'end': 593.8200073242188, 'text': ' But also opposed by some security analysts.'}, {'id': 112, 'start': 593.8200073242188, 'end': 594.8200073242188, 'text': ' Very few.'}, {'id': 113, 'start': 594.8200073242188, 'end': 602.4199829101562, 'text': ' And Netanyahu insisted on going on and pushing for the annulment of that agreement, and as'}, {'id': 114, 'start': 602.4199829101562, 'end': 608.3400268554688, 'text': \" a result what we're seeing now is that Iran is ever closer to a nuclear weapon.\"}, {'id': 115, 'start': 608.3400268554688, 'end': 614.6599731445312, 'text': ' So getting them down to an enrichment of about three and a half percent, four percent for'}, {'id': 116, 'start': 614.6599731445312, 'end': 623.3800048828125, 'text': \" civilian use, it's very difficult to explain in the whole world why this can't be done,\"}, {'id': 117, 'start': 623.3800048828125, 'end': 630.4199829101562, 'text': ' being able to control all of the sites, including the military sites, by US inspectors.'}, {'id': 118, 'start': 630.4199829101562, 'end': 636.7000122070312, 'text': \" Well, of course, that's part of the key elements of the deal, inspection of those plants, whether\"}, {'id': 119, 'start': 636.7000122070312, 'end': 638.1400146484375, 'text': ' that be sufficient.'}, {'id': 120, 'start': 638.1400146484375, 'end': 642.219970703125, 'text': ' But another criticism of the 2015 deal is it did nothing to address, for example, the'}, {'id': 121, 'start': 642.219970703125, 'end': 644.9000244140625, 'text': ' ballistic missile program of Iran.'}, {'id': 122, 'start': 644.9000244140625, 'end': 650.260009765625, 'text': \" And we've seen, unfortunately in Israel, a direct result of that ballistic missile program\"}, {'id': 123, 'start': 650.260009765625, 'end': 656.260009765625, 'text': ' just this past week with the Houthi successful attack on Ben Gurion Airport.'}, {'id': 124, 'start': 656.260009765625, 'end': 661.02001953125, 'text': ' Could Israel live with no limitations at all, or what kind of security threat would'}, {'id': 125, 'start': 661.02001953125, 'end': 666.02001953125, 'text': \" it be if there would be a deal with no limitations, for example, on Iran's ballistic missile program\"}, {'id': 126, 'start': 666.02001953125, 'end': 671.7000122070312, 'text': ' or its support for delivering those ballistic missiles to terror groups like the Houthis?'}, {'id': 127, 'start': 671.7000122070312, 'end': 677.0599975585938, 'text': \" It's a good question that has to do with world politics.\"}, {'id': 128, 'start': 677.0599975585938, 'end': 681.3800048828125, 'text': \" What about North Korea's ballistic missiles?\"}, {'id': 129, 'start': 681.3800048828125, 'end': 685.3800048828125, 'text': \" I understand that, but I'm talking specifically about the security threat those missiles pose\"}, {'id': 130, 'start': 685.5, 'end': 686.5, 'text': ' to Israel.'}, {'id': 131, 'start': 686.5, 'end': 693.260009765625, 'text': ' Yes, but they could take North Korean missiles and use them, and it would be very difficult'}, {'id': 132, 'start': 693.260009765625, 'end': 700.739990234375, 'text': ' to push this through the Europeans, who will most likely not support this part of the deal,'}, {'id': 133, 'start': 700.739990234375, 'end': 701.739990234375, 'text': ' unfortunately.'}, {'id': 134, 'start': 701.739990234375, 'end': 702.739990234375, 'text': ' Right.'}, {'id': 135, 'start': 702.739990234375, 'end': 707.8200073242188, 'text': \" Well, let's talk a little about that Houthi attack on Ben Gurion Airport.\"}, {'id': 136, 'start': 707.8200073242188, 'end': 713.4199829101562, 'text': ' As someone who certainly knows about air defense systems, how is it possible that that one'}, {'id': 137, 'start': 713.4199829101562, 'end': 719.02001953125, 'text': \" missile managed to evade both the Israel's Ahrar program, which has shown great success\"}, {'id': 138, 'start': 719.02001953125, 'end': 725.1400146484375, 'text': ' in other circumstances, including attacks directly from Iran, and the U.S. THAAD missile'}, {'id': 139, 'start': 725.1400146484375, 'end': 730.1799926757812, 'text': ' system, which many people thought was the really most advanced air defense system that'}, {'id': 140, 'start': 730.1799926757812, 'end': 731.3800048828125, 'text': ' has been created?'}, {'id': 141, 'start': 731.3800048828125, 'end': 735.02001953125, 'text': ' Well, you could argue which one is the most advanced.'}, {'id': 142, 'start': 735.02001953125, 'end': 739.3800048828125, 'text': ' Well, neither performed to distinction this past week.'}, {'id': 143, 'start': 739.3800048828125, 'end': 745.739990234375, 'text': \" That basically, we're talking about a 95% probability of direct hit.\"}, {'id': 144, 'start': 745.739990234375, 'end': 751.4600219726562, 'text': \" We're talking about a closure speed of about two miles per second.\"}, {'id': 145, 'start': 751.4600219726562, 'end': 761.3800048828125, 'text': ' And a small miss, or a small change in direction of the target, can cause a miss.'}, {'id': 146, 'start': 761.3800048828125, 'end': 767.6599731445312, 'text': ' Maybe we need three missiles per, to shoot three missiles per Houthi missile to make'}, {'id': 147, 'start': 767.6599731445312, 'end': 770.6400146484375, 'text': \" sure that we're closer to 100.\"}, {'id': 148, 'start': 770.6400146484375, 'end': 777.3400268554688, 'text': ' But there is no hermetic answer to these, and we will have to suffer the consequences'}, {'id': 149, 'start': 777.3400268554688, 'end': 780.9400024414062, 'text': ' every now and then if it goes on for a long time.'}, {'id': 150, 'start': 780.9400024414062, 'end': 786.9400024414062, 'text': ' Which does raise the question, though, you talk about adding on, does Israel, is its'}, {'id': 151, 'start': 786.9400024414062, 'end': 793.5, 'text': \" air defense shield sufficient, given the fact that it's now being attacked in multiple directions?\"}, {'id': 152, 'start': 793.5, 'end': 798.5, 'text': \" By the Houthis, certainly we've seen direct fire from Iran, always a threat of Hezbollah,\"}, {'id': 153, 'start': 798.5, 'end': 804.3800048828125, 'text': ' and of course, even these militias in Iraq who are allied with Iran.'}, {'id': 154, 'start': 804.3800048828125, 'end': 814.3800048828125, 'text': \" I think we've seen, from April into October of 2024, the ability to stop most of the missiles\"}, {'id': 155, 'start': 814.3800048828125, 'end': 815.3800048828125, 'text': ' coming in.'}, {'id': 156, 'start': 815.3800048828125, 'end': 817.8200073242188, 'text': ' Some will come in and create some damage.'}, {'id': 157, 'start': 817.8200073242188, 'end': 828.8200073242188, 'text': ' But just to let you know, one of those missiles, an F-15 fully loaded, has 24 of those missiles'}, {'id': 158, 'start': 828.8200073242188, 'end': 832.0599975585938, 'text': ' stacked up when it goes to bombing.'}, {'id': 159, 'start': 832.0599975585938, 'end': 836.4199829101562, 'text': ' So just to understand the damage that could be caused.'}, {'id': 160, 'start': 836.4199829101562, 'end': 837.4199829101562, 'text': ' Right.'}, {'id': 161, 'start': 837.4199829101562, 'end': 842.9000244140625, 'text': \" I do want to just reference the operation that's been announced in the Gaza Strip, in\"}, {'id': 162, 'start': 842.9000244140625, 'end': 850.219970703125, 'text': ' the context of Israel fighting a multi-front war, and potentially even contemplating a'}, {'id': 163, 'start': 850.219970703125, 'end': 855.7000122070312, 'text': ' strike on Iran, which would really extend that front.'}, {'id': 164, 'start': 855.7000122070312, 'end': 861.3800048828125, 'text': ' We could see the north really heat up again, direct attacks.'}, {'id': 165, 'start': 861.3800048828125, 'end': 866.7000122070312, 'text': ' Given the scope of the operation planned in Gaza, is the IEDF, does it have the capability'}, {'id': 166, 'start': 866.7000122070312, 'end': 871.780029296875, 'text': ' to contend with all of these challenges, all potentially at the same time?'}, {'id': 167, 'start': 871.780029296875, 'end': 878.5800170898438, 'text': \" In Lebanon, in Syria and Iran, and the Houthis, it's all Air Force, and it doesn't take the\"}, {'id': 168, 'start': 878.5800170898438, 'end': 884.3400268554688, 'text': ' whole Air Force to take care of those scenarios.'}, {'id': 169, 'start': 884.3400268554688, 'end': 893.8599853515625, 'text': ' In Gaza itself, the Air Force, mainly using RPVs, or UAVs, with the forces to make sure'}, {'id': 170, 'start': 893.8599853515625, 'end': 898.3800048828125, 'text': \" that they're defended as they move along, is the main force.\"}, {'id': 171, 'start': 898.3800048828125, 'end': 904.0599975585938, 'text': ' Because the Israeli Air Force does not want to use a one-ton bomb in order to take out'}, {'id': 172, 'start': 904.0599975585938, 'end': 911.02001953125, 'text': ' small munition depots or terrorists, in order not to create collateral damage.'}, {'id': 173, 'start': 911.02001953125, 'end': 915.6599731445312, 'text': ' So the Air Force can do all of these missions.'}, {'id': 174, 'start': 915.6599731445312, 'end': 917.9000244140625, 'text': \" It's strong enough and big enough.\"}, {'id': 175, 'start': 917.9000244140625, 'end': 925.5, 'text': ' The ground forces, they will move in probably after Trump leaves, at a certain manner that'}, {'id': 176, 'start': 925.5, 'end': 927.9400024414062, 'text': \" we don't really know yet how.\"}, {'id': 177, 'start': 927.9400024414062, 'end': 928.9400024414062, 'text': ' Understood.'}, {'id': 178, 'start': 928.9400024414062, 'end': 931.6199951171875, 'text': ' And again, just one last point on this.'}, {'id': 179, 'start': 931.6199951171875, 'end': 937.5399780273438, 'text': \" Gaza, Israel's military operation in Gaza, so far as you know, does have the U.S. support,\"}, {'id': 180, 'start': 937.5399780273438, 'end': 941.5800170898438, 'text': ' which is crucial, especially when it comes to some of the issues involved, for example,'}, {'id': 181, 'start': 941.5800170898438, 'end': 944.8599853515625, 'text': ' replacing the humanitarian aid system.'}, {'id': 182, 'start': 944.8599853515625, 'end': 950.780029296875, 'text': \" Does that, in a sense, perhaps limit Israel's options in dealing, perhaps, with Iran, with\"}, {'id': 183, 'start': 950.780029296875, 'end': 956.4199829101562, 'text': \" the Houthis, where the U.S. has told Israel, we're going to handle it, because of the interdependence\"}, {'id': 184, 'start': 956.4199829101562, 'end': 963.1400146484375, 'text': ' now of Israel on the U.S. for that kind of military operation, for example, in Gaza?'}, {'id': 185, 'start': 963.1400146484375, 'end': 968.0999755859375, 'text': ' Well, obviously, the political support of the U.S. is of utmost importance.'}, {'id': 186, 'start': 968.0999755859375, 'end': 975.9199829101562, 'text': \" And I don't see Israel acting against Trump's will, else we will see how he deals with his\"}, {'id': 187, 'start': 975.9199829101562, 'end': 980.02001953125, 'text': ' own staff when they misbehave, so to speak.'}, {'id': 188, 'start': 980.02001953125, 'end': 985.219970703125, 'text': \" And so Israel doesn't want to go against Trump, because then it will really be alone.\"}, {'id': 189, 'start': 985.219970703125, 'end': 991.0599975585938, 'text': \" And this is something that we probably won't want to do at this time, under any duress.\"}, {'id': 190, 'start': 991.0599975585938, 'end': 992.0599975585938, 'text': ' All right.'}, {'id': 191, 'start': 992.0599975585938, 'end': 997.0599975585938, 'text': \" So right now, the game is, the ball is in, it would seem, in Washington's court, and\"}, {'id': 192, 'start': 997.0599975585938, 'end': 1002.6199951171875, 'text': \" with U.S. President Trump, and these negotiations, and maybe we'll be seeing some answers during\"}, {'id': 193, 'start': 1002.6199951171875, 'end': 1007.780029296875, 'text': ' his visit, his planned visit to the region next week.'}, {'id': 194, 'start': 1007.780029296875, 'end': 1015.02001953125, 'text': \" Syria is home to over 600,000 Druze, a little over 3% of that nation's total population,\"}, {'id': 195, 'start': 1015.02001953125, 'end': 1018.219970703125, 'text': ' and more than half of all the Druze worldwide.'}, {'id': 196, 'start': 1018.219970703125, 'end': 1023.739990234375, 'text': \" Now most live in the country's southwest corner, an area bordering Golan and the Golan Heights\"}, {'id': 197, 'start': 1023.739990234375, 'end': 1024.739990234375, 'text': ' in Israel.'}, {'id': 198, 'start': 1024.739990234375, 'end': 1028.780029296875, 'text': ' In recent weeks, more than 100 people have been killed in violence between the Syrian'}, {'id': 199, 'start': 1028.780029296875, 'end': 1032.5, 'text': ' Druze and pro-government Islamist forces.'}, {'id': 200, 'start': 1032.5, 'end': 1037.219970703125, 'text': ' The Syrian Druze have maintained close ties through the years with their fellow Druze'}, {'id': 201, 'start': 1037.219970703125, 'end': 1043.5799560546875, 'text': ' in Israel, and in their hour of need, they are calling on Jerusalem for help.'}, {'id': 202, 'start': 1043.5799560546875, 'end': 1044.9000244140625, 'text': ' And Israel is responding.'}, {'id': 203, 'start': 1044.9000244140625, 'end': 1050.260009765625, 'text': ' The Israeli Air Force struck several military targets in and around Damascus over the weekend,'}, {'id': 204, 'start': 1050.260009765625, 'end': 1055.4200439453125, 'text': ' in what the government called, quote, a clear message to the Syrian regime to not allow'}, {'id': 205, 'start': 1055.4200439453125, 'end': 1061.4599609375, 'text': ' the deployment of forces south of Damascus, or pose any threat to the Druze community.'}, {'id': 206, 'start': 1061.4599609375, 'end': 1067.6600341796875, 'text': \" IDF forces also deployed in several Druze villages that sit along Syria's border area\"}, {'id': 207, 'start': 1067.6600341796875, 'end': 1071.3399658203125, 'text': ' with northern Israel, providing aid and security.'}, {'id': 208, 'start': 1071.3399658203125, 'end': 1077.219970703125, 'text': ' And some two dozen Druze civilians have been evacuated by the IDF from Syria to the Ziv'}, {'id': 209, 'start': 1077.219970703125, 'end': 1079.699951171875, 'text': ' Hospital in Sfat for medical treatment.'}, {'id': 210, 'start': 1131.3399658203125, 'end': 1152.780029296875, 'text': \" Still with us is Israel's Relic Shafir.\"}, {'id': 211, 'start': 1152.780029296875, 'end': 1159.219970703125, 'text': \" And Relic, let me ask you, how far can Israel go given, as we've discussed, the stretching\"}, {'id': 212, 'start': 1159.219970703125, 'end': 1162.5799560546875, 'text': ' of its forces at this time to provide protection for the Syrian Druze?'}, {'id': 213, 'start': 1162.5799560546875, 'end': 1168.02001953125, 'text': ' Well, most of the protection would be done by the Air Force, UAVs, or fighter aircraft'}, {'id': 214, 'start': 1168.02001953125, 'end': 1175.9000244140625, 'text': ' if needed, to stop any attacking forces from getting close to Sueda, which is the major'}, {'id': 215, 'start': 1175.9000244140625, 'end': 1179.5400390625, 'text': ' Druze city.'}, {'id': 216, 'start': 1179.5799560546875, 'end': 1196.0999755859375, 'text': ' the Syrian regime that should they give their hand to attack the Druze, they will suffer'}, {'id': 217, 'start': 1196.0999755859375, 'end': 1198.93994140625, 'text': ' close to Damascus.'}, {'id': 218, 'start': 1198.93994140625, 'end': 1200.93994140625, 'text': \" And we'll see how that will go.\"}, {'id': 219, 'start': 1200.93994140625, 'end': 1208.93994140625, 'text': \" Otherwise, a lot of aid and make sure there's an open route to Jordan, which is also acting\"}, {'id': 220, 'start': 1208.93994140625, 'end': 1212.93994140625, 'text': ' against the Islamic Brotherhood, has been doing so lately.'}, {'id': 221, 'start': 1212.93994140625, 'end': 1213.93994140625, 'text': ' In Syria.'}, {'id': 222, 'start': 1213.93994140625, 'end': 1214.93994140625, 'text': ' Yes.'}, {'id': 223, 'start': 1214.93994140625, 'end': 1215.93994140625, 'text': ' No, in Jordan itself.'}, {'id': 224, 'start': 1215.93994140625, 'end': 1216.93994140625, 'text': ' In Jordan itself.'}, {'id': 225, 'start': 1216.93994140625, 'end': 1223.800048828125, 'text': \" So it's a concentration of forces to help the Druze, and this is also a sign for the\"}, {'id': 226, 'start': 1223.800048828125, 'end': 1229.8599853515625, 'text': ' Turks, who are pretty active in the northern part of Syria, not to go further south and'}, {'id': 227, 'start': 1229.8599853515625, 'end': 1233.4200439453125, 'text': ' actually de-conflict with Israel in that area.'}, {'id': 228, 'start': 1233.4200439453125, 'end': 1241.02001953125, 'text': ' Syria has gone back to the pre-1919 Sykes-Picot agreement that actually took all these tribes'}, {'id': 229, 'start': 1241.02001953125, 'end': 1243.0999755859375, 'text': ' and drew a line in the sand to make that Syria.'}, {'id': 230, 'start': 1243.0999755859375, 'end': 1244.0999755859375, 'text': ' Right.'}, {'id': 231, 'start': 1244.0999755859375, 'end': 1247.8199462890625, 'text': \" It's less a country than now a conglomeration of differing entities.\"}, {'id': 232, 'start': 1247.8199462890625, 'end': 1250.260009765625, 'text': ' I would say tribes and entities, yes.'}, {'id': 233, 'start': 1250.260009765625, 'end': 1251.260009765625, 'text': ' All right.'}, {'id': 234, 'start': 1251.260009765625, 'end': 1257.780029296875, 'text': \" Well, let's wish the best for the Druze there in Syria, who have been calling on Israel\"}, {'id': 235, 'start': 1257.780029296875, 'end': 1258.780029296875, 'text': ' for help.'}, {'id': 236, 'start': 1258.780029296875, 'end': 1263.5400390625, 'text': ' And, of course, Israel owes a debt to the Israeli Druze, who have been so a key part'}, {'id': 237, 'start': 1263.5400390625, 'end': 1267.5799560546875, 'text': ' of the Israeli military effort until this very day.'}, {'id': 238, 'start': 1267.5799560546875, 'end': 1272.6199951171875, 'text': ' Israel Relic, Shafir, thank you for joining us on an ILTV Security Brief.'}, {'id': 239, 'start': 1272.6199951171875, 'end': 1274.3399658203125, 'text': ' Thank you for having me.'}, {'id': 240, 'start': 1274.3399658203125, 'end': 1276.260009765625, 'text': ' And now a final word.'}, {'id': 241, 'start': 1276.260009765625, 'end': 1282.06005859375, 'text': ' Last week, Israel observed its Memorial Day, honoring the over 25,000 men and women who'}, {'id': 242, 'start': 1282.06005859375, 'end': 1287.219970703125, 'text': ' have fallen in defense of Israel and the Jewish national home over the years.'}, {'id': 243, 'start': 1287.219970703125, 'end': 1292.260009765625, 'text': ' Among the many ceremonies held that day was a very special one in Jerusalem, held in memory'}, {'id': 244, 'start': 1292.260009765625, 'end': 1297.260009765625, 'text': \" of some 50 members of Israel's ultra-Orthodox or Haredi community.\"}, {'id': 245, 'start': 1297.260009765625, 'end': 1303.6400146484375, 'text': ' Some 3,000 attendees took part in a memorial organized by the NGO Netzach Yehuda, named'}, {'id': 246, 'start': 1303.6400146484375, 'end': 1310.02001953125, 'text': ' after the battalion created by the IDF to especially enable Haredi soldiers to serve'}, {'id': 247, 'start': 1310.02001953125, 'end': 1314.739990234375, 'text': ' in combat roles without compromising their religious values.'}, {'id': 248, 'start': 1314.780029296875, 'end': 1321.9000244140625, 'text': ' The same week, some 400 Haredi men were enlisted in the IDF, but that is just a small percentage'}, {'id': 249, 'start': 1321.9000244140625, 'end': 1325.9000244140625, 'text': ' of the 10,000 draft notices sent out last year.'}, {'id': 250, 'start': 1325.9000244140625, 'end': 1332.06005859375, 'text': ' And some of those who did enlist found themselves harassed by Haredi anti-draft protesters as'}, {'id': 251, 'start': 1332.06005859375, 'end': 1335.8599853515625, 'text': ' they made their way to and from recruitment centers.'}, {'id': 252, 'start': 1335.8599853515625, 'end': 1340.780029296875, 'text': ' Now the issue of draft exemptions for the Haredi community is a complex one, and there'}, {'id': 253, 'start': 1340.780029296875, 'end': 1346.5799560546875, 'text': ' are legitimate disagreements over the best way to integrate the ultra-Orthodox into military'}, {'id': 254, 'start': 1346.5799560546875, 'end': 1350.699951171875, 'text': ' or national service, or even to do so.'}, {'id': 255, 'start': 1350.699951171875, 'end': 1355.219970703125, 'text': ' But speaking for myself, as an IDF veteran and the father of IDF veterans, there can'}, {'id': 256, 'start': 1355.219970703125, 'end': 1359.699951171875, 'text': ' be no excuse for the abuse of those Haredi youngsters that are prepared to share the'}, {'id': 257, 'start': 1359.699951171875, 'end': 1365.780029296875, 'text': ' burden of military duty with their Jewish brethren, or the silence of many Haredi political'}, {'id': 258, 'start': 1365.780029296875, 'end': 1369.780029296875, 'text': ' and rabbinical leaders to condemn this outrageous behavior.'}, {'id': 259, 'start': 1369.780029296875, 'end': 1375.0400390625, 'text': ' This is especially so as the IDF is now dealing with a serious manpower shortage as it fights'}, {'id': 260, 'start': 1375.0400390625, 'end': 1382.97998046875, 'text': ' a multi-front war, and many Israelis are contending with the crushing burden of months of reserve duty.'}, {'id': 261, 'start': 1382.97998046875, 'end': 1387.1800537109375, 'text': ' Shall your brothers go to war while you just sit here?'}, {'id': 262, 'start': 1387.1800537109375, 'end': 1393.739990234375, 'text': \" That's the question Moshe, Moses, asked the tribes of Gad and Reuben, as recorded in Bami\"}, {'id': 263, 'start': 1393.739990234375, 'end': 1395.6199951171875, 'text': \" Bar, the Bible's book of numbers.\"}, {'id': 264, 'start': 1395.97998046875, 'end': 1400.300048828125, 'text': ' It is a question no less relevant in the Israel of today.'}, {'id': 265, 'start': 1400.300048828125, 'end': 1404.06005859375, 'text': \" Thank you for joining us on ITL TV's Security Brief.\"}]}"