"{'text': \"And welcome to Hannity. And tonight, a bold new chapter in our nation's storied history is unfolding right before your eyes. A major trade deal with the U.K. is the first of many to come. The economy is on the mend. Law and order is being restored coast to coast. Left-wing agitators, they are finally facing consequences, including deportation, in spite of lawfare. Our crumbling infrastructure that Pothole Pete ignored and degraded for years is finally getting the attention it deserves. We need the skies to be safe. And as per usual, Joe Biden is completely oblivious to all of it. We'll show you the sad interview that he and Dr. Jill Biden had on that hard-hitting news show. But we begin with today's massive announcement. Watch this. This morning, I'm thrilled to announce that we have reached a breakthrough trade deal with the United Kingdom, incredible country. Today is a victory day for World War II. We won the war together exactly 80 years ago, so there could be no more perfect morning to reach this historic agreement. And it's beautiful weather out, I will tell you that, Kir. Beautiful weather. It's so perfect outside. But it's really, in particular, the agreement with one of our closest and most cherished allies. And we're so happy that that's the way it worked out. I want to thank Prime Minister Starmer and his very talented team for their outstanding work and partnership. Today's agreement with the UK is the first in a series of agreements on trade that my administration has been negotiating over the past four weeks. With this deal, the UK joins the United States in affirming that reciprocity and fairness is an essential and vital principle of international trade. Clearly, President Trump's manifest destiny, bold new trade deals with every country around the world. And today, it started with our closest ally. Now, this deal cuts red tape between our two countries. It fast-tracks trade through customs. It also eliminates British tariffs on American steel, aluminum, and opens the British market to American ethanol, agriculture, machinery. In response, the Dow, S&P, Nasdaq all rallied today. The markets now have been up 13 out of the past 15 trading days. Funny how the mainstream media doesn't report that. Now, the highly respected Atlanta Fed raised its quarterly growth projections. In just this week, it more than doubled to 2.3 percent from a week ago. Also, Goldman Sachs fears a recession are subsiding. Nonstop hand-wringing from the legacy media mob and Democrats was, yet again, totally unfounded and ridiculous. And keep in mind, this is only one deal. This is only the beginning. And remember, on Saturday, Scott Besant will be meeting in Geneva with China representatives. According to my sources, there are, in fact, numerous major agreements in the pipeline. Treasury Secretary Besant is saying deals with 18 countries, big countries, currently in the works. Now, analysts at Goldman Sachs are even predicting a looming deal with the People's Republic of China. Scott Besant, Chinese representatives, they will have that meeting on Saturday. And just off the coast, Taiwan is not even waiting for a new deal. China Airlines just ordered 14 brand-new Boeing 777 planes, with options for many more. Here's my message to the Democratic Party, the legacy media mob. Nobody cares about your doom and gloom and your hope and prayer for American failure. The American people elected a disrupter to the White House, someone who was not afraid to shake things up, someone who wouldn't settle for the status quo, for the institutionalism that is rotting D.C. And that's exactly what the American people are getting. For 50 to 60 years, America has been ripped off and abused and taken advantage of. And Donald Trump has said, enough is enough. And by the way, this is for the American economy, American manufacturing and the people that make this country great, American workers. Now, remember, his threat of tariffs also resulted in over $8 trillion in commitments for manufacturing over the next four years, in sectors where we need it—cars, pharmaceuticals, chips, and much, much more. We don't need to be dependent on any other country ever. And now our country has a chance to be better than ever before, from sea to shining sea, from the Arctic to the Gulf of America—in case you missed it, by the way, the House, they just passed legislation—angry Democrats officially renaming the Gulf of Mexico. Naturally, every Democrat voted against it. What are they for, anyway?\", 'segments': [{'id': 0, 'start': 0.0, 'end': 2.559999942779541, 'text': ' And welcome to Hannity.'}, {'id': 1, 'start': 2.559999942779541, 'end': 7.079999923706055, 'text': \" And tonight, a bold new chapter in our nation's storied history is unfolding right before\"}, {'id': 2, 'start': 7.079999923706055, 'end': 8.079999923706055, 'text': ' your eyes.'}, {'id': 3, 'start': 8.079999923706055, 'end': 11.5600004196167, 'text': ' A major trade deal with the U.K. is the first of many to come.'}, {'id': 4, 'start': 11.5600004196167, 'end': 13.4399995803833, 'text': ' The economy is on the mend.'}, {'id': 5, 'start': 13.4399995803833, 'end': 16.799999237060547, 'text': ' Law and order is being restored coast to coast.'}, {'id': 6, 'start': 16.799999237060547, 'end': 22.31999969482422, 'text': ' Left-wing agitators, they are finally facing consequences, including deportation, in spite'}, {'id': 7, 'start': 22.31999969482422, 'end': 23.739999771118164, 'text': ' of lawfare.'}, {'id': 8, 'start': 23.739999771118164, 'end': 29.479999542236328, 'text': ' Our crumbling infrastructure that Pothole Pete ignored and degraded for years is finally'}, {'id': 9, 'start': 29.479999542236328, 'end': 31.520000457763672, 'text': ' getting the attention it deserves.'}, {'id': 10, 'start': 31.520000457763672, 'end': 34.63999938964844, 'text': ' We need the skies to be safe.'}, {'id': 11, 'start': 34.63999938964844, 'end': 38.439998626708984, 'text': ' And as per usual, Joe Biden is completely oblivious to all of it.'}, {'id': 12, 'start': 38.439998626708984, 'end': 44.52000045776367, 'text': \" We'll show you the sad interview that he and Dr. Jill Biden had on that hard-hitting news\"}, {'id': 13, 'start': 44.52000045776367, 'end': 45.52000045776367, 'text': ' show.'}, {'id': 14, 'start': 45.52000045776367, 'end': 47.63999938964844, 'text': \" But we begin with today's massive announcement.\"}, {'id': 15, 'start': 47.63999938964844, 'end': 48.63999938964844, 'text': ' Watch this.'}, {'id': 16, 'start': 48.63999938964844, 'end': 52.7599983215332, 'text': \" This morning, I'm thrilled to announce that we have reached a breakthrough trade deal\"}, {'id': 17, 'start': 52.7599983215332, 'end': 57.08000183105469, 'text': ' with the United Kingdom, incredible country.'}, {'id': 18, 'start': 57.08000183105469, 'end': 60.599998474121094, 'text': ' Today is a victory day for World War II.'}, {'id': 19, 'start': 60.599998474121094, 'end': 66.5199966430664, 'text': ' We won the war together exactly 80 years ago, so there could be no more perfect morning'}, {'id': 20, 'start': 66.5199966430664, 'end': 68.4000015258789, 'text': ' to reach this historic agreement.'}, {'id': 21, 'start': 68.4000015258789, 'end': 71.08000183105469, 'text': \" And it's beautiful weather out, I will tell you that, Kir.\"}, {'id': 22, 'start': 71.08000183105469, 'end': 72.08000183105469, 'text': ' Beautiful weather.'}, {'id': 23, 'start': 72.08000183105469, 'end': 74.16000366210938, 'text': \" It's so perfect outside.\"}, {'id': 24, 'start': 74.16000366210938, 'end': 80.44000244140625, 'text': \" But it's really, in particular, the agreement with one of our closest and most cherished\"}, {'id': 25, 'start': 80.44000244140625, 'end': 82.5999984741211, 'text': ' allies.'}, {'id': 26, 'start': 82.5999984741211, 'end': 85.5999984741211, 'text': \" And we're so happy that that's the way it worked out.\"}, {'id': 27, 'start': 85.5999984741211, 'end': 91.12000274658203, 'text': ' I want to thank Prime Minister Starmer and his very talented team for their outstanding'}, {'id': 28, 'start': 91.12000274658203, 'end': 93.55999755859375, 'text': ' work and partnership.'}, {'id': 29, 'start': 93.55999755859375, 'end': 97.95999908447266, 'text': \" Today's agreement with the UK is the first in a series of agreements on trade that my\"}, {'id': 30, 'start': 97.95999908447266, 'end': 102.69999694824219, 'text': ' administration has been negotiating over the past four weeks.'}, {'id': 31, 'start': 102.69999694824219, 'end': 108.44000244140625, 'text': ' With this deal, the UK joins the United States in affirming that reciprocity and fairness'}, {'id': 32, 'start': 108.44000244140625, 'end': 114.12000274658203, 'text': ' is an essential and vital principle of international trade.'}, {'id': 33, 'start': 114.63999938964844, 'end': 119.23999786376953, 'text': \" Clearly, President Trump's manifest destiny, bold new trade deals with every country around\"}, {'id': 34, 'start': 119.23999786376953, 'end': 120.23999786376953, 'text': ' the world.'}, {'id': 35, 'start': 120.23999786376953, 'end': 122.4800033569336, 'text': ' And today, it started with our closest ally.'}, {'id': 36, 'start': 122.4800033569336, 'end': 125.76000213623047, 'text': ' Now, this deal cuts red tape between our two countries.'}, {'id': 37, 'start': 125.76000213623047, 'end': 128.16000366210938, 'text': ' It fast-tracks trade through customs.'}, {'id': 38, 'start': 128.16000366210938, 'end': 133.5399932861328, 'text': ' It also eliminates British tariffs on American steel, aluminum, and opens the British market'}, {'id': 39, 'start': 133.5399932861328, 'end': 136.9600067138672, 'text': ' to American ethanol, agriculture, machinery.'}, {'id': 40, 'start': 136.9600067138672, 'end': 140.8800048828125, 'text': ' In response, the Dow, S&P, Nasdaq all rallied today.'}, {'id': 41, 'start': 140.8800048828125, 'end': 144.67999267578125, 'text': ' The markets now have been up 13 out of the past 15 trading days.'}, {'id': 42, 'start': 144.67999267578125, 'end': 147.60000610351562, 'text': \" Funny how the mainstream media doesn't report that.\"}, {'id': 43, 'start': 147.60000610351562, 'end': 152.63999938964844, 'text': ' Now, the highly respected Atlanta Fed raised its quarterly growth projections.'}, {'id': 44, 'start': 152.63999938964844, 'end': 158.63999938964844, 'text': ' In just this week, it more than doubled to 2.3 percent from a week ago.'}, {'id': 45, 'start': 158.63999938964844, 'end': 162.16000366210938, 'text': ' Also, Goldman Sachs fears a recession are subsiding.'}, {'id': 46, 'start': 162.16000366210938, 'end': 168.44000244140625, 'text': ' Nonstop hand-wringing from the legacy media mob and Democrats was, yet again, totally'}, {'id': 47, 'start': 168.44000244140625, 'end': 170.39999389648438, 'text': ' unfounded and ridiculous.'}, {'id': 48, 'start': 170.39999389648438, 'end': 172.63999938964844, 'text': ' And keep in mind, this is only one deal.'}, {'id': 49, 'start': 172.63999938964844, 'end': 174.16000366210938, 'text': ' This is only the beginning.'}, {'id': 50, 'start': 174.16000366210938, 'end': 179.75999450683594, 'text': ' And remember, on Saturday, Scott Besant will be meeting in Geneva with China representatives.'}, {'id': 51, 'start': 179.75999450683594, 'end': 184.47999572753906, 'text': ' According to my sources, there are, in fact, numerous major agreements in the pipeline.'}, {'id': 52, 'start': 184.47999572753906, 'end': 189.13999938964844, 'text': ' Treasury Secretary Besant is saying deals with 18 countries, big countries, currently'}, {'id': 53, 'start': 189.13999938964844, 'end': 190.13999938964844, 'text': ' in the works.'}, {'id': 54, 'start': 190.13999938964844, 'end': 194.1199951171875, 'text': \" Now, analysts at Goldman Sachs are even predicting a looming deal with the People's Republic\"}, {'id': 55, 'start': 194.1199951171875, 'end': 195.1199951171875, 'text': ' of China.'}, {'id': 56, 'start': 195.1199951171875, 'end': 199.47999572753906, 'text': ' Scott Besant, Chinese representatives, they will have that meeting on Saturday.'}, {'id': 57, 'start': 199.47999572753906, 'end': 203.47999572753906, 'text': ' And just off the coast, Taiwan is not even waiting for a new deal.'}, {'id': 58, 'start': 203.47999572753906, 'end': 211.32000732421875, 'text': ' China Airlines just ordered 14 brand-new Boeing 777 planes, with options for many more.'}, {'id': 59, 'start': 211.32000732421875, 'end': 215.1999969482422, 'text': \" Here's my message to the Democratic Party, the legacy media mob.\"}, {'id': 60, 'start': 215.1999969482422, 'end': 220.1199951171875, 'text': ' Nobody cares about your doom and gloom and your hope and prayer for American failure.'}, {'id': 61, 'start': 220.1199951171875, 'end': 224.36000061035156, 'text': ' The American people elected a disrupter to the White House, someone who was not afraid'}, {'id': 62, 'start': 224.36000061035156, 'end': 230.44000244140625, 'text': \" to shake things up, someone who wouldn't settle for the status quo, for the institutionalism\"}, {'id': 63, 'start': 230.44000244140625, 'end': 232.47999572753906, 'text': ' that is rotting D.C.'}, {'id': 64, 'start': 232.47999572753906, 'end': 235.0, 'text': \" And that's exactly what the American people are getting.\"}, {'id': 65, 'start': 235.0, 'end': 240.3000030517578, 'text': ' For 50 to 60 years, America has been ripped off and abused and taken advantage of.'}, {'id': 66, 'start': 240.3000030517578, 'end': 242.8800048828125, 'text': ' And Donald Trump has said, enough is enough.'}, {'id': 67, 'start': 242.8800048828125, 'end': 249.24000549316406, 'text': ' And by the way, this is for the American economy, American manufacturing and the people that'}, {'id': 68, 'start': 249.24000549316406, 'end': 251.67999267578125, 'text': ' make this country great, American workers.'}, {'id': 69, 'start': 251.67999267578125, 'end': 257.7200012207031, 'text': ' Now, remember, his threat of tariffs also resulted in over $8 trillion in commitments'}, {'id': 70, 'start': 257.7200012207031, 'end': 263.4800109863281, 'text': ' for manufacturing over the next four years, in sectors where we need it—cars, pharmaceuticals,'}, {'id': 71, 'start': 263.4800109863281, 'end': 265.55999755859375, 'text': ' chips, and much, much more.'}, {'id': 72, 'start': 265.55999755859375, 'end': 268.55999755859375, 'text': \" We don't need to be dependent on any other country ever.\"}, {'id': 73, 'start': 268.55999755859375, 'end': 274.0799865722656, 'text': ' And now our country has a chance to be better than ever before, from sea to shining sea,'}, {'id': 74, 'start': 274.0799865722656, 'end': 279.32000732421875, 'text': ' from the Arctic to the Gulf of America—in case you missed it, by the way, the House,'}, {'id': 75, 'start': 279.32000732421875, 'end': 284.760009765625, 'text': ' they just passed legislation—angry Democrats officially renaming the Gulf of Mexico.'}, {'id': 76, 'start': 284.760009765625, 'end': 287.2799987792969, 'text': ' Naturally, every Democrat voted against it.'}, {'id': 77, 'start': 287.2799987792969, 'end': 298.9200134277344, 'text': ' What are they for, anyway?'}]}"