"{'text': \"This is what the international air force in Sana'a, the capital of Yemen, looked like after the attacks. God is great, God is great, God is great. Israel launched an unprecedented attack on the main entrance and exit gate of Yemen in response to the attack of Atil Ahuti by the Ben Gurion air force. Yesterday we were attacked by a heavy attack on the Hodeidah port. Today our planes attacked the air base in Sana'a. We will come to terms with anyone who attacks the State of Israel. Dozens of air force fighter jets loaded with Tidlouk, Modin and Tovala flew more than 2,000 kilometers from the air base of the Israeli air force in Yemen. When we heard these attacks, we knew that Sana'a air base is exposed, it serves civilians, it is not a military base, and there is no military air base to be targeted, under the pretext that it is used for military purposes. The jets fired dozens of missiles above the air base and led to its destruction. I swear to God, Israel, we will come to terms with you. We will come to terms with you until our last breath. Prime Minister Netanyahu and Defense Minister Katshahou flew in the air with an IDF plane for the second time in a day. Our choice is when to respond, how to respond, and for what purposes to respond. This is an assessment that we make every time. This also applies to the patron of Ahuti, Iran, who without their permission and their support, for a long time Ahuti could not withstand the attack of the missiles that were fired at us. This is also a strange message to the Iranian Prime Minister. You are directly responsible for every attack by the armed forces of Ahuti against the State of Israel, and you will also bear the consequences. Half an hour before the attack, Air Force personnel and visitors noticed that they were about to be evacuated. Listen to this urgent statement carefully. We call on you to evacuate the airport area, the international airport, immediately. And warn everyone in your vicinity about the need to evacuate this area immediately, so that the evacuation and evacuation of this place, the international airport, will not pose a threat to you. In addition to the attack on the airport, they destroyed power stations in the Yemeni capital and a concrete factory in the city of Amran, which used Ahuti for military purposes. I am ready to provide all the facilities for our brothers in Gaza, no matter what they demand. And we are ready to take off. In the security system, Ahuti will continue to fire missiles and bombs over Israel, but Israel will not remain a victim to the attack on the Ben Gurion airport.\", 'segments': [{'id': 0, 'start': 0.0, 'end': 9.0, 'text': \" This is what the international air force in Sana'a, the capital of Yemen, looked like after the attacks.\"}, {'id': 1, 'start': 9.0, 'end': 14.0, 'text': ' God is great, God is great, God is great.'}, {'id': 2, 'start': 14.0, 'end': 19.0, 'text': ' Israel launched an unprecedented attack on the main entrance and exit gate of Yemen'}, {'id': 3, 'start': 19.0, 'end': 23.0, 'text': ' in response to the attack of Atil Ahuti by the Ben Gurion air force.'}, {'id': 4, 'start': 23.0, 'end': 28.0, 'text': ' Yesterday we were attacked by a heavy attack on the Hodeidah port.'}, {'id': 5, 'start': 28.0, 'end': 34.0, 'text': \" Today our planes attacked the air base in Sana'a.\"}, {'id': 6, 'start': 34.0, 'end': 37.0, 'text': ' We will come to terms with anyone who attacks the State of Israel.'}, {'id': 7, 'start': 37.0, 'end': 42.0, 'text': ' Dozens of air force fighter jets loaded with Tidlouk, Modin and Tovala'}, {'id': 8, 'start': 42.0, 'end': 48.0, 'text': ' flew more than 2,000 kilometers from the air base of the Israeli air force in Yemen.'}, {'id': 9, 'start': 48.0, 'end': 57.0, 'text': \" When we heard these attacks, we knew that Sana'a air base is exposed,\"}, {'id': 10, 'start': 57.0, 'end': 59.0, 'text': ' it serves civilians, it is not a military base,'}, {'id': 11, 'start': 59.0, 'end': 63.0, 'text': ' and there is no military air base to be targeted,'}, {'id': 12, 'start': 63.0, 'end': 66.0, 'text': ' under the pretext that it is used for military purposes.'}, {'id': 13, 'start': 66.0, 'end': 71.0, 'text': ' The jets fired dozens of missiles above the air base and led to its destruction.'}, {'id': 14, 'start': 71.0, 'end': 74.0, 'text': ' I swear to God, Israel, we will come to terms with you.'}, {'id': 15, 'start': 74.0, 'end': 77.0, 'text': ' We will come to terms with you until our last breath.'}, {'id': 16, 'start': 77.0, 'end': 80.0, 'text': ' Prime Minister Netanyahu and Defense Minister Katshahou'}, {'id': 17, 'start': 80.0, 'end': 85.0, 'text': ' flew in the air with an IDF plane for the second time in a day.'}, {'id': 18, 'start': 85.0, 'end': 90.0, 'text': ' Our choice is when to respond, how to respond, and for what purposes to respond.'}, {'id': 19, 'start': 90.0, 'end': 92.0, 'text': ' This is an assessment that we make every time.'}, {'id': 20, 'start': 92.0, 'end': 95.0, 'text': ' This also applies to the patron of Ahuti, Iran,'}, {'id': 21, 'start': 95.0, 'end': 98.0, 'text': ' who without their permission and their support,'}, {'id': 22, 'start': 98.0, 'end': 102.0, 'text': ' for a long time Ahuti could not withstand the attack of the missiles that were fired at us.'}, {'id': 23, 'start': 102.0, 'end': 106.0, 'text': ' This is also a strange message to the Iranian Prime Minister.'}, {'id': 24, 'start': 106.0, 'end': 110.0, 'text': ' You are directly responsible for every attack'}, {'id': 25, 'start': 110.0, 'end': 115.0, 'text': ' by the armed forces of Ahuti against the State of Israel,'}, {'id': 26, 'start': 115.0, 'end': 119.0, 'text': ' and you will also bear the consequences.'}, {'id': 27, 'start': 119.0, 'end': 121.0, 'text': ' Half an hour before the attack,'}, {'id': 28, 'start': 121.0, 'end': 124.0, 'text': ' Air Force personnel and visitors noticed that they were about to be evacuated.'}, {'id': 29, 'start': 124.0, 'end': 128.0, 'text': ' Listen to this urgent statement carefully.'}, {'id': 30, 'start': 128.0, 'end': 130.0, 'text': ' We call on you to evacuate the airport area,'}, {'id': 31, 'start': 130.0, 'end': 133.0, 'text': ' the international airport, immediately.'}, {'id': 32, 'start': 133.0, 'end': 135.0, 'text': ' And warn everyone in your vicinity'}, {'id': 33, 'start': 135.0, 'end': 138.0, 'text': ' about the need to evacuate this area immediately,'}, {'id': 34, 'start': 138.0, 'end': 141.0, 'text': ' so that the evacuation and evacuation of this place,'}, {'id': 35, 'start': 141.0, 'end': 144.0, 'text': ' the international airport, will not pose a threat to you.'}, {'id': 36, 'start': 144.0, 'end': 146.0, 'text': ' In addition to the attack on the airport,'}, {'id': 37, 'start': 146.0, 'end': 148.0, 'text': ' they destroyed power stations in the Yemeni capital'}, {'id': 38, 'start': 148.0, 'end': 150.0, 'text': ' and a concrete factory in the city of Amran,'}, {'id': 39, 'start': 150.0, 'end': 153.0, 'text': ' which used Ahuti for military purposes.'}, {'id': 40, 'start': 153.0, 'end': 156.0, 'text': ' I am ready to provide all the facilities'}, {'id': 41, 'start': 156.0, 'end': 159.0, 'text': ' for our brothers in Gaza,'}, {'id': 42, 'start': 159.0, 'end': 161.0, 'text': ' no matter what they demand.'}, {'id': 43, 'start': 161.0, 'end': 166.0, 'text': ' And we are ready to take off.'}, {'id': 44, 'start': 166.0, 'end': 168.0, 'text': ' In the security system,'}, {'id': 45, 'start': 168.0, 'end': 172.0, 'text': ' Ahuti will continue to fire missiles and bombs over Israel,'}, {'id': 46, 'start': 172.0, 'end': 175.0, 'text': ' but Israel will not remain a victim'}, {'id': 47, 'start': 175.0, 'end': 178.0, 'text': ' to the attack on the Ben Gurion airport.'}]}"