"{'text': \"Social media is terrific for staying in touch in these days of social distancing. It's also filled with plenty of rubbish. Victoria Police had to step in after a Facebook post was shared more than 100,000 times saying a warehouse in Melbourne was stockpiling food and sanitary items to send overseas. The police checked with the company and it wasn't. Another Facebook post shared over 40,000 times claimed inhaling the steam from boiled oranges with cayenne pepper will get rid of coronavirus by making infected mucus stream from your nose. Medical experts say that is complete rubbish and don't do it, unless you like the smell of boiled oranges. Now you might have heard a malaria drug called chloroquine being trumpeted by no less than the President of the United States as being very promising for treating COVID-19. And it's very effective. It's a strong, it's a strong drug. It's certainly being investigated. But President Trump also claimed the drug had already been approved by America's Food and Drug Administration as a treatment. It hadn't. Sadly, that fact check came too late for an American man who swallowed fish medicine containing chloroquine phosphate after seeing Mr Trump's comments on TV. He died and his wife is in hospital. Fact Check has a new newsletter to help you sort fact from fiction. To sign up to have Corona Check directly delivered to your inbox, go to the website. And if you've seen something you want checked, let us know.\", 'segments': [{'id': 0, 'start': 0.0, 'end': 4.559999942779541, 'text': ' Social media is terrific for staying in touch in these days of social distancing.'}, {'id': 1, 'start': 4.559999942779541, 'end': 7.519999980926514, 'text': \" It's also filled with plenty of rubbish.\"}, {'id': 2, 'start': 7.519999980926514, 'end': 12.880000114440918, 'text': ' Victoria Police had to step in after a Facebook post was shared more than 100,000 times'}, {'id': 3, 'start': 12.880000114440918, 'end': 19.1200008392334, 'text': ' saying a warehouse in Melbourne was stockpiling food and sanitary items to send overseas.'}, {'id': 4, 'start': 19.1200008392334, 'end': 22.31999969482422, 'text': \" The police checked with the company and it wasn't.\"}, {'id': 5, 'start': 22.31999969482422, 'end': 28.31999969482422, 'text': ' Another Facebook post shared over 40,000 times claimed inhaling the steam from boiled oranges'}, {'id': 6, 'start': 28.31999969482422, 'end': 35.040000915527344, 'text': ' with cayenne pepper will get rid of coronavirus by making infected mucus stream from your nose.'}, {'id': 7, 'start': 35.68000030517578, 'end': 39.68000030517578, 'text': \" Medical experts say that is complete rubbish and don't do it,\"}, {'id': 8, 'start': 39.68000030517578, 'end': 41.91999816894531, 'text': ' unless you like the smell of boiled oranges.'}, {'id': 9, 'start': 41.91999816894531, 'end': 47.279998779296875, 'text': ' Now you might have heard a malaria drug called chloroquine being trumpeted by no less than'}, {'id': 10, 'start': 47.279998779296875, 'end': 52.79999923706055, 'text': ' the President of the United States as being very promising for treating COVID-19.'}, {'id': 11, 'start': 52.79999923706055, 'end': 55.439998626708984, 'text': \" And it's very effective. It's a strong, it's a strong drug.\"}, {'id': 12, 'start': 56.0, 'end': 58.0, 'text': \" It's certainly being investigated.\"}, {'id': 13, 'start': 58.0, 'end': 62.47999954223633, 'text': ' But President Trump also claimed the drug had already been approved'}, {'id': 14, 'start': 62.47999954223633, 'end': 65.76000213623047, 'text': \" by America's Food and Drug Administration as a treatment.\"}, {'id': 15, 'start': 66.31999969482422, 'end': 67.44000244140625, 'text': \" It hadn't.\"}, {'id': 16, 'start': 67.44000244140625, 'end': 72.16000366210938, 'text': ' Sadly, that fact check came too late for an American man who swallowed fish medicine'}, {'id': 17, 'start': 72.16000366210938, 'end': 77.27999877929688, 'text': \" containing chloroquine phosphate after seeing Mr Trump's comments on TV.\"}, {'id': 18, 'start': 77.27999877929688, 'end': 79.5999984741211, 'text': ' He died and his wife is in hospital.'}, {'id': 19, 'start': 80.4800033569336, 'end': 84.72000122070312, 'text': ' Fact Check has a new newsletter to help you sort fact from fiction.'}, {'id': 20, 'start': 84.72000122070312, 'end': 88.87999725341797, 'text': ' To sign up to have Corona Check directly delivered to your inbox,'}, {'id': 21, 'start': 88.87999725341797, 'end': 90.23999786376953, 'text': ' go to the website.'}, {'id': 22, 'start': 90.23999786376953, 'end': 94.55999755859375, 'text': \" And if you've seen something you want checked, let us know.\"}]}"