"{'text': \"Radical pro-Palestine protesters are dealt with very differently under a Donald Trump presidency. Yes, the activists who took over Columbia University today to disrupt hard-working students at the start of finals week got an unwelcome surprise when, instead of being allowed to run riot through the university like they did under Joe Biden, were bundled up, held in a room by officials and not allowed to leave until they showed ID. The young protesters could be heard pleading with officials to be released. This online commentator was in hysterics over the situation, saying, The irony of the pro-Palestine jihadists getting locked in the very Butler Library at Columbia University on Wednesday that they forced their way in to vandalise. This is peak fafo. University officials were not letting anyone get away scot-free, tackling this protester to the ground and holding him until police arrived, which sent his activist friends into a meltdown. And the police action was swift, with New York City Mayor Eric Adams authorising the NYPD to enter Columbia University and arrest the disruptive protesters. And bad news for anyone protesting who are on visas or in the country illegally, with this commentator saying they will face the full force of the very tough new immigration law. Growing number of pro-Palestinian protesters are being arrested and escorted out of Columbia University in handcuffs. The State Department will revoke any visas they're on, and ICE will handle the arrests. This is no longer Biden's America. The arrests came after the activists took over the library, vandalising the fixtures and chanting Free Palestine. Universities are no stranger to these pro-Palestine protests, as they have been disrupting institutions since October 7th, 2023. But the way they are being dealt with under Trump is very different. This commentator said, Columbia University protests escalates. Police arrest demonstrators who barricaded library. Columbia would not have insisted on the protesters' arrest before President Trump. All we needed was a new president. And after years of lacklustre management from university officials, it seems Columbia's acting president is finally cracking down on the disruption, releasing a statement saying, These actions are outrageous. Disruption to our academic activities will not be tolerated and are violations of our rules and policies. This is especially unacceptable while our students study and prepare for final exams. Columbia strongly condemns violence on our campus, antisemitism and all forms of hate and discrimination. The swift action from Columbia comes as the Trump administration announced the freezing of $2.2 billion in government grants to Harvard after the Ivy League university rejected federal demands.\", 'segments': [{'id': 0, 'start': 0.0, 'end': 6.880000114440918, 'text': ' Radical pro-Palestine protesters are dealt with very differently under a Donald Trump presidency.'}, {'id': 1, 'start': 7.599999904632568, 'end': 13.600000381469727, 'text': ' Yes, the activists who took over Columbia University today to disrupt hard-working students'}, {'id': 2, 'start': 13.600000381469727, 'end': 20.0, 'text': ' at the start of finals week got an unwelcome surprise when, instead of being allowed to run'}, {'id': 3, 'start': 20.0, 'end': 26.31999969482422, 'text': ' riot through the university like they did under Joe Biden, were bundled up, held in a room by'}, {'id': 4, 'start': 26.31999969482422, 'end': 33.119998931884766, 'text': ' officials and not allowed to leave until they showed ID. The young protesters could be heard'}, {'id': 5, 'start': 33.119998931884766, 'end': 35.68000030517578, 'text': ' pleading with officials to be released.'}, {'id': 6, 'start': 56.31999969482422, 'end': 72.23999786376953, 'text': ' This online commentator was in hysterics over the situation, saying,'}, {'id': 7, 'start': 72.23999786376953, 'end': 77.76000213623047, 'text': ' The irony of the pro-Palestine jihadists getting locked in the very Butler Library'}, {'id': 8, 'start': 77.76000213623047, 'end': 83.19999694824219, 'text': ' at Columbia University on Wednesday that they forced their way in to vandalise.'}, {'id': 9, 'start': 83.19999694824219, 'end': 89.44000244140625, 'text': ' This is peak fafo. University officials were not letting anyone get away scot-free,'}, {'id': 10, 'start': 89.44000244140625, 'end': 92.55999755859375, 'text': ' tackling this protester to the ground and holding him'}, {'id': 11, 'start': 92.55999755859375, 'end': 97.36000061035156, 'text': ' until police arrived, which sent his activist friends into a meltdown.'}, {'id': 12, 'start': 113.19999694824219, 'end': 132.55999755859375, 'text': ' And the police action was swift, with New York City Mayor Eric Adams'}, {'id': 13, 'start': 132.55999755859375, 'end': 138.8800048828125, 'text': ' authorising the NYPD to enter Columbia University and arrest the disruptive protesters.'}, {'id': 14, 'start': 143.83999633789062, 'end': 155.1999969482422, 'text': ' And bad news for anyone protesting who are on visas or in the country illegally,'}, {'id': 15, 'start': 155.1999969482422, 'end': 161.1199951171875, 'text': ' with this commentator saying they will face the full force of the very tough new immigration law.'}, {'id': 16, 'start': 162.39999389648438, 'end': 168.32000732421875, 'text': ' Growing number of pro-Palestinian protesters are being arrested and escorted out of Columbia'}, {'id': 17, 'start': 168.32000732421875, 'end': 173.75999450683594, 'text': \" University in handcuffs. The State Department will revoke any visas they're on,\"}, {'id': 18, 'start': 173.75999450683594, 'end': 178.0, 'text': \" and ICE will handle the arrests. This is no longer Biden's America.\"}, {'id': 19, 'start': 178.8000030517578, 'end': 182.39999389648438, 'text': ' The arrests came after the activists took over the library,'}, {'id': 20, 'start': 182.39999389648438, 'end': 185.9199981689453, 'text': ' vandalising the fixtures and chanting Free Palestine.'}, {'id': 21, 'start': 191.83999633789062, 'end': 195.67999267578125, 'text': ' Universities are no stranger to these pro-Palestine protests,'}, {'id': 22, 'start': 195.67999267578125, 'end': 200.16000366210938, 'text': ' as they have been disrupting institutions since October 7th, 2023.'}, {'id': 23, 'start': 200.8800048828125, 'end': 204.24000549316406, 'text': ' But the way they are being dealt with under Trump is very different.'}, {'id': 24, 'start': 204.8000030517578, 'end': 206.24000549316406, 'text': ' This commentator said,'}, {'id': 25, 'start': 206.24000549316406, 'end': 212.32000732421875, 'text': ' Columbia University protests escalates. Police arrest demonstrators who barricaded library.'}, {'id': 26, 'start': 212.32000732421875, 'end': 217.1999969482422, 'text': \" Columbia would not have insisted on the protesters' arrest before President Trump.\"}, {'id': 27, 'start': 217.1999969482422, 'end': 219.1999969482422, 'text': ' All we needed was a new president.'}, {'id': 28, 'start': 220.0, 'end': 224.0, 'text': ' And after years of lacklustre management from university officials,'}, {'id': 29, 'start': 224.0, 'end': 229.44000244140625, 'text': \" it seems Columbia's acting president is finally cracking down on the disruption,\"}, {'id': 30, 'start': 229.44000244140625, 'end': 231.44000244140625, 'text': ' releasing a statement saying,'}, {'id': 31, 'start': 231.44000244140625, 'end': 237.27999877929688, 'text': ' These actions are outrageous. Disruption to our academic activities will not be tolerated'}, {'id': 32, 'start': 237.27999877929688, 'end': 243.1199951171875, 'text': ' and are violations of our rules and policies. This is especially unacceptable while our students'}, {'id': 33, 'start': 243.1199951171875, 'end': 249.27999877929688, 'text': ' study and prepare for final exams. Columbia strongly condemns violence on our campus,'}, {'id': 34, 'start': 249.27999877929688, 'end': 252.55999755859375, 'text': ' antisemitism and all forms of hate and discrimination.'}, {'id': 35, 'start': 253.52000427246094, 'end': 257.3599853515625, 'text': ' The swift action from Columbia comes as the Trump administration'}, {'id': 36, 'start': 257.3599853515625, 'end': 262.55999755859375, 'text': ' announced the freezing of $2.2 billion in government grants to Harvard'}, {'id': 37, 'start': 262.55999755859375, 'end': 266.3999938964844, 'text': ' after the Ivy League university rejected federal demands.'}]}"