"{'text': \"From Vatican City to Texas, this is the Wilcain Show. History is made as the first ever American is chosen as the new Pope of the Catholic Church. Cardinal Robert Prevost is now Pope Leo XIV. He's 69 years old, from Chicago, and a graduate of Villanova University. This was the scene in Vatican City as he addressed the crowd for the first time as Pope. God loves everyone. Evil will not prevail. We are all in the hands of God. So without fear, united, hand in hand, with God and among ourselves, we go forward. And reaction from his home city of Chicago in just the last hour. Pope Leo XIV is going to serve with great, obviously, great faith. He's a very humble, a very kind person, and someone who really does look to the Lord for guidance in all that he does. He's a very prayerful and spiritual man, and he's going to take that sense of God's love and do all that he can to care for all of God's children. Here now is what we know about Pope Leo XIV and where he stands on some key issues in the church. He's been against ordaining female deacons. He has been somewhat ambiguous on blessing same-sex couples. He's been in favor of making the church structure more inclusive and participatory. He supported Pope Francis' change in allowing divorced and civilly remarried Catholics to receive communion. Let's bring in now Fox News contributor Raymond Arroyo. He's covered three conclaves and joins us now from Rome. Raymond, I'm glad and honored to have you on the program today. You know a great amount about the Catholic Church, and I think everybody is interested today in hearing your reaction to Pope Leo XIV. Well, I was there in St. Peter's Square, and look, it takes your breath away whenever a new pope comes out. We have to remember, this is the 267th successor of the apostle Peter, the one that Jesus gave the keys to the kingdom of heaven to. So that's what this is all about. When you look at the man himself, Robert Privost, now Leo XIV, you have to step back, because the one caveat I'm going to add to everything I'm about to say, Will, is this. When a man begins to assume this office of the papacy, it inevitably changes him. There's something that happens to the personality, even the teaching of the man. So we can't say that the man that he was will necessarily be the pope that he'll be tomorrow. But here are the general outlines. You know he's from Chicago. He's known as more of a progressive in the church. If you liked Pope Francis, you're going to love Leo XIV. That would be my bumper sticker on this, OK? He's very much in the same model. Even in his speech there at the Loggia today, he said we have to be a synodal church to go out and encounter and dialogue with each other in the world, that we have to walk with one another. That is classic Pope Francis lingo. And I'll tell you what it means, because who knows what synodal means. They don't even know. The bishops don't even know. What it basically means is to democratize and open up the decision-making in the church, even the practice and the doctrine of the faith. Pope Francis believed not just bringing cardinals together to help him shape the teaching or perfect it for the time, but inviting everybody in, including atheists and nonbelievers and young people and, you know, a selected handgroup of priests he liked and a few other cardinals, but not the entire College of Cardinals. And part of the result of this particular pope will is because Pope Francis chose 108 of the 133 electors. So you imagined it might tend this way, even though you thought, well, they're from such far-flung parts of the world, they may not be ideologically coherent. But it turns out they may have been. One of the major things, I've spoken to a couple of cardinals since the election, money was a big issue, Will. The church is basically broke. The Wall Street Journal did a piece the other day, $2 billion in deficits, $400 million in pension debts that they can't pay off. So a lot of these African cardinals and Asian cardinals and those from other parts of the world thought, get an American in here. They can help clean up and get the books in order, make the trains run on time. This guy's been working here for three years in the Vatican. He's head of the Bishop's Dicastery, Robert Prevost, now Pope Leo. So he knows a bit of the machinations here, but he's a little bit of an outsider. So they thought maybe he can help reform the place and at least bring it to financial solvency. That's a piece of it. But there's a much bigger challenge for this Pope, Will, and that is to clarify Christian and Catholic doctrine, to make it clear. Pope Francis muddied the waters in many, many ways and caused a lot of confusion. One hopes Pope Leo will steady this bark of Peter and the church itself. So let me ask you this question, Raymond, based upon that important part of the papacy. And I ask this with a great amount of humility, Raymond, because I am not Catholic. And I understand that the Pope is selected and ordained by God and it is not a political office. It's not the same thing as electing a United States Senator. So in some ways it's inappropriate to say, is he conservative? Is he liberal? But is he progressive in the vein of Pope Francis? That seems to be the great question. And I hear you saying the answer is yes. And why that matters is where he may stand and where he may lead his flock on issues as far and as wide as climate change, on DEI, on LGBTQ, on a whole host of issues. And we wonder where will this new vision be for the Catholic church? Well, hope springs eternal, Will, even in the eternal city. And here's what I'd say. It's a mixed bag. The record is a mixed bag. But there are indications when you saw the Pope come out today, okay, he was wearing the traditional mozzetto, that red garment, you know, atop his white cassock. That is a, that's kind of a cry back to the past. That's a wink at tradition. So a lot of traditionalists and conservative people said, oh, look, he's dressing like a Pope. We frankly haven't seen this in 12 years with Pope Francis. So maybe Leo will be, as he mentioned in his speech today, a bridge builder. One hopes, I mean, when you look at his Twitter feed, you know, he was for open borders in the United States and kind of took pot shots at J.D. Vance and the Trump administration. But look, all Popes are going to support migrants, support the poor, support peace. That is, their heart goes out to humanity. That's with the job. I don't, Jesus would do the same. I don't know if he'd get so political and that they're going to have to be careful of. But maybe Pope Leo can bring together the broken parts of this church and Christianity in our society and offer a countercultural moral clarion call that I think we need now. Let's pray and hope that's what becomes of this pontificate. And all these other concerns fade away in the coming days. I hope that's what I'm going to roll. I'm glad to have you today. Live from Rome. Thank you, Raymond. Thank you, my friend. Hey, Sean Hannity here. Hey, click here to subscribe to Fox News YouTube page and catch our hottest interviews and most compelling analysis. You will not get it anywhere else. Thanks for watching. We'll see you next time. \", 'segments': [{'id': 0, 'start': 30.0, 'end': 49.619998931884766, 'text': ' From Vatican City to Texas, this is the Wilcain Show.'}, {'id': 1, 'start': 49.619998931884766, 'end': 54.7599983215332, 'text': ' History is made as the first ever American is chosen as the new Pope of the Catholic'}, {'id': 2, 'start': 54.7599983215332, 'end': 55.7599983215332, 'text': ' Church.'}, {'id': 3, 'start': 55.7599983215332, 'end': 59.7599983215332, 'text': ' Cardinal Robert Prevost is now Pope Leo XIV.'}, {'id': 4, 'start': 59.7599983215332, 'end': 64.23999786376953, 'text': \" He's 69 years old, from Chicago, and a graduate of Villanova University.\"}, {'id': 5, 'start': 64.23999786376953, 'end': 68.91999816894531, 'text': ' This was the scene in Vatican City as he addressed the crowd for the first time as Pope.'}, {'id': 6, 'start': 68.91999816894531, 'end': 75.5999984741211, 'text': ' God loves everyone.'}, {'id': 7, 'start': 75.5999984741211, 'end': 78.5999984741211, 'text': ' Evil will not prevail.'}, {'id': 8, 'start': 78.5999984741211, 'end': 83.91999816894531, 'text': ' We are all in the hands of God.'}, {'id': 9, 'start': 83.91999816894531, 'end': 93.80000305175781, 'text': ' So without fear, united, hand in hand, with God and among ourselves, we go forward.'}, {'id': 10, 'start': 93.80000305175781, 'end': 98.19999694824219, 'text': ' And reaction from his home city of Chicago in just the last hour.'}, {'id': 11, 'start': 98.19999694824219, 'end': 103.72000122070312, 'text': ' Pope Leo XIV is going to serve with great, obviously, great faith.'}, {'id': 12, 'start': 103.72000122070312, 'end': 110.4800033569336, 'text': \" He's a very humble, a very kind person, and someone who really does look to the Lord for\"}, {'id': 13, 'start': 110.4800033569336, 'end': 112.12000274658203, 'text': ' guidance in all that he does.'}, {'id': 14, 'start': 112.12000274658203, 'end': 116.91999816894531, 'text': \" He's a very prayerful and spiritual man, and he's going to take that sense of God's\"}, {'id': 15, 'start': 116.91999816894531, 'end': 123.41999816894531, 'text': \" love and do all that he can to care for all of God's children.\"}, {'id': 16, 'start': 123.41999816894531, 'end': 128.1199951171875, 'text': ' Here now is what we know about Pope Leo XIV and where he stands on some key issues in'}, {'id': 17, 'start': 128.1199951171875, 'end': 129.16000366210938, 'text': ' the church.'}, {'id': 18, 'start': 129.16000366210938, 'end': 132.0800018310547, 'text': \" He's been against ordaining female deacons.\"}, {'id': 19, 'start': 132.0800018310547, 'end': 135.1999969482422, 'text': ' He has been somewhat ambiguous on blessing same-sex couples.'}, {'id': 20, 'start': 135.1999969482422, 'end': 140.3000030517578, 'text': \" He's been in favor of making the church structure more inclusive and participatory.\"}, {'id': 21, 'start': 140.3000030517578, 'end': 145.44000244140625, 'text': \" He supported Pope Francis' change in allowing divorced and civilly remarried Catholics to\"}, {'id': 22, 'start': 145.44000244140625, 'end': 147.13999938964844, 'text': ' receive communion.'}, {'id': 23, 'start': 147.13999938964844, 'end': 149.77999877929688, 'text': \" Let's bring in now Fox News contributor Raymond Arroyo.\"}, {'id': 24, 'start': 149.77999877929688, 'end': 153.22000122070312, 'text': \" He's covered three conclaves and joins us now from Rome.\"}, {'id': 25, 'start': 153.22000122070312, 'end': 156.6999969482422, 'text': \" Raymond, I'm glad and honored to have you on the program today.\"}, {'id': 26, 'start': 156.6999969482422, 'end': 160.6999969482422, 'text': ' You know a great amount about the Catholic Church, and I think everybody is interested'}, {'id': 27, 'start': 160.6999969482422, 'end': 164.5800018310547, 'text': ' today in hearing your reaction to Pope Leo XIV.'}, {'id': 28, 'start': 164.5800018310547, 'end': 169.25999450683594, 'text': \" Well, I was there in St. Peter's Square, and look, it takes your breath away whenever a\"}, {'id': 29, 'start': 169.25999450683594, 'end': 170.5, 'text': ' new pope comes out.'}, {'id': 30, 'start': 170.5, 'end': 178.86000061035156, 'text': ' We have to remember, this is the 267th successor of the apostle Peter, the one that Jesus gave'}, {'id': 31, 'start': 178.86000061035156, 'end': 181.4600067138672, 'text': ' the keys to the kingdom of heaven to.'}, {'id': 32, 'start': 181.4600067138672, 'end': 183.25999450683594, 'text': \" So that's what this is all about.\"}, {'id': 33, 'start': 183.25999450683594, 'end': 189.97999572753906, 'text': ' When you look at the man himself, Robert Privost, now Leo XIV, you have to step back, because'}, {'id': 34, 'start': 189.97999572753906, 'end': 195.6199951171875, 'text': \" the one caveat I'm going to add to everything I'm about to say, Will, is this.\"}, {'id': 35, 'start': 195.6199951171875, 'end': 202.3800048828125, 'text': ' When a man begins to assume this office of the papacy, it inevitably changes him.'}, {'id': 36, 'start': 202.3800048828125, 'end': 206.33999633789062, 'text': \" There's something that happens to the personality, even the teaching of the man.\"}, {'id': 37, 'start': 206.33999633789062, 'end': 212.36000061035156, 'text': \" So we can't say that the man that he was will necessarily be the pope that he'll be tomorrow.\"}, {'id': 38, 'start': 212.36000061035156, 'end': 214.3000030517578, 'text': ' But here are the general outlines.'}, {'id': 39, 'start': 214.3000030517578, 'end': 215.97999572753906, 'text': \" You know he's from Chicago.\"}, {'id': 40, 'start': 215.97999572753906, 'end': 219.13999938964844, 'text': \" He's known as more of a progressive in the church.\"}, {'id': 41, 'start': 219.13999938964844, 'end': 222.82000732421875, 'text': \" If you liked Pope Francis, you're going to love Leo XIV.\"}, {'id': 42, 'start': 222.82000732421875, 'end': 226.05999755859375, 'text': ' That would be my bumper sticker on this, OK?'}, {'id': 43, 'start': 226.05999755859375, 'end': 228.02000427246094, 'text': \" He's very much in the same model.\"}, {'id': 44, 'start': 228.02000427246094, 'end': 232.5, 'text': ' Even in his speech there at the Loggia today, he said we have to be a synodal church to'}, {'id': 45, 'start': 232.5, 'end': 237.0800018310547, 'text': ' go out and encounter and dialogue with each other in the world, that we have to walk with'}, {'id': 46, 'start': 237.0800018310547, 'end': 238.0800018310547, 'text': ' one another.'}, {'id': 47, 'start': 238.0800018310547, 'end': 240.82000732421875, 'text': ' That is classic Pope Francis lingo.'}, {'id': 48, 'start': 240.82000732421875, 'end': 243.13999938964844, 'text': \" And I'll tell you what it means, because who knows what synodal means.\"}, {'id': 49, 'start': 243.13999938964844, 'end': 244.13999938964844, 'text': \" They don't even know.\"}, {'id': 50, 'start': 244.13999938964844, 'end': 245.47999572753906, 'text': \" The bishops don't even know.\"}, {'id': 51, 'start': 245.47999572753906, 'end': 250.66000366210938, 'text': ' What it basically means is to democratize and open up the decision-making in the church,'}, {'id': 52, 'start': 250.66000366210938, 'end': 254.4600067138672, 'text': ' even the practice and the doctrine of the faith.'}, {'id': 53, 'start': 254.4600067138672, 'end': 259.44000244140625, 'text': ' Pope Francis believed not just bringing cardinals together to help him shape the teaching or'}, {'id': 54, 'start': 259.44000244140625, 'end': 265.2200012207031, 'text': ' perfect it for the time, but inviting everybody in, including atheists and nonbelievers and'}, {'id': 55, 'start': 265.2200012207031, 'end': 270.4599914550781, 'text': ' young people and, you know, a selected handgroup of priests he liked and a few other cardinals,'}, {'id': 56, 'start': 270.4599914550781, 'end': 272.739990234375, 'text': ' but not the entire College of Cardinals.'}, {'id': 57, 'start': 272.739990234375, 'end': 278.5400085449219, 'text': ' And part of the result of this particular pope will is because Pope Francis chose 108'}, {'id': 58, 'start': 278.5400085449219, 'end': 280.70001220703125, 'text': ' of the 133 electors.'}, {'id': 59, 'start': 280.70001220703125, 'end': 285.2799987792969, 'text': \" So you imagined it might tend this way, even though you thought, well, they're from such\"}, {'id': 60, 'start': 285.2799987792969, 'end': 289.6600036621094, 'text': ' far-flung parts of the world, they may not be ideologically coherent.'}, {'id': 61, 'start': 289.6600036621094, 'end': 291.82000732421875, 'text': ' But it turns out they may have been.'}, {'id': 62, 'start': 291.82000732421875, 'end': 295.1400146484375, 'text': \" One of the major things, I've spoken to a couple of cardinals since the election, money\"}, {'id': 63, 'start': 295.1400146484375, 'end': 297.4599914550781, 'text': ' was a big issue, Will.'}, {'id': 64, 'start': 297.4599914550781, 'end': 299.0199890136719, 'text': ' The church is basically broke.'}, {'id': 65, 'start': 299.0199890136719, 'end': 306.739990234375, 'text': ' The Wall Street Journal did a piece the other day, $2 billion in deficits, $400 million'}, {'id': 66, 'start': 306.739990234375, 'end': 309.5799865722656, 'text': \" in pension debts that they can't pay off.\"}, {'id': 67, 'start': 309.5799865722656, 'end': 315.3800048828125, 'text': ' So a lot of these African cardinals and Asian cardinals and those from other parts of the'}, {'id': 68, 'start': 315.3800048828125, 'end': 317.94000244140625, 'text': ' world thought, get an American in here.'}, {'id': 69, 'start': 317.94000244140625, 'end': 322.5, 'text': ' They can help clean up and get the books in order, make the trains run on time.'}, {'id': 70, 'start': 322.5, 'end': 325.05999755859375, 'text': \" This guy's been working here for three years in the Vatican.\"}, {'id': 71, 'start': 325.05999755859375, 'end': 330.3800048828125, 'text': \" He's head of the Bishop's Dicastery, Robert Prevost, now Pope Leo.\"}, {'id': 72, 'start': 330.3800048828125, 'end': 335.760009765625, 'text': \" So he knows a bit of the machinations here, but he's a little bit of an outsider.\"}, {'id': 73, 'start': 335.7799987792969, 'end': 340.67999267578125, 'text': ' So they thought maybe he can help reform the place and at least bring it to financial solvency.'}, {'id': 74, 'start': 340.67999267578125, 'end': 341.67999267578125, 'text': \" That's a piece of it.\"}, {'id': 75, 'start': 341.67999267578125, 'end': 346.1199951171875, 'text': \" But there's a much bigger challenge for this Pope, Will, and that is to clarify Christian\"}, {'id': 76, 'start': 346.1199951171875, 'end': 349.1600036621094, 'text': ' and Catholic doctrine, to make it clear.'}, {'id': 77, 'start': 349.1600036621094, 'end': 353.6199951171875, 'text': ' Pope Francis muddied the waters in many, many ways and caused a lot of confusion.'}, {'id': 78, 'start': 353.6199951171875, 'end': 357.1199951171875, 'text': ' One hopes Pope Leo will steady this bark of Peter and the church itself.'}, {'id': 79, 'start': 357.1199951171875, 'end': 362.32000732421875, 'text': ' So let me ask you this question, Raymond, based upon that important part of the papacy.'}, {'id': 80, 'start': 362.32000732421875, 'end': 365.9200134277344, 'text': ' And I ask this with a great amount of humility, Raymond, because I am not Catholic.'}, {'id': 81, 'start': 365.9200134277344, 'end': 371.3999938964844, 'text': ' And I understand that the Pope is selected and ordained by God and it is not a political'}, {'id': 82, 'start': 371.3999938964844, 'end': 372.3999938964844, 'text': ' office.'}, {'id': 83, 'start': 372.3999938964844, 'end': 374.94000244140625, 'text': \" It's not the same thing as electing a United States Senator.\"}, {'id': 84, 'start': 374.94000244140625, 'end': 377.6400146484375, 'text': \" So in some ways it's inappropriate to say, is he conservative?\"}, {'id': 85, 'start': 377.6400146484375, 'end': 379.0199890136719, 'text': ' Is he liberal?'}, {'id': 86, 'start': 379.0199890136719, 'end': 382.260009765625, 'text': ' But is he progressive in the vein of Pope Francis?'}, {'id': 87, 'start': 382.260009765625, 'end': 383.260009765625, 'text': ' That seems to be the great question.'}, {'id': 88, 'start': 383.260009765625, 'end': 385.6000061035156, 'text': ' And I hear you saying the answer is yes.'}, {'id': 89, 'start': 385.6000061035156, 'end': 389.4200134277344, 'text': ' And why that matters is where he may stand and where he may lead his flock on issues'}, {'id': 90, 'start': 389.4200134277344, 'end': 397.4800109863281, 'text': ' as far and as wide as climate change, on DEI, on LGBTQ, on a whole host of issues.'}, {'id': 91, 'start': 397.4800109863281, 'end': 402.2200012207031, 'text': ' And we wonder where will this new vision be for the Catholic church?'}, {'id': 92, 'start': 402.2200012207031, 'end': 407.0199890136719, 'text': ' Well, hope springs eternal, Will, even in the eternal city.'}, {'id': 93, 'start': 407.0199890136719, 'end': 408.739990234375, 'text': \" And here's what I'd say.\"}, {'id': 94, 'start': 408.739990234375, 'end': 409.739990234375, 'text': \" It's a mixed bag.\"}, {'id': 95, 'start': 409.739990234375, 'end': 411.29998779296875, 'text': ' The record is a mixed bag.'}, {'id': 96, 'start': 411.29998779296875, 'end': 415.82000732421875, 'text': ' But there are indications when you saw the Pope come out today, okay, he was wearing'}, {'id': 97, 'start': 415.82000732421875, 'end': 421.70001220703125, 'text': ' the traditional mozzetto, that red garment, you know, atop his white cassock.'}, {'id': 98, 'start': 421.70001220703125, 'end': 424.7799987792969, 'text': \" That is a, that's kind of a cry back to the past.\"}, {'id': 99, 'start': 424.7799987792969, 'end': 426.5, 'text': \" That's a wink at tradition.\"}, {'id': 100, 'start': 426.5, 'end': 430.5400085449219, 'text': \" So a lot of traditionalists and conservative people said, oh, look, he's dressing like\"}, {'id': 101, 'start': 430.5400085449219, 'end': 431.5400085449219, 'text': ' a Pope.'}, {'id': 102, 'start': 431.5400085449219, 'end': 434.5400085449219, 'text': \" We frankly haven't seen this in 12 years with Pope Francis.\"}, {'id': 103, 'start': 434.5400085449219, 'end': 439.260009765625, 'text': ' So maybe Leo will be, as he mentioned in his speech today, a bridge builder.'}, {'id': 104, 'start': 439.260009765625, 'end': 443.6600036621094, 'text': ' One hopes, I mean, when you look at his Twitter feed, you know, he was for open borders in'}, {'id': 105, 'start': 443.6600036621094, 'end': 447.8599853515625, 'text': ' the United States and kind of took pot shots at J.D. Vance and the Trump administration.'}, {'id': 106, 'start': 447.8599853515625, 'end': 452.94000244140625, 'text': ' But look, all Popes are going to support migrants, support the poor, support peace.'}, {'id': 107, 'start': 452.94000244140625, 'end': 455.6199951171875, 'text': ' That is, their heart goes out to humanity.'}, {'id': 108, 'start': 455.6199951171875, 'end': 456.6199951171875, 'text': \" That's with the job.\"}, {'id': 109, 'start': 456.6199951171875, 'end': 458.4800109863281, 'text': \" I don't, Jesus would do the same.\"}, {'id': 110, 'start': 458.4800109863281, 'end': 462.20001220703125, 'text': \" I don't know if he'd get so political and that they're going to have to be careful of.\"}, {'id': 111, 'start': 462.20001220703125, 'end': 469.1000061035156, 'text': ' But maybe Pope Leo can bring together the broken parts of this church and Christianity'}, {'id': 112, 'start': 469.1000061035156, 'end': 476.3800048828125, 'text': ' in our society and offer a countercultural moral clarion call that I think we need now.'}, {'id': 113, 'start': 476.3800048828125, 'end': 479.5, 'text': \" Let's pray and hope that's what becomes of this pontificate.\"}, {'id': 114, 'start': 479.5, 'end': 482.3800048828125, 'text': ' And all these other concerns fade away in the coming days.'}, {'id': 115, 'start': 482.3800048828125, 'end': 483.9800109863281, 'text': \" I hope that's what I'm going to roll.\"}, {'id': 116, 'start': 483.9800109863281, 'end': 485.2200012207031, 'text': \" I'm glad to have you today.\"}, {'id': 117, 'start': 485.2200012207031, 'end': 486.2200012207031, 'text': ' Live from Rome.'}, {'id': 118, 'start': 486.2200012207031, 'end': 487.4200134277344, 'text': ' Thank you, Raymond.'}, {'id': 119, 'start': 487.4200134277344, 'end': 488.4200134277344, 'text': ' Thank you, my friend.'}, {'id': 120, 'start': 488.4200134277344, 'end': 489.4200134277344, 'text': ' Hey, Sean Hannity here.'}, {'id': 121, 'start': 489.4200134277344, 'end': 494.8999938964844, 'text': ' Hey, click here to subscribe to Fox News YouTube page and catch our hottest interviews and'}, {'id': 122, 'start': 494.8999938964844, 'end': 496.79998779296875, 'text': ' most compelling analysis.'}, {'id': 123, 'start': 496.79998779296875, 'end': 498.94000244140625, 'text': ' You will not get it anywhere else.'}, {'id': 124, 'start': 499.1000061035156, 'end': 500.1000061035156, 'text': ' Thanks for watching.'}, {'id': 125, 'start': 500.1000061035156, 'end': 501.1000061035156, 'text': \" We'll see you next time.\"}, {'id': 126, 'start': 501.1000061035156, 'end': 501.1000061035156, 'text': ''}]}"