"{'text': \"I am sick of all you round-earth believers saying that the earth is not flat. I'm Schminney, part of the Flat Earth Society, and I'm going to tell you why the earth is flat. First, someone told me that if the earth was flat then gravity would be way stronger. I'm going to tell you right now. Gravity is not a thing. Let's just take gravity and throw it out. Let's just take gravity and throw it out the door. Gravity not a thing. Gravity does not exist in the Flat Earth Society. Gravity is not a thing, okay? Second of all, how we all keep together, there is a huge wall of ice around the earth. It's flat. There's a huge wall of ice around the earth. Second, people who think that they've traveled around the world are just going under Antarctica, around Antarctica, sorry, and the Sun goes like from the top of the world to under Antarctica, and then it's the same with the moon, and then they come back up when it's time. Okay, so all you people trying to tell me that the earth is not flat can go just die because you are contributing to Illuminati theories. Yes, okay, the flat earth is like we kind of believe that the Illuminati is like kind of trying to make us believe that the earth is round. Faking satellite images, they're very easy to fake. What else? Faking trips to space, and just stuff like that. You're contributing in that, like Satanism, sin, lies, lying is sin. Yes, I mean to tell you that lying is a sin, and also the earth is flat because if we have airplanes going around the earth, they're just going to go off the earth and fall. That's a thing. If the earth is not flat, this is what would happen. Here's the circle of the earth. Airplane falls because it came off the edge. Okay, so thank you. The earth is flat. It's very passionate. I'm very passionate about this.\", 'segments': [{'id': 0, 'start': 0.0, 'end': 7.920000076293945, 'text': ' I am sick of all you round-earth believers saying that the earth is not'}, {'id': 1, 'start': 7.920000076293945, 'end': 14.15999984741211, 'text': \" flat. I'm Schminney, part of the Flat Earth Society, and I'm going to tell you why the\"}, {'id': 2, 'start': 14.15999984741211, 'end': 20.040000915527344, 'text': ' earth is flat. First, someone told me that if the earth was flat then gravity would'}, {'id': 3, 'start': 20.040000915527344, 'end': 24.520000457763672, 'text': \" be way stronger. I'm going to tell you right now. Gravity is not a thing. Let's\"}, {'id': 4, 'start': 24.520000457763672, 'end': 29.399999618530273, 'text': \" just take gravity and throw it out. Let's just take gravity and throw it out the\"}, {'id': 5, 'start': 29.399999618530273, 'end': 34.959999084472656, 'text': ' door. Gravity not a thing. Gravity does not exist in the Flat Earth Society.'}, {'id': 6, 'start': 34.959999084472656, 'end': 41.439998626708984, 'text': ' Gravity is not a thing, okay? Second of all, how we all keep together, there is a'}, {'id': 7, 'start': 41.439998626708984, 'end': 47.720001220703125, 'text': \" huge wall of ice around the earth. It's flat. There's a huge wall of ice around the earth.\"}, {'id': 8, 'start': 47.720001220703125, 'end': 52.47999954223633, 'text': \" Second, people who think that they've traveled around the world are just going\"}, {'id': 9, 'start': 52.47999954223633, 'end': 64.12000274658203, 'text': ' under Antarctica, around Antarctica, sorry, and the Sun goes like from the top of the'}, {'id': 10, 'start': 64.12000274658203, 'end': 68.55999755859375, 'text': \" world to under Antarctica, and then it's the same with the moon, and then they\"}, {'id': 11, 'start': 68.55999755859375, 'end': 74.27999877929688, 'text': \" come back up when it's time. Okay, so all you people trying to tell me that the\"}, {'id': 12, 'start': 74.27999877929688, 'end': 82.87999725341797, 'text': ' earth is not flat can go just die because you are contributing to'}, {'id': 13, 'start': 82.87999725341797, 'end': 90.63999938964844, 'text': ' Illuminati theories. Yes, okay, the flat earth is like we kind of believe that'}, {'id': 14, 'start': 90.63999938964844, 'end': 95.80000305175781, 'text': ' the Illuminati is like kind of trying to make us believe that the earth is round.'}, {'id': 15, 'start': 95.80000305175781, 'end': 104.87999725341797, 'text': \" Faking satellite images, they're very easy to fake. What else? Faking trips to\"}, {'id': 16, 'start': 104.87999725341797, 'end': 113.76000213623047, 'text': \" space, and just stuff like that. You're contributing in that, like Satanism, sin,\"}, {'id': 17, 'start': 113.76000213623047, 'end': 122.95999908447266, 'text': ' lies, lying is sin. Yes, I mean to tell you that lying is a sin, and also the'}, {'id': 18, 'start': 122.95999908447266, 'end': 128.60000610351562, 'text': \" earth is flat because if we have airplanes going around the earth, they're\"}, {'id': 19, 'start': 128.60000610351562, 'end': 134.44000244140625, 'text': \" just going to go off the earth and fall. That's a thing. If the earth is not flat,\"}, {'id': 20, 'start': 134.44000244140625, 'end': 140.24000549316406, 'text': \" this is what would happen. Here's the circle of the earth. Airplane falls\"}, {'id': 21, 'start': 140.24000549316406, 'end': 147.52000427246094, 'text': \" because it came off the edge. Okay, so thank you. The earth is flat. It's very\"}, {'id': 22, 'start': 147.52000427246094, 'end': 151.9199981689453, 'text': \" passionate. I'm very passionate about this.\"}]}"