"{'text': \"Welcome to the Times of Israel's daily briefing. Today is Thursday, May 8th, day 580 of the war. I'm Amanda Borchell-Dahn here with our military reporter, Emanuel Fabian. Hi, Manny. Thanks for joining me this kind of early morning. Hi, Amanda. As Israel gears up to implement Plan B of a plan to defeat Hamas, according to IDF Chief of Staff Eyal Zamir, yesterday, several Israeli airstrikes in Gaza killed dozens of Palestinians, according to Hamas authorities. We'll hear more about these strikes, including one on a school, and Manny will also update us on what is happening in general in the Gaza war. We'll also hear about a Hamas commander who was killed in Lebanon. Who was this man? And we'll learn about attacks on three Israeli soldiers in the West Bank yesterday. In the second half of our program, we're going to discuss the IDF manpower needs and maybe find a solution through women power. All of this and much, much more when we're back. According to the Hamas Health Ministry, two IDF strikes early Wednesday hit the Karama School in Tufach, which is a suburb of Gaza City, killing some 15. Later in the day, other airstrikes near a market in Gaza City killed at least 33 people. This is, of course, according to Hamas authority figures. Also on Wednesday, a Golani Brigade soldier was wounded during a mission. So before we turn to the status of fighting in Gaza, Manny, what are we hearing about these strikes, especially the one on a school yesterday from the IDF at this point? As of recording, we haven't seen an IDF comment. They said they were looking into the strike. So we don't really know what the army was trying to target there or maybe if this was a mistake that they bombed this area. But I will sort of note that during the war, Israel's targeted dozens of former schools in Gaza where civilians have been sheltering, claiming and in some cases proving that Hamas was using those facilities for terror purposes, for planning attacks against Israel or for launching attacks on troops or just to hold. I mean, I think even some former hostages said they were held in humanitarian shelters areas. So we do know that Hamas uses those sites and Israel has bombed them many, many times before. But in this case, we still don't know exactly who was targeted yet. Maybe the army's waiting for further details or that this was some sort of mistake. But we will, of course, update when we know when we hear something from the Israeli side. Right. In general, it's very difficult to report on these matters. Obviously, we don't have a man in Gaza checking out what happened on the scene. And we do rely upon the IDF information. And as you said so carefully, diplomatically, actually, they often prove or sometimes prove that Hamas operatives were also in the area for these strikes. But it is a difficult matter. And as you said, please check out our live blog for more updates. So Manny, of course, we're hearing about a huge call up to go into Gaza. And of course, we saw this week reservists arriving. There was a huge line of reservist cars arriving at their staging area, I think you call it, to get ready to essentially go into Gaza as far as we understand. And yesterday, we're hearing from Eyal Zamir, the new IDF Chief of Staff, that Israel is moving into this Plan B to defeat Hamas. What does that mean to you? Is this now the big operation? Or are we still in almost an operation? We're in the sort of preparation phase of this operation. We've heard from officials that if by May 16, by the time Trump ends his visits to the region, Israel will, and there's no hostage deal with Hamas, that Israel will launch this operation in Gaza, this very major operation. We are seeing the troops, like you said, reaching their staging grounds in southern Israel. Tens of thousands of reservists are being called up. The battle plans are being approved. What you mentioned with Zamir yesterday, he was speaking to all the brigade commanders and division commanders and presenting them with the plan and sort of detailing what's going to happen, basically briefing them ahead of the operation. We also saw that the Defense Minister Katz held an assessment with top IDF officials as well with the division commanders to go over the plans and to be presented with them to approve certain things. The plans have all been approved, but we're talking about the more tactical elements of the plan now. But Israel is very much gearing up to launch this operation within the coming weeks. Okay, and the IDF is, of course, hunting down Hamas operatives throughout the region, if not the world. And yesterday, we heard about airstrikes in Lebanon that took out Khaled Ahmed al-Ahmed. So what was he responsible for? The army says that this Hamas member was the chief of operations in the terror group's western sector in southern Lebanon. Important to note that Hamas does have quite a significant presence in Lebanon. It's allied with Hezbollah. And during the war, Israel's targeted many Hamas operatives in Lebanon. Hamas has also carried out rocket attacks from Lebanon on Israel during the war, suspected even that the recent rocket fire that we saw from Lebanon in the past couple months were actually carried out by Hamas or other Palestinian groups and not Hezbollah themselves. But he's not the first chief of operations, I think, that Israel's killed in Lebanon, for Hamas that is. There was also another strike a day earlier that killed a Hezbollah commander, Adnan Harb, who the army said was head of logistics in one of the terror group's regional divisions. And the army says that he was working to sort of restore Hezbollah's capabilities, restore its infrastructure in the area of southern Lebanon, which is, of course, a violation of the ceasefire agreement. But we are seeing in general in Lebanon, the Lebanese army step up, dismantling more and more Hezbollah infrastructure. There's been daily strikes still against Hezbollah members, but it's definitely, I think, we're getting to a point where the Lebanese army is taking much more control over certain areas in the south of the country. I think it can't be overemphasized what you just said as a throwaway line, that there are still daily strikes in southern Lebanon. And so obviously, Israel is still, even though there is a ceasefire, is still very active on the northern border, both in Lebanon and in Syria, as we've discussed earlier. Now, let's turn to the West Bank. And during parts of this war, most of the IDF soldiers, according to what you've told me in previous podcasts, have been stationed in the West Bank. And I wonder if that is still the case. But first, tell us about two incidents yesterday in which three soldiers were attacked in the West Bank. These two attacks really took place within moments of each other, completely different areas. So in the northern West Bank, near the Rayhan checkpoint, it's sort of on the western side of the sort of the north of the West Bank, sort of across from Jenin, that area. Two soldiers who were in the area, not at the checkpoint itself, but kind of near the checkpoint, in a vehicle, they came under fire by a Palestinian gunman, wounding two of them seriously. These two soldiers and the attacker have fled the area. We've heard from the army this morning, as we're recording, that a suspect was detained in one of the nearby villages, still investigating if he actually was the shooter, but he is suspected to be the shooter. So we'll update, of course, when that's confirmed. And then very shortly after this shooting attack in the southern West Bank, near Hebron, a Palestinian rounds his car into a junction where IDF troops are stationed. He got out of his car and then stabbed one of the soldiers before he was shot. So one officer was moderately hurt in that attack. And again, the stabber was, in this case, he was shot, he wasn't able to flee. From what we know, he was critically wounded and also taken to a hospital. So he's in Israeli custody currently. And from what I understand, Manny, these soldiers, or at least part of them, were from reserve units, is that correct? Yeah. So the two reservists who were wounded in the northern West Bank were reservists, one from the Home Front Command, one from the Technology and Logistics Directorate. And in the south, it wasn't a reservist, it was an IDF officer from the Jordan Valley Brigade, but he was operating in the Hebron area. All sorts of manpower reasons they move soldiers around in the West Bank. So that leads to my previous question, which we have yet to answer. Are there currently more soldiers in the West Bank than on the other many, many fronts that Israel is currently dealing with? Or has the balance of concentration moved again back to the Gaza Strip? So right now, I think there's still more soldiers in the West Bank. In general, if I remember correctly, the normal number of battalions in the West Bank is 13. But it's sort of fluctuated even up to like 25 at certain points. Right now, I don't know the exact number, but it's probably somewhere hovering between 15 and 20. That's normally the case, at least in the past year during the war. And in Gaza, currently, there's only eight brigade level teams. And it's hard to say how many battalions exactly. So I think it's more or less equal now between Gaza and the West Bank, especially since Israel resumed fighting in Gaza. There's three divisions in Gaza now, but they're not full divisions. So it's a little bit complicated to sort of calculate this. But I will say that once this major offensive begins in the next few weeks, if there's no hostage deal, for sure, Gaza will have way more forces than the West Bank and any other front that Israel is currently fighting on. Okay, we're going to go to a short break and then discuss manpower needs. And we're back. I'm Amanda Burchell Dunn here with our military reporter, Emmanuel Fabian. So due to developments in the Gaza war that we've been discussing in the first half yesterday or this week, Eyal Zamir, the new IDF Chief of Staff, ordered the personnel director to again, send out letters to really press the Haredi community to join up to the army to conscript. I don't want to be pessimistic. But we've seen in the past that something like what, 3% made it to the induction center. Is that right, Manny? Yeah, the numbers are very low. And the army is... Well, here's the problem. The army can't do very much about it. It's almost finished sending out 24,000 draft orders to Haredi men. There's around 70,000 to 80,000 potential conscripts in the ultra-Orthodox community. And in addition to these 24,000 that they're sending out, they also send out, in general, to anyone turning 16 and a half. Anyone in the country who turns 16 and a half gets a draft order because they go through the whole process and draft at 18. But even then, even among these thousands of orders sent out, the army now has this yearly goal of 4,800 Haredi soldiers. And I think it's reached like 1,800 in total. The army really needs the State of Israel to impose sanctions on those who don't draft. Otherwise, it doesn't matter if they send out 80,000 more. I don't think we're going to see any change in the number of those who are actually going to show up. Okay, so one solution, as I teased in our intro earlier, could be through women power. And you wrote a piece a couple weeks ago, actually, that caught my eye. And it had all sorts of data of how many women are enlisting into the fighting units that they are able to enlist into because women cannot as yet enlist into all of the fighting units. So I'm just going to throw out some of the data and then we'll discuss it. The Border Defense Corps' Light Infantry Unit saw 129% draft turnout. And the Combat Intelligence Collection Unit, where the surveillance officers served, saw 132% turnout. The Artillery Corps, this actually surprised me, saw 142% draft turnout. And the Air Force's Air Defense Array saw 115%. The Home Front Command, that's where my daughter is, the Home Front Command Search and Rescue Unit saw 132%. And the Border Police saw 107%. So several of these units are units that women, traditionally, if you can call it that, have been serving in. I think it's been, what, 20 years or so that women are really stepping into these fighting roles. Did anything surprise you, Manny, in this array of data that I just listed out? That did surprise me. The Border Police was, I guess, not really low, but it's definitely... Only over 100. Very interesting that for many, many years, Border Police was the most sought after unit for both men and especially among female conscripts. Definitely, they wanted to go to the Border Police because Border Police for many, many years were accepting female soldiers to their ranks. And as part of their national service, they do it in the police. Many thought it was preferable than being in the IDF. The Artillery Corps, the main sort of positions that female soldiers are serving in is the Sky Riders Unit. They operate these drones that help forces during operations. But they're all above 100% because, essentially, the Army drafts more soldiers than it needs. It funnels more conscripts than it needs because it assumes that a certain percentage will refuse the positions and go somewhere else. But the motivation appears to be very, very high, so you're getting more than they asked for. There are, of course, soldiers who are still refusing certain positions. It can't be ignored. But the percentages are not significant enough to actually affect the IDF's long-term planning. It is a bit difficult to sort of understand the percentages, how many troops it is, because last year we saw that in the surveillance soldier units, it was like 200% more than they asked for, but probably because the Army only planned for a very small amount in that case, and they got way more. So they've adjusted the numbers that they're bringing in. You noted that they can't serve everywhere, and these are sort of the traditional units. So, interestingly, this draft period, the March-April draft period, the Army's opened up a new program as well for female soldiers to serve in, in a combat position, that is, and that's in the Intelligence Unit 504, which specializes in human intelligence. This unit used to be very small. The Army didn't operate that many human intelligence sources. Even in Gaza, there was a period of about 10 years that Israel didn't have any human sources in Gaza. But during the war, because of the use of this unit so much in Gaza, detaining Hamas operatives in Gaza and interrogating them and activating sources in Gaza, they've expanded the unit quite significantly, which we've previously reported on. The commander of the unit's been promoted another rank up, so they've basically made the unit much bigger. And now they've also added this new program for female soldiers to serve in combat positions in this pretty elite unit. So that's, I think, quite a significant move that the Army's making here. I definitely think it will, it will work, and there'll be a lot of soldiers who want to go and serve there. So you discussed that there was a new unit that was opened up, the 504, but there's also another new-ish unit or a revived unit that you just reported on, and its goal is to provide a new operational solution for the threat of UAVs and drones. So about 20 years ago or so, this unit was shut down. And so what was the need to reopen it and reinstate this unit? So if you remember, during the fighting in Lebanon, one of the most significant threats was Hezbollah's drones. We saw many, many times that Hezbollah's drones managed to evade Israeli air defence systems, managed to strike sometimes very deep into Israel. There was the attack on the Golani Brigade, a training base that killed four soldiers. There was a strike on Israel's surveillance balloon in the north as well, you know, 80 kilometres into Israel. And the Army faced, or specifically the Air Force faced quite a challenge when it came to intercepting these drones and tracking these drones and shooting them down. They were doing it mostly with the Iron Dome, which is kind of expensive to do for small drones, or fighter jets that they would fly and try to track them down, or helicopters sometimes would track them down and shoot them down. So a year ago, the Air Force decided that it would start bringing back older and different types of air defence systems. For example, gun-based systems like the Vulcan. It's basically a machine gun, a big machine gun that can shoot things down and you can station at a certain point next to critical infrastructure, next to an army base. And then when anything approaches, you shoot it down basically. And it's a lot more effective for dealing with these small targets and a lot more effective at dealing with protecting a specific small area, like a sensitive facility. Israel also has this in-development laser system, the Iron Beam. It's supposed to be deployed this year, according to the Defence Ministry, so it's definitely been in testing over the past few years. And again, that's also something that's very effective against small targets, like drones, in very short ranges. So the army announced this week that it had reopened the 946th Air Defence Battalion. It was closed in 2003, like you mentioned, more than 20 years ago. It used to operate the Chaparral. It's an American surface-to-air missile system for shooting down planes, but it was closed because it was not needed anymore. But now they've reopened the unit and they're going to be operating, the army hasn't detailed which systems, but they say systems that are sort of adapted and tailored for the threat of drones. And they're also going to be very mobile so that the unit can move around with troops. So if troops are operating beyond the borderline, if they're operating in inside enemy territory, this unit can join them with their systems and protect the forces from the drone threat, because that's also been a big problem. When troops are operating inside enemy territory, being able to detect and shoot down drones is much more difficult. So that's the goal of this new unit. There's been a big overhaul in the Air Force's aerial defence. During the war, they've reopened units and closed units. They shut down the Patriots because that wasn't being used anymore. They've reopened more Iron Dome units. And now this, this new battalion specifically for shooting down drones, specifically on the northern border, where the drone threat is the most, I guess, potent. And as you reported, it is as well open to women, correct? Yeah, of course. The entire aerial defence array is open for women. So this specific battalion will have hundreds of soldiers, and it will be both men and women. In the aerial defence array, if I remember correctly, it's about 50-50 between men and women serving. Whereas, let's say in the Home Front Command Search and Rescue, it's more like 70-30, 70 women, 30% men usually, in most of the units. So Manny, as I said at the beginning, if the manpower doesn't arrive, perhaps we do need to turn to the woman power. Manny, thank you so much for joining me today. Thank you.\", 'segments': [{'id': 0, 'start': 0.0, 'end': 10.0, 'text': \" Welcome to the Times of Israel's daily briefing. Today is Thursday, May 8th, day 580 of the\"}, {'id': 1, 'start': 10.0, 'end': 15.119999885559082, 'text': \" war. I'm Amanda Borchell-Dahn here with our military reporter, Emanuel Fabian. Hi, Manny.\"}, {'id': 2, 'start': 15.119999885559082, 'end': 17.440000534057617, 'text': ' Thanks for joining me this kind of early morning.'}, {'id': 3, 'start': 18.079999923706055, 'end': 18.639999389648438, 'text': ' Hi, Amanda.'}, {'id': 4, 'start': 19.68000030517578, 'end': 26.239999771118164, 'text': ' As Israel gears up to implement Plan B of a plan to defeat Hamas, according to IDF Chief'}, {'id': 5, 'start': 26.239999771118164, 'end': 34.0, 'text': ' of Staff Eyal Zamir, yesterday, several Israeli airstrikes in Gaza killed dozens of Palestinians,'}, {'id': 6, 'start': 34.0, 'end': 40.31999969482422, 'text': \" according to Hamas authorities. We'll hear more about these strikes, including one on a school,\"}, {'id': 7, 'start': 40.31999969482422, 'end': 44.63999938964844, 'text': ' and Manny will also update us on what is happening in general in the Gaza war.'}, {'id': 8, 'start': 44.63999938964844, 'end': 50.15999984741211, 'text': \" We'll also hear about a Hamas commander who was killed in Lebanon. Who was this man? And we'll\"}, {'id': 9, 'start': 50.15999984741211, 'end': 55.91999816894531, 'text': ' learn about attacks on three Israeli soldiers in the West Bank yesterday. In the second half'}, {'id': 10, 'start': 55.91999816894531, 'end': 61.68000030517578, 'text': \" of our program, we're going to discuss the IDF manpower needs and maybe find a solution through\"}, {'id': 11, 'start': 61.68000030517578, 'end': 66.16000366210938, 'text': \" women power. All of this and much, much more when we're back.\"}, {'id': 12, 'start': 116.63999938964844, 'end': 125.76000213623047, 'text': ' According to the Hamas Health Ministry, two IDF strikes early Wednesday hit the Karama School in'}, {'id': 13, 'start': 125.76000213623047, 'end': 132.39999389648438, 'text': ' Tufach, which is a suburb of Gaza City, killing some 15. Later in the day, other airstrikes near'}, {'id': 14, 'start': 132.39999389648438, 'end': 138.8800048828125, 'text': ' a market in Gaza City killed at least 33 people. This is, of course, according to Hamas authority'}, {'id': 15, 'start': 138.8800048828125, 'end': 145.52000427246094, 'text': ' figures. Also on Wednesday, a Golani Brigade soldier was wounded during a mission. So before'}, {'id': 16, 'start': 145.52000427246094, 'end': 152.39999389648438, 'text': ' we turn to the status of fighting in Gaza, Manny, what are we hearing about these strikes, especially'}, {'id': 17, 'start': 152.39999389648438, 'end': 156.0, 'text': ' the one on a school yesterday from the IDF at this point?'}, {'id': 18, 'start': 156.8800048828125, 'end': 162.0, 'text': \" As of recording, we haven't seen an IDF comment. They said they were looking into the strike.\"}, {'id': 19, 'start': 162.8000030517578, 'end': 170.16000366210938, 'text': \" So we don't really know what the army was trying to target there or maybe if this was a mistake\"}, {'id': 20, 'start': 170.16000366210938, 'end': 177.44000244140625, 'text': \" that they bombed this area. But I will sort of note that during the war, Israel's targeted\"}, {'id': 21, 'start': 178.0, 'end': 186.55999755859375, 'text': ' dozens of former schools in Gaza where civilians have been sheltering, claiming and in some cases'}, {'id': 22, 'start': 186.55999755859375, 'end': 192.9600067138672, 'text': ' proving that Hamas was using those facilities for terror purposes, for planning attacks against'}, {'id': 23, 'start': 192.9600067138672, 'end': 200.0, 'text': ' Israel or for launching attacks on troops or just to hold. I mean, I think even some'}, {'id': 24, 'start': 200.0, 'end': 206.16000366210938, 'text': ' former hostages said they were held in humanitarian shelters areas. So we do know that Hamas uses those'}, {'id': 25, 'start': 206.16000366210938, 'end': 210.63999938964844, 'text': \" sites and Israel has bombed them many, many times before. But in this case, we still don't know\"}, {'id': 26, 'start': 210.63999938964844, 'end': 216.47999572753906, 'text': \" exactly who was targeted yet. Maybe the army's waiting for further details or that this was some\"}, {'id': 27, 'start': 216.47999572753906, 'end': 220.55999755859375, 'text': ' sort of mistake. But we will, of course, update when we know when we hear something from the Israeli side.'}, {'id': 28, 'start': 221.1999969482422, 'end': 225.9199981689453, 'text': \" Right. In general, it's very difficult to report on these matters. Obviously, we don't have a man\"}, {'id': 29, 'start': 225.9199981689453, 'end': 232.0800018310547, 'text': ' in Gaza checking out what happened on the scene. And we do rely upon the IDF information. And as'}, {'id': 30, 'start': 232.0800018310547, 'end': 238.8000030517578, 'text': ' you said so carefully, diplomatically, actually, they often prove or sometimes prove that Hamas'}, {'id': 31, 'start': 238.8800048828125, 'end': 244.39999389648438, 'text': ' operatives were also in the area for these strikes. But it is a difficult matter. And as you said,'}, {'id': 32, 'start': 244.39999389648438, 'end': 249.9199981689453, 'text': \" please check out our live blog for more updates. So Manny, of course, we're hearing about a huge\"}, {'id': 33, 'start': 249.9199981689453, 'end': 255.75999450683594, 'text': ' call up to go into Gaza. And of course, we saw this week reservists arriving. There was a huge'}, {'id': 34, 'start': 255.75999450683594, 'end': 262.55999755859375, 'text': ' line of reservist cars arriving at their staging area, I think you call it, to get ready to'}, {'id': 35, 'start': 263.20001220703125, 'end': 267.3599853515625, 'text': \" essentially go into Gaza as far as we understand. And yesterday, we're hearing from\"}, {'id': 36, 'start': 267.3599853515625, 'end': 274.55999755859375, 'text': ' Eyal Zamir, the new IDF Chief of Staff, that Israel is moving into this Plan B to defeat Hamas.'}, {'id': 37, 'start': 274.55999755859375, 'end': 280.55999755859375, 'text': ' What does that mean to you? Is this now the big operation? Or are we still in almost an operation?'}, {'id': 38, 'start': 281.6000061035156, 'end': 291.67999267578125, 'text': \" We're in the sort of preparation phase of this operation. We've heard from officials that\"}, {'id': 39, 'start': 292.4800109863281, 'end': 299.67999267578125, 'text': \" if by May 16, by the time Trump ends his visits to the region, Israel will, and there's no\"}, {'id': 40, 'start': 299.67999267578125, 'end': 305.2799987792969, 'text': ' hostage deal with Hamas, that Israel will launch this operation in Gaza, this very major operation.'}, {'id': 41, 'start': 306.55999755859375, 'end': 312.1600036621094, 'text': ' We are seeing the troops, like you said, reaching their staging grounds in southern Israel.'}, {'id': 42, 'start': 313.0400085449219, 'end': 317.2799987792969, 'text': ' Tens of thousands of reservists are being called up. The battle plans are being approved.'}, {'id': 43, 'start': 318.239990234375, 'end': 323.6000061035156, 'text': ' What you mentioned with Zamir yesterday, he was speaking to all the brigade commanders and'}, {'id': 44, 'start': 323.6000061035156, 'end': 329.760009765625, 'text': \" division commanders and presenting them with the plan and sort of detailing what's going to happen,\"}, {'id': 45, 'start': 330.8800048828125, 'end': 335.8399963378906, 'text': ' basically briefing them ahead of the operation. We also saw that the Defense Minister Katz held'}, {'id': 46, 'start': 335.8399963378906, 'end': 343.44000244140625, 'text': ' an assessment with top IDF officials as well with the division commanders to go over the plans and'}, {'id': 47, 'start': 343.5199890136719, 'end': 347.44000244140625, 'text': ' to be presented with them to approve certain things. The plans have all been approved,'}, {'id': 48, 'start': 347.44000244140625, 'end': 351.44000244140625, 'text': \" but we're talking about the more tactical elements of the plan now.\"}, {'id': 49, 'start': 352.0799865722656, 'end': 357.1199951171875, 'text': ' But Israel is very much gearing up to launch this operation within the coming weeks.'}, {'id': 50, 'start': 358.0799865722656, 'end': 362.239990234375, 'text': ' Okay, and the IDF is, of course, hunting down Hamas operatives throughout the region,'}, {'id': 51, 'start': 362.239990234375, 'end': 367.5199890136719, 'text': ' if not the world. And yesterday, we heard about airstrikes in Lebanon that took out'}, {'id': 52, 'start': 367.5199890136719, 'end': 371.5199890136719, 'text': ' Khaled Ahmed al-Ahmed. So what was he responsible for?'}, {'id': 53, 'start': 372.0, 'end': 378.79998779296875, 'text': \" The army says that this Hamas member was the chief of operations in the terror group's western sector\"}, {'id': 54, 'start': 378.79998779296875, 'end': 384.9599914550781, 'text': ' in southern Lebanon. Important to note that Hamas does have quite a significant presence in Lebanon.'}, {'id': 55, 'start': 386.4800109863281, 'end': 394.55999755859375, 'text': \" It's allied with Hezbollah. And during the war, Israel's targeted many Hamas operatives in Lebanon.\"}, {'id': 56, 'start': 394.55999755859375, 'end': 398.9599914550781, 'text': ' Hamas has also carried out rocket attacks from Lebanon on Israel during the war,'}, {'id': 57, 'start': 399.9200134277344, 'end': 405.1199951171875, 'text': ' suspected even that the recent rocket fire that we saw from Lebanon in the past couple months'}, {'id': 58, 'start': 405.1199951171875, 'end': 410.1600036621094, 'text': ' were actually carried out by Hamas or other Palestinian groups and not Hezbollah themselves.'}, {'id': 59, 'start': 411.8399963378906, 'end': 417.20001220703125, 'text': \" But he's not the first chief of operations, I think, that Israel's killed in Lebanon,\"}, {'id': 60, 'start': 417.20001220703125, 'end': 422.6400146484375, 'text': ' for Hamas that is. There was also another strike a day earlier that killed a Hezbollah commander,'}, {'id': 61, 'start': 423.20001220703125, 'end': 431.3599853515625, 'text': \" Adnan Harb, who the army said was head of logistics in one of the terror group's regional\"}, {'id': 62, 'start': 431.3599853515625, 'end': 437.3599853515625, 'text': \" divisions. And the army says that he was working to sort of restore Hezbollah's capabilities,\"}, {'id': 63, 'start': 437.3599853515625, 'end': 443.6000061035156, 'text': ' restore its infrastructure in the area of southern Lebanon, which is, of course,'}, {'id': 64, 'start': 443.6000061035156, 'end': 449.2799987792969, 'text': ' a violation of the ceasefire agreement. But we are seeing in general in Lebanon,'}, {'id': 65, 'start': 449.8399963378906, 'end': 453.44000244140625, 'text': ' the Lebanese army step up, dismantling more and more Hezbollah infrastructure.'}, {'id': 66, 'start': 454.7200012207031, 'end': 459.44000244140625, 'text': \" There's been daily strikes still against Hezbollah members, but it's definitely,\"}, {'id': 67, 'start': 459.44000244140625, 'end': 463.20001220703125, 'text': \" I think, we're getting to a point where the Lebanese army is taking much more control\"}, {'id': 68, 'start': 463.20001220703125, 'end': 468.6400146484375, 'text': \" over certain areas in the south of the country. I think it can't be overemphasized what you just\"}, {'id': 69, 'start': 468.6400146484375, 'end': 473.3599853515625, 'text': ' said as a throwaway line, that there are still daily strikes in southern Lebanon. And so obviously,'}, {'id': 70, 'start': 473.3599853515625, 'end': 478.8800048828125, 'text': ' Israel is still, even though there is a ceasefire, is still very active on the northern border,'}, {'id': 71, 'start': 478.8800048828125, 'end': 484.79998779296875, 'text': \" both in Lebanon and in Syria, as we've discussed earlier. Now, let's turn to the West Bank. And\"}, {'id': 72, 'start': 484.79998779296875, 'end': 489.20001220703125, 'text': \" during parts of this war, most of the IDF soldiers, according to what you've told me\"}, {'id': 73, 'start': 489.20001220703125, 'end': 494.6400146484375, 'text': ' in previous podcasts, have been stationed in the West Bank. And I wonder if that is still the case.'}, {'id': 74, 'start': 494.6400146484375, 'end': 500.239990234375, 'text': ' But first, tell us about two incidents yesterday in which three soldiers were attacked in the West'}, {'id': 75, 'start': 500.239990234375, 'end': 506.8800048828125, 'text': ' Bank. These two attacks really took place within moments of each other, completely different areas.'}, {'id': 76, 'start': 507.5199890136719, 'end': 516.3200073242188, 'text': \" So in the northern West Bank, near the Rayhan checkpoint, it's sort of on the western side of\"}, {'id': 77, 'start': 516.3200073242188, 'end': 524.6400146484375, 'text': ' the sort of the north of the West Bank, sort of across from Jenin, that area. Two soldiers who'}, {'id': 78, 'start': 524.6400146484375, 'end': 529.1199951171875, 'text': ' were in the area, not at the checkpoint itself, but kind of near the checkpoint, in a vehicle,'}, {'id': 79, 'start': 529.1199951171875, 'end': 535.4400024414062, 'text': ' they came under fire by a Palestinian gunman, wounding two of them seriously. These two soldiers'}, {'id': 80, 'start': 536.4000244140625, 'end': 542.5599975585938, 'text': \" and the attacker have fled the area. We've heard from the army this morning, as we're recording,\"}, {'id': 81, 'start': 542.5599975585938, 'end': 548.0, 'text': ' that a suspect was detained in one of the nearby villages, still investigating if he'}, {'id': 82, 'start': 548.719970703125, 'end': 552.719970703125, 'text': \" actually was the shooter, but he is suspected to be the shooter. So we'll update, of course,\"}, {'id': 83, 'start': 552.719970703125, 'end': 559.8400268554688, 'text': \" when that's confirmed. And then very shortly after this shooting attack in the southern West Bank,\"}, {'id': 84, 'start': 559.8400268554688, 'end': 566.0800170898438, 'text': ' near Hebron, a Palestinian rounds his car into a junction where IDF troops are stationed.'}, {'id': 85, 'start': 567.2000122070312, 'end': 573.8400268554688, 'text': ' He got out of his car and then stabbed one of the soldiers before he was shot. So one officer'}, {'id': 86, 'start': 573.8400268554688, 'end': 579.8400268554688, 'text': ' was moderately hurt in that attack. And again, the stabber was, in this case, he was shot,'}, {'id': 87, 'start': 579.8400268554688, 'end': 585.760009765625, 'text': \" he wasn't able to flee. From what we know, he was critically wounded and also taken to a hospital.\"}, {'id': 88, 'start': 585.760009765625, 'end': 590.8800048828125, 'text': \" So he's in Israeli custody currently. And from what I understand, Manny,\"}, {'id': 89, 'start': 590.8800048828125, 'end': 595.280029296875, 'text': ' these soldiers, or at least part of them, were from reserve units, is that correct?'}, {'id': 90, 'start': 595.280029296875, 'end': 599.8400268554688, 'text': ' Yeah. So the two reservists who were wounded in the northern West Bank were reservists,'}, {'id': 91, 'start': 601.4400024414062, 'end': 605.5999755859375, 'text': ' one from the Home Front Command, one from the Technology and Logistics Directorate.'}, {'id': 92, 'start': 606.9600219726562, 'end': 613.760009765625, 'text': \" And in the south, it wasn't a reservist, it was an IDF officer from the Jordan Valley\"}, {'id': 93, 'start': 613.760009765625, 'end': 618.47998046875, 'text': ' Brigade, but he was operating in the Hebron area. All sorts of manpower reasons they move'}, {'id': 94, 'start': 618.47998046875, 'end': 624.4000244140625, 'text': ' soldiers around in the West Bank. So that leads to my previous question,'}, {'id': 95, 'start': 624.4000244140625, 'end': 629.9199829101562, 'text': ' which we have yet to answer. Are there currently more soldiers in the West Bank than on the other'}, {'id': 96, 'start': 629.9199829101562, 'end': 634.1599731445312, 'text': ' many, many fronts that Israel is currently dealing with? Or has the balance of'}, {'id': 97, 'start': 635.5999755859375, 'end': 642.0, 'text': \" concentration moved again back to the Gaza Strip? So right now, I think there's still\"}, {'id': 98, 'start': 642.0, 'end': 647.4400024414062, 'text': ' more soldiers in the West Bank. In general, if I remember correctly, the normal number of'}, {'id': 99, 'start': 647.4400024414062, 'end': 654.0800170898438, 'text': \" battalions in the West Bank is 13. But it's sort of fluctuated even up to like 25\"}, {'id': 100, 'start': 655.1199951171875, 'end': 658.9600219726562, 'text': \" at certain points. Right now, I don't know the exact number, but it's probably somewhere hovering\"}, {'id': 101, 'start': 658.9600219726562, 'end': 662.9600219726562, 'text': \" between 15 and 20. That's normally the case, at least in the past year during the war.\"}, {'id': 102, 'start': 663.9199829101562, 'end': 668.9600219726562, 'text': \" And in Gaza, currently, there's only eight brigade level teams. And it's hard to say how many\"}, {'id': 103, 'start': 668.9600219726562, 'end': 675.4400024414062, 'text': \" battalions exactly. So I think it's more or less equal now between Gaza and the West Bank,\"}, {'id': 104, 'start': 675.4400024414062, 'end': 679.4400024414062, 'text': \" especially since Israel resumed fighting in Gaza. There's three divisions in Gaza now,\"}, {'id': 105, 'start': 679.4400024414062, 'end': 683.5999755859375, 'text': \" but they're not full divisions. So it's a little bit complicated to sort of calculate this. But\"}, {'id': 106, 'start': 683.5999755859375, 'end': 688.8800048828125, 'text': \" I will say that once this major offensive begins in the next few weeks, if there's no hostage deal,\"}, {'id': 107, 'start': 689.6799926757812, 'end': 695.280029296875, 'text': ' for sure, Gaza will have way more forces than the West Bank and any other front'}, {'id': 108, 'start': 696.239990234375, 'end': 697.5999755859375, 'text': ' that Israel is currently fighting on.'}, {'id': 109, 'start': 698.239990234375, 'end': 701.760009765625, 'text': \" Okay, we're going to go to a short break and then discuss manpower needs.\"}, {'id': 110, 'start': 725.280029296875, 'end': 744.4000244140625, 'text': \" And we're back. I'm Amanda Burchell Dunn here with our military reporter, Emmanuel Fabian.\"}, {'id': 111, 'start': 744.4000244140625, 'end': 749.5999755859375, 'text': \" So due to developments in the Gaza war that we've been discussing in the first half yesterday or\"}, {'id': 112, 'start': 749.5999755859375, 'end': 755.52001953125, 'text': ' this week, Eyal Zamir, the new IDF Chief of Staff, ordered the personnel director to again,'}, {'id': 113, 'start': 755.52001953125, 'end': 762.0800170898438, 'text': ' send out letters to really press the Haredi community to join up to the army to conscript.'}, {'id': 114, 'start': 762.6400146484375, 'end': 765.760009765625, 'text': \" I don't want to be pessimistic. But we've seen in the past that something like what,\"}, {'id': 115, 'start': 765.760009765625, 'end': 768.6400146484375, 'text': ' 3% made it to the induction center. Is that right, Manny?'}, {'id': 116, 'start': 769.4400024414062, 'end': 775.2000122070312, 'text': \" Yeah, the numbers are very low. And the army is... Well, here's the problem. The army can't do very\"}, {'id': 117, 'start': 775.2000122070312, 'end': 780.7999877929688, 'text': \" much about it. It's almost finished sending out 24,000 draft orders to Haredi men. There's\"}, {'id': 118, 'start': 781.6799926757812, 'end': 787.1199951171875, 'text': ' around 70,000 to 80,000 potential conscripts in the ultra-Orthodox community.'}, {'id': 119, 'start': 789.1199951171875, 'end': 792.0800170898438, 'text': \" And in addition to these 24,000 that they're sending out, they also send out,\"}, {'id': 120, 'start': 792.6400146484375, 'end': 797.6799926757812, 'text': ' in general, to anyone turning 16 and a half. Anyone in the country who turns 16 and a half'}, {'id': 121, 'start': 797.6799926757812, 'end': 802.9600219726562, 'text': ' gets a draft order because they go through the whole process and draft at 18. But even then,'}, {'id': 122, 'start': 802.9600219726562, 'end': 810.3200073242188, 'text': ' even among these thousands of orders sent out, the army now has this yearly goal of 4,800'}, {'id': 123, 'start': 811.5999755859375, 'end': 816.7999877929688, 'text': \" Haredi soldiers. And I think it's reached like 1,800 in total. The army really needs\"}, {'id': 124, 'start': 816.7999877929688, 'end': 824.7999877929688, 'text': \" the State of Israel to impose sanctions on those who don't draft. Otherwise, it doesn't matter if\"}, {'id': 125, 'start': 824.7999877929688, 'end': 829.0399780273438, 'text': \" they send out 80,000 more. I don't think we're going to see any change in the number of those\"}, {'id': 126, 'start': 829.0399780273438, 'end': 835.6799926757812, 'text': ' who are actually going to show up. Okay, so one solution, as I teased in our intro earlier,'}, {'id': 127, 'start': 835.6799926757812, 'end': 840.3200073242188, 'text': ' could be through women power. And you wrote a piece a couple weeks ago, actually, that caught'}, {'id': 128, 'start': 840.3200073242188, 'end': 847.760009765625, 'text': ' my eye. And it had all sorts of data of how many women are enlisting into the fighting units that'}, {'id': 129, 'start': 847.760009765625, 'end': 854.1599731445312, 'text': ' they are able to enlist into because women cannot as yet enlist into all of the fighting units. So'}, {'id': 130, 'start': 854.1599731445312, 'end': 858.7999877929688, 'text': \" I'm just going to throw out some of the data and then we'll discuss it. The Border Defense Corps'\"}, {'id': 131, 'start': 858.7999877929688, 'end': 866.8800048828125, 'text': ' Light Infantry Unit saw 129% draft turnout. And the Combat Intelligence Collection Unit,'}, {'id': 132, 'start': 866.8800048828125, 'end': 875.5999755859375, 'text': ' where the surveillance officers served, saw 132% turnout. The Artillery Corps, this actually'}, {'id': 133, 'start': 875.5999755859375, 'end': 884.1599731445312, 'text': \" surprised me, saw 142% draft turnout. And the Air Force's Air Defense Array saw 115%. The Home\"}, {'id': 134, 'start': 884.1599731445312, 'end': 888.6400146484375, 'text': \" Front Command, that's where my daughter is, the Home Front Command Search and Rescue Unit saw\"}, {'id': 135, 'start': 888.6400146484375, 'end': 897.6799926757812, 'text': ' 132%. And the Border Police saw 107%. So several of these units are units that women, traditionally,'}, {'id': 136, 'start': 897.6799926757812, 'end': 902.3200073242188, 'text': \" if you can call it that, have been serving in. I think it's been, what, 20 years or so that women\"}, {'id': 137, 'start': 902.3200073242188, 'end': 908.7999877929688, 'text': ' are really stepping into these fighting roles. Did anything surprise you, Manny, in this array'}, {'id': 138, 'start': 908.7999877929688, 'end': 914.3200073242188, 'text': ' of data that I just listed out? That did surprise me. The Border Police was, I guess,'}, {'id': 139, 'start': 914.3200073242188, 'end': 917.3599853515625, 'text': \" not really low, but it's definitely... Only over 100.\"}, {'id': 140, 'start': 918.0800170898438, 'end': 923.4400024414062, 'text': ' Very interesting that for many, many years, Border Police was the most sought after unit'}, {'id': 141, 'start': 924.0, 'end': 931.760009765625, 'text': ' for both men and especially among female conscripts. Definitely, they wanted to go to'}, {'id': 142, 'start': 931.760009765625, 'end': 936.5599975585938, 'text': ' the Border Police because Border Police for many, many years were accepting female soldiers to their'}, {'id': 143, 'start': 936.5599975585938, 'end': 942.0, 'text': ' ranks. And as part of their national service, they do it in the police. Many thought it was'}, {'id': 144, 'start': 942.0, 'end': 949.0399780273438, 'text': ' preferable than being in the IDF. The Artillery Corps, the main sort of positions that female'}, {'id': 145, 'start': 949.0399780273438, 'end': 955.760009765625, 'text': ' soldiers are serving in is the Sky Riders Unit. They operate these drones that help forces during'}, {'id': 146, 'start': 957.4400024414062, 'end': 965.3599853515625, 'text': \" operations. But they're all above 100% because, essentially, the Army drafts more soldiers than\"}, {'id': 147, 'start': 965.3599853515625, 'end': 969.3599853515625, 'text': ' it needs. It funnels more conscripts than it needs because it assumes that a certain percentage'}, {'id': 148, 'start': 969.3599853515625, 'end': 977.4400024414062, 'text': ' will refuse the positions and go somewhere else. But the motivation appears to be very, very high,'}, {'id': 149, 'start': 977.4400024414062, 'end': 984.239990234375, 'text': \" so you're getting more than they asked for. There are, of course, soldiers who are still refusing\"}, {'id': 150, 'start': 984.239990234375, 'end': 990.3200073242188, 'text': \" certain positions. It can't be ignored. But the percentages are not significant enough to actually\"}, {'id': 151, 'start': 990.4000244140625, 'end': 997.5999755859375, 'text': \" affect the IDF's long-term planning. It is a bit difficult to sort of understand the percentages,\"}, {'id': 152, 'start': 997.5999755859375, 'end': 1004.239990234375, 'text': ' how many troops it is, because last year we saw that in the surveillance soldier units,'}, {'id': 153, 'start': 1005.52001953125, 'end': 1010.239990234375, 'text': ' it was like 200% more than they asked for, but probably because the Army only planned for a very'}, {'id': 154, 'start': 1010.239990234375, 'end': 1015.2000122070312, 'text': \" small amount in that case, and they got way more. So they've adjusted the numbers that they're\"}, {'id': 155, 'start': 1015.6799926757812, 'end': 1021.1199951171875, 'text': \" bringing in. You noted that they can't serve everywhere, and these are sort of the traditional\"}, {'id': 156, 'start': 1021.1199951171875, 'end': 1026.6400146484375, 'text': \" units. So, interestingly, this draft period, the March-April draft period, the Army's opened up a\"}, {'id': 157, 'start': 1026.6400146484375, 'end': 1033.43994140625, 'text': \" new program as well for female soldiers to serve in, in a combat position, that is, and that's in\"}, {'id': 158, 'start': 1033.43994140625, 'end': 1041.8399658203125, 'text': ' the Intelligence Unit 504, which specializes in human intelligence. This unit used to be very'}, {'id': 159, 'start': 1041.8399658203125, 'end': 1049.9200439453125, 'text': \" small. The Army didn't operate that many human intelligence sources. Even in Gaza, there was a\"}, {'id': 160, 'start': 1049.9200439453125, 'end': 1055.1199951171875, 'text': \" period of about 10 years that Israel didn't have any human sources in Gaza. But during the war,\"}, {'id': 161, 'start': 1055.1199951171875, 'end': 1061.280029296875, 'text': ' because of the use of this unit so much in Gaza, detaining Hamas operatives in Gaza and'}, {'id': 162, 'start': 1061.280029296875, 'end': 1066.239990234375, 'text': \" interrogating them and activating sources in Gaza, they've expanded the unit quite significantly,\"}, {'id': 163, 'start': 1066.800048828125, 'end': 1072.56005859375, 'text': \" which we've previously reported on. The commander of the unit's been promoted another rank up,\"}, {'id': 164, 'start': 1072.56005859375, 'end': 1076.719970703125, 'text': \" so they've basically made the unit much bigger. And now they've also added this new program for\"}, {'id': 165, 'start': 1076.719970703125, 'end': 1083.3599853515625, 'text': \" female soldiers to serve in combat positions in this pretty elite unit. So that's, I think,\"}, {'id': 166, 'start': 1084.0799560546875, 'end': 1088.1600341796875, 'text': \" quite a significant move that the Army's making here. I definitely think it will,\"}, {'id': 167, 'start': 1088.1600341796875, 'end': 1091.9200439453125, 'text': \" it will work, and there'll be a lot of soldiers who want to go and serve there.\"}, {'id': 168, 'start': 1091.9200439453125, 'end': 1100.3199462890625, 'text': \" So you discussed that there was a new unit that was opened up, the 504, but there's also another\"}, {'id': 169, 'start': 1100.3199462890625, 'end': 1107.280029296875, 'text': ' new-ish unit or a revived unit that you just reported on, and its goal is to provide a new'}, {'id': 170, 'start': 1107.280029296875, 'end': 1114.47998046875, 'text': ' operational solution for the threat of UAVs and drones. So about 20 years ago or so, this unit was'}, {'id': 171, 'start': 1115.0400390625, 'end': 1121.0400390625, 'text': ' shut down. And so what was the need to reopen it and reinstate this unit?'}, {'id': 172, 'start': 1121.8399658203125, 'end': 1126.800048828125, 'text': ' So if you remember, during the fighting in Lebanon, one of the most significant threats was'}, {'id': 173, 'start': 1126.800048828125, 'end': 1132.6400146484375, 'text': \" Hezbollah's drones. We saw many, many times that Hezbollah's drones managed to evade Israeli air\"}, {'id': 174, 'start': 1132.6400146484375, 'end': 1137.8399658203125, 'text': ' defence systems, managed to strike sometimes very deep into Israel. There was the attack on the'}, {'id': 175, 'start': 1138.6400146484375, 'end': 1142.800048828125, 'text': \" Golani Brigade, a training base that killed four soldiers. There was a strike on Israel's\"}, {'id': 176, 'start': 1144.1600341796875, 'end': 1148.9599609375, 'text': ' surveillance balloon in the north as well, you know, 80 kilometres into Israel.'}, {'id': 177, 'start': 1150.8800048828125, 'end': 1156.239990234375, 'text': ' And the Army faced, or specifically the Air Force faced quite a challenge when it came to'}, {'id': 178, 'start': 1156.239990234375, 'end': 1161.0400390625, 'text': ' intercepting these drones and tracking these drones and shooting them down. They were doing'}, {'id': 179, 'start': 1161.0400390625, 'end': 1167.5999755859375, 'text': ' it mostly with the Iron Dome, which is kind of expensive to do for small drones, or fighter jets'}, {'id': 180, 'start': 1167.5999755859375, 'end': 1170.800048828125, 'text': ' that they would fly and try to track them down, or helicopters sometimes would track them down'}, {'id': 181, 'start': 1170.800048828125, 'end': 1177.9200439453125, 'text': ' and shoot them down. So a year ago, the Air Force decided that it would start bringing back'}, {'id': 182, 'start': 1179.1199951171875, 'end': 1185.9200439453125, 'text': ' older and different types of air defence systems. For example, gun-based systems like the Vulcan.'}, {'id': 183, 'start': 1185.9200439453125, 'end': 1192.1600341796875, 'text': \" It's basically a machine gun, a big machine gun that can shoot things down and you can station\"}, {'id': 184, 'start': 1192.1600341796875, 'end': 1196.9599609375, 'text': ' at a certain point next to critical infrastructure, next to an army base. And then when anything'}, {'id': 185, 'start': 1196.9599609375, 'end': 1201.43994140625, 'text': \" approaches, you shoot it down basically. And it's a lot more effective for dealing with these\"}, {'id': 186, 'start': 1201.43994140625, 'end': 1205.9200439453125, 'text': ' small targets and a lot more effective at dealing with protecting a specific small area, like a'}, {'id': 187, 'start': 1205.9200439453125, 'end': 1214.0, 'text': ' sensitive facility. Israel also has this in-development laser system, the Iron Beam.'}, {'id': 188, 'start': 1214.0, 'end': 1217.8399658203125, 'text': \" It's supposed to be deployed this year, according to the Defence Ministry, so it's definitely been\"}, {'id': 189, 'start': 1217.8399658203125, 'end': 1222.4000244140625, 'text': \" in testing over the past few years. And again, that's also something that's very effective\"}, {'id': 190, 'start': 1222.4000244140625, 'end': 1232.0, 'text': ' against small targets, like drones, in very short ranges. So the army announced this week that it'}, {'id': 191, 'start': 1232.0, 'end': 1238.9599609375, 'text': ' had reopened the 946th Air Defence Battalion. It was closed in 2003, like you mentioned, more than'}, {'id': 192, 'start': 1238.9599609375, 'end': 1248.56005859375, 'text': \" 20 years ago. It used to operate the Chaparral. It's an American surface-to-air missile system\"}, {'id': 193, 'start': 1248.56005859375, 'end': 1254.3199462890625, 'text': ' for shooting down planes, but it was closed because it was not needed anymore.'}, {'id': 194, 'start': 1254.9599609375, 'end': 1258.8800048828125, 'text': \" But now they've reopened the unit and they're going to be operating, the army hasn't detailed\"}, {'id': 195, 'start': 1258.8800048828125, 'end': 1264.0, 'text': ' which systems, but they say systems that are sort of adapted and tailored for the threat of'}, {'id': 196, 'start': 1264.9599609375, 'end': 1271.52001953125, 'text': \" drones. And they're also going to be very mobile so that the unit can move around with troops.\"}, {'id': 197, 'start': 1271.52001953125, 'end': 1278.239990234375, 'text': \" So if troops are operating beyond the borderline, if they're operating in inside enemy territory,\"}, {'id': 198, 'start': 1278.719970703125, 'end': 1284.1600341796875, 'text': ' this unit can join them with their systems and protect the forces from the drone threat,'}, {'id': 199, 'start': 1284.1600341796875, 'end': 1287.9200439453125, 'text': \" because that's also been a big problem. When troops are operating inside enemy territory,\"}, {'id': 200, 'start': 1288.9599609375, 'end': 1295.43994140625, 'text': \" being able to detect and shoot down drones is much more difficult. So that's the goal of this\"}, {'id': 201, 'start': 1296.4000244140625, 'end': 1304.4000244140625, 'text': \" new unit. There's been a big overhaul in the Air Force's aerial defence. During the war, they've\"}, {'id': 202, 'start': 1304.9599609375, 'end': 1308.6400146484375, 'text': \" reopened units and closed units. They shut down the Patriots because that wasn't being\"}, {'id': 203, 'start': 1308.6400146484375, 'end': 1316.47998046875, 'text': \" used anymore. They've reopened more Iron Dome units. And now this, this new battalion specifically\"}, {'id': 204, 'start': 1316.47998046875, 'end': 1320.800048828125, 'text': ' for shooting down drones, specifically on the northern border, where the drone threat is the'}, {'id': 205, 'start': 1320.800048828125, 'end': 1327.1199951171875, 'text': ' most, I guess, potent. And as you reported, it is as well open to women, correct? Yeah,'}, {'id': 206, 'start': 1327.1199951171875, 'end': 1333.6800537109375, 'text': ' of course. The entire aerial defence array is open for women. So this specific battalion will have'}, {'id': 207, 'start': 1333.6800537109375, 'end': 1338.1600341796875, 'text': ' hundreds of soldiers, and it will be both men and women. In the aerial defence array,'}, {'id': 208, 'start': 1338.1600341796875, 'end': 1344.9599609375, 'text': \" if I remember correctly, it's about 50-50 between men and women serving. Whereas, let's say in the\"}, {'id': 209, 'start': 1344.9599609375, 'end': 1350.0799560546875, 'text': \" Home Front Command Search and Rescue, it's more like 70-30, 70 women, 30% men usually,\"}, {'id': 210, 'start': 1350.0799560546875, 'end': 1356.47998046875, 'text': \" in most of the units. So Manny, as I said at the beginning, if the manpower doesn't arrive,\"}, {'id': 211, 'start': 1356.47998046875, 'end': 1361.5999755859375, 'text': ' perhaps we do need to turn to the woman power. Manny, thank you so much for joining me today.'}, {'id': 212, 'start': 1361.5999755859375, 'end': 1362.719970703125, 'text': ' Thank you.'}]}"