"{'text': \"And some breaking news to tell you about right now. Within the last few minutes, Columbia University directing NYPD onto their campus to remove protesters who refused to leave the school's library. Now, you can see police officers, some of them even in riot gear, removing some of those students in zip ties. And right outside, clashes between police and protesters turned violent with those heavy metal barriers being pushed into the air. And this is what the scene looked like inside a Butler library a little bit earlier. Students protesting in a standoff with school public safety officers. The school is saying two of those officers were hurt. Outside a large group of students gathered earlier attempting to force their way into the library. Remember, the school was a site of those encampments last year protesting Israel's war in Gaza. Now a major target of President Trump over allegations of anti-Semitism. Let's get right over to NBC's Emily Akeda over at Columbia University right now. Emily, I saw something happening behind you right before we came to you. What's the situation looking like right now and how many people have been removed? Well, Ghani, there's arrests are still underway as we speak. So far, I've counted 78 people ushered out by the NYPD of the library, which you can see behind me just ahead of finals week. They're largely walked out in twos, flanked by police, their hands behind their back, tied with zip ties. One protester had just shouted free Palestine as they had been ushered out by the police. This comes after demonstrations flooded into the school's library earlier this afternoon. Columbia University posting a series of updates and statements first saying that for the protesters who refuse to leave, who refuse to provide identification and disperse, they could face possible arrest. Well, several hours later, they called in the NYPD, and that is what you see behind me. These are special response teams who have been going in and out of the library that university officials say had been occupied by protesters. It's not just tension spilling over inside of the campus, but also outside, maybe about 50 yards or so from where I'm standing. You might even be able to make out the demonstration still underway right now. But earlier, there were some serious physical clashes between pro-Palestinian protesters and police, police trying to use these barricades you'll see behind me to push people back. And then the protesters then pushing back and forth there. Earlier today, it was campus police security officers who have been trying to hold this building on lockdown. And the university said that two campus officers were injured, as they say. Some pro-Palestinian protesters had tried to force their way into the library, Gadi. This all comes amid President Trump, the Trump administration's crackdown on what they call harassment of Jewish American students, even cutting hundreds of millions of dollars of funding to federal funding to Columbia University, trying to stem pro-Palestinian protests, Gadi. I mean, and so the protests that are there right now, the ones that we could hear chanting in the background, is it still a very sizable group or does it seem like things are starting to disperse? It is a sizable group outside of campus. It's hard to say how many people are still in here. Like I mentioned, there are more than 70 people that have been arrested. I've seen social media posts estimating 100 people, at least 100 people, had gotten into the building. So not to—it's unclear how many people may still be in the library, but outside we continue to see protests. They continue to move throughout the campus. You hear those calls for divestment from Israeli-backed companies from the school and protection from ICE on campus, Gadi, as we've heard before. Columbia University posting a statement that reads, in part, And again, all of this happening right before finals week, right? So what kind of disruption are we talking here? Yeah, well, I mean, I heard from one student who had been in the area. A lot of people, obviously, the week before finals, this is a place that they're going to be hanging out. So when they're evacuating other students who have been studying, when they're putting this library on— Thanks for watching. Stay updated about breaking news and top stories on the NBC News app or follow us on social media.\", 'segments': [{'id': 0, 'start': 0.0, 'end': 2.2799999713897705, 'text': ' And some breaking news to tell you about right now.'}, {'id': 1, 'start': 2.2799999713897705, 'end': 7.239999771118164, 'text': ' Within the last few minutes, Columbia University directing NYPD onto their campus to remove'}, {'id': 2, 'start': 7.239999771118164, 'end': 10.5600004196167, 'text': \" protesters who refused to leave the school's library.\"}, {'id': 3, 'start': 10.5600004196167, 'end': 15.079999923706055, 'text': ' Now, you can see police officers, some of them even in riot gear, removing some of those'}, {'id': 4, 'start': 15.079999923706055, 'end': 16.719999313354492, 'text': ' students in zip ties.'}, {'id': 5, 'start': 16.719999313354492, 'end': 20.8799991607666, 'text': ' And right outside, clashes between police and protesters turned violent with those heavy'}, {'id': 6, 'start': 20.8799991607666, 'end': 23.260000228881836, 'text': ' metal barriers being pushed into the air.'}, {'id': 7, 'start': 23.260000228881836, 'end': 27.040000915527344, 'text': ' And this is what the scene looked like inside a Butler library a little bit earlier.'}, {'id': 8, 'start': 27.040000915527344, 'end': 31.079999923706055, 'text': ' Students protesting in a standoff with school public safety officers.'}, {'id': 9, 'start': 31.079999923706055, 'end': 34.119998931884766, 'text': ' The school is saying two of those officers were hurt.'}, {'id': 10, 'start': 34.119998931884766, 'end': 38.08000183105469, 'text': ' Outside a large group of students gathered earlier attempting to force their way into'}, {'id': 11, 'start': 38.08000183105469, 'end': 39.08000183105469, 'text': ' the library.'}, {'id': 12, 'start': 39.08000183105469, 'end': 44.400001525878906, 'text': \" Remember, the school was a site of those encampments last year protesting Israel's war in Gaza.\"}, {'id': 13, 'start': 44.400001525878906, 'end': 48.31999969482422, 'text': ' Now a major target of President Trump over allegations of anti-Semitism.'}, {'id': 14, 'start': 48.31999969482422, 'end': 52.880001068115234, 'text': \" Let's get right over to NBC's Emily Akeda over at Columbia University right now.\"}, {'id': 15, 'start': 52.880001068115234, 'end': 57.0, 'text': ' Emily, I saw something happening behind you right before we came to you.'}, {'id': 16, 'start': 57.0, 'end': 60.79999923706055, 'text': \" What's the situation looking like right now and how many people have been removed?\"}, {'id': 17, 'start': 60.79999923706055, 'end': 67.04000091552734, 'text': \" Well, Ghani, there's arrests are still underway as we speak.\"}, {'id': 18, 'start': 67.04000091552734, 'end': 72.44000244140625, 'text': \" So far, I've counted 78 people ushered out by the NYPD of the library, which you can\"}, {'id': 19, 'start': 72.44000244140625, 'end': 75.76000213623047, 'text': ' see behind me just ahead of finals week.'}, {'id': 20, 'start': 75.76000213623047, 'end': 80.4800033569336, 'text': \" They're largely walked out in twos, flanked by police, their hands behind their back,\"}, {'id': 21, 'start': 80.4800033569336, 'end': 82.08000183105469, 'text': ' tied with zip ties.'}, {'id': 22, 'start': 82.08000183105469, 'end': 87.12000274658203, 'text': ' One protester had just shouted free Palestine as they had been ushered out by the police.'}, {'id': 23, 'start': 87.12000274658203, 'end': 92.63999938964844, 'text': \" This comes after demonstrations flooded into the school's library earlier this afternoon.\"}, {'id': 24, 'start': 92.63999938964844, 'end': 98.31999969482422, 'text': ' Columbia University posting a series of updates and statements first saying that for the protesters'}, {'id': 25, 'start': 98.31999969482422, 'end': 103.12000274658203, 'text': ' who refuse to leave, who refuse to provide identification and disperse, they could face'}, {'id': 26, 'start': 103.12000274658203, 'end': 104.27999877929688, 'text': ' possible arrest.'}, {'id': 27, 'start': 104.27999877929688, 'end': 108.4800033569336, 'text': ' Well, several hours later, they called in the NYPD, and that is what you see behind'}, {'id': 28, 'start': 108.4800033569336, 'end': 109.4800033569336, 'text': ' me.'}, {'id': 29, 'start': 109.4800033569336, 'end': 114.0, 'text': ' These are special response teams who have been going in and out of the library that'}, {'id': 30, 'start': 114.0, 'end': 117.80000305175781, 'text': ' university officials say had been occupied by protesters.'}, {'id': 31, 'start': 117.80000305175781, 'end': 122.63999938964844, 'text': \" It's not just tension spilling over inside of the campus, but also outside, maybe about\"}, {'id': 32, 'start': 122.63999938964844, 'end': 125.63999938964844, 'text': \" 50 yards or so from where I'm standing.\"}, {'id': 33, 'start': 125.63999938964844, 'end': 129.24000549316406, 'text': ' You might even be able to make out the demonstration still underway right now.'}, {'id': 34, 'start': 129.24000549316406, 'end': 133.3800048828125, 'text': ' But earlier, there were some serious physical clashes between pro-Palestinian protesters'}, {'id': 35, 'start': 133.3800048828125, 'end': 138.47999572753906, 'text': \" and police, police trying to use these barricades you'll see behind me to push people back.\"}, {'id': 36, 'start': 138.47999572753906, 'end': 141.83999633789062, 'text': ' And then the protesters then pushing back and forth there.'}, {'id': 37, 'start': 141.83999633789062, 'end': 146.39999389648438, 'text': ' Earlier today, it was campus police security officers who have been trying to hold this'}, {'id': 38, 'start': 146.39999389648438, 'end': 147.63999938964844, 'text': ' building on lockdown.'}, {'id': 39, 'start': 147.63999938964844, 'end': 153.0800018310547, 'text': ' And the university said that two campus officers were injured, as they say.'}, {'id': 40, 'start': 153.0800018310547, 'end': 157.63999938964844, 'text': ' Some pro-Palestinian protesters had tried to force their way into the library, Gadi.'}, {'id': 41, 'start': 157.63999938964844, 'end': 161.9600067138672, 'text': \" This all comes amid President Trump, the Trump administration's crackdown on what they call\"}, {'id': 42, 'start': 161.9600067138672, 'end': 166.8000030517578, 'text': ' harassment of Jewish American students, even cutting hundreds of millions of dollars of'}, {'id': 43, 'start': 166.8800048828125, 'end': 172.1199951171875, 'text': ' funding to federal funding to Columbia University, trying to stem pro-Palestinian protests, Gadi.'}, {'id': 44, 'start': 172.1199951171875, 'end': 177.67999267578125, 'text': ' I mean, and so the protests that are there right now, the ones that we could hear chanting'}, {'id': 45, 'start': 177.67999267578125, 'end': 181.9199981689453, 'text': ' in the background, is it still a very sizable group or does it seem like things are starting'}, {'id': 46, 'start': 181.9199981689453, 'end': 182.9199981689453, 'text': ' to disperse?'}, {'id': 47, 'start': 182.9199981689453, 'end': 189.24000549316406, 'text': ' It is a sizable group outside of campus.'}, {'id': 48, 'start': 189.24000549316406, 'end': 191.1199951171875, 'text': \" It's hard to say how many people are still in here.\"}, {'id': 49, 'start': 191.1199951171875, 'end': 193.60000610351562, 'text': ' Like I mentioned, there are more than 70 people that have been arrested.'}, {'id': 50, 'start': 193.60000610351562, 'end': 198.27999877929688, 'text': \" I've seen social media posts estimating 100 people, at least 100 people, had gotten into\"}, {'id': 51, 'start': 198.27999877929688, 'end': 199.27999877929688, 'text': ' the building.'}, {'id': 52, 'start': 199.27999877929688, 'end': 203.16000366210938, 'text': \" So not to—it's unclear how many people may still be in the library, but outside we continue\"}, {'id': 53, 'start': 203.16000366210938, 'end': 204.16000366210938, 'text': ' to see protests.'}, {'id': 54, 'start': 204.16000366210938, 'end': 205.9600067138672, 'text': ' They continue to move throughout the campus.'}, {'id': 55, 'start': 205.9600067138672, 'end': 212.16000366210938, 'text': ' You hear those calls for divestment from Israeli-backed companies from the school and protection from'}, {'id': 56, 'start': 212.16000366210938, 'end': 214.63999938964844, 'text': \" ICE on campus, Gadi, as we've heard before.\"}, {'id': 57, 'start': 214.63999938964844, 'end': 217.63999938964844, 'text': ' Columbia University posting a statement that reads, in part,'}, {'id': 58, 'start': 217.63999938964844, 'end': 241.36000061035156, 'text': ' And again, all of this happening right before finals week, right?'}, {'id': 59, 'start': 241.36000061035156, 'end': 245.1999969482422, 'text': ' So what kind of disruption are we talking here?'}, {'id': 60, 'start': 245.1999969482422, 'end': 250.52000427246094, 'text': ' Yeah, well, I mean, I heard from one student who had been in the area.'}, {'id': 61, 'start': 250.52000427246094, 'end': 253.9199981689453, 'text': \" A lot of people, obviously, the week before finals, this is a place that they're going\"}, {'id': 62, 'start': 253.9199981689453, 'end': 255.0, 'text': ' to be hanging out.'}, {'id': 63, 'start': 255.0, 'end': 259.3599853515625, 'text': \" So when they're evacuating other students who have been studying, when they're putting\"}, {'id': 64, 'start': 259.3599853515625, 'end': 260.7200012207031, 'text': ' this library on—'}, {'id': 65, 'start': 260.7200012207031, 'end': 261.7200012207031, 'text': ' Thanks for watching.'}, {'id': 66, 'start': 261.7200012207031, 'end': 268.0, 'text': ' Stay updated about breaking news and top stories on the NBC News app or follow us on social'}, {'id': 67, 'start': 268.0, 'end': 268.5199890136719, 'text': ' media.'}]}"