"{'text': \"I just heard about it. I guess people knew something was going to happen. Based on a little bit of the past, they've been fighting for a long time, you know, they've been fighting for many, many decades and centuries, actually, if you really think about it. No, I just hope it ends very quickly. India announced that precise strikes have been carried out against nine targets in Pakistan and Pakistan-occupied Kashmir to take down terror infrastructure. The strikes are in response to the killing of 26 civilians, mostly tourists, who were targeted by terrorists in Pahalgam. Named Operation Sindhur, the strikes hit terrorist infrastructure in Pakistan and Pakistan-occupied Jammu and Kashmir, from where terrorist attacks against India have been planned and directed, officials said. They said that nine sites were targeted and the action carried out are focused, measured and non-escalatory in nature. It was also made clear that no Pakistani military facilities have been targeted. India has demonstrated considerable restraint in selection of targets and method of execution. These steps come in the wake of barbaric Pahalgam terrorist attack in which 25 Indians and one Nepali citizen were murdered. We are living up to the commitment that those responsible for this attack will be held accountable, officials said. Post-India strike, Pakistan has again violated the ceasefire agreement by firing artillery in Bhimber Gali in Poonch Rajouri area. The Indian army said it is responding appropriately in a calibrated manner. Pakistan army has also confirmed India's strikes. DGISPR spokesperson said India has carried out air strikes at Bahawalpur, Kotli and Muzaffarabad from its own airspace. He claimed that Pakistan Air Force jets are fully airborne and Pakistan will retaliate at a time and place of their choosing. For more information visit www.dfid.gov.uk\", 'segments': [{'id': 0, 'start': 0.0, 'end': 9.720000267028809, 'text': ' I just heard about it.'}, {'id': 1, 'start': 9.720000267028809, 'end': 11.520000457763672, 'text': ' I guess people knew something was going to happen.'}, {'id': 2, 'start': 30.0, 'end': 51.08000183105469, 'text': \" Based on a little bit of the past, they've been fighting for a long time, you know, they've\"}, {'id': 3, 'start': 51.08000183105469, 'end': 58.040000915527344, 'text': ' been fighting for many, many decades and centuries, actually, if you really think about it.'}, {'id': 4, 'start': 58.439998626708984, 'end': 60.279998779296875, 'text': ' No, I just hope it ends very quickly.'}, {'id': 5, 'start': 61.720001220703125, 'end': 70.16000366210938, 'text': ' India announced that precise strikes have been carried out against nine targets in Pakistan and Pakistan-occupied Kashmir to take down terror infrastructure.'}, {'id': 6, 'start': 71.08000183105469, 'end': 77.83999633789062, 'text': ' The strikes are in response to the killing of 26 civilians, mostly tourists, who were targeted by terrorists in Pahalgam.'}, {'id': 7, 'start': 78.27999877929688, 'end': 87.68000030517578, 'text': ' Named Operation Sindhur, the strikes hit terrorist infrastructure in Pakistan and Pakistan-occupied Jammu and Kashmir, from where terrorist attacks against India have been'}, {'id': 8, 'start': 87.72000122070312, 'end': 90.08000183105469, 'text': ' planned and directed, officials said.'}, {'id': 9, 'start': 91.4800033569336, 'end': 98.55999755859375, 'text': ' They said that nine sites were targeted and the action carried out are focused, measured and non-escalatory in nature.'}, {'id': 10, 'start': 99.16000366210938, 'end': 103.68000030517578, 'text': ' It was also made clear that no Pakistani military facilities have been targeted.'}, {'id': 11, 'start': 105.36000061035156, 'end': 111.0, 'text': ' India has demonstrated considerable restraint in selection of targets and method of execution.'}, {'id': 12, 'start': 111.83999633789062, 'end': 119.23999786376953, 'text': ' These steps come in the wake of barbaric Pahalgam terrorist attack in which 25 Indians and one Nepali citizen were murdered.'}, {'id': 13, 'start': 119.91999816894531, 'end': 126.44000244140625, 'text': ' We are living up to the commitment that those responsible for this attack will be held accountable, officials said.'}, {'id': 14, 'start': 127.76000213623047, 'end': 136.0800018310547, 'text': ' Post-India strike, Pakistan has again violated the ceasefire agreement by firing artillery in Bhimber Gali in Poonch Rajouri area.'}, {'id': 15, 'start': 136.36000061035156, 'end': 140.9600067138672, 'text': ' The Indian army said it is responding appropriately in a calibrated manner.'}, {'id': 16, 'start': 142.0, 'end': 145.63999938964844, 'text': \" Pakistan army has also confirmed India's strikes.\"}, {'id': 17, 'start': 145.63999938964844, 'end': 153.47999572753906, 'text': ' DGISPR spokesperson said India has carried out air strikes at Bahawalpur, Kotli and Muzaffarabad from its own airspace.'}, {'id': 18, 'start': 153.47999572753906, 'end': 160.83999633789062, 'text': ' He claimed that Pakistan Air Force jets are fully airborne and Pakistan will retaliate at a time and place of their choosing.'}, {'id': 19, 'start': 201.0, 'end': 209.0399932861328, 'text': ' For more information visit www.dfid.gov.uk'}]}"