"{'text': \"So, that was the scene, and it was sickening. At Columbia University yesterday, at their library, over 100 anti-Israeli protesters stormed the Butler Library on campus in support of Mahmoud Khalil, with over 80 being arrested. The university responded by saying, quote, disruptions to our academic activities will not be tolerated and are violations of our rules and policies. This is especially unacceptable while our students study and prepare for final exams. Eden Yadigar is a Columbia student that witnessed the protest. She was studying, believe it or not, for finals on the first floor, and she joins us now. Eden, what was it like for you as a Jewish student seeing this happen again right in front of you? Thanks for having me. Like you said, I, along with hundreds if not thousands of other students, were just trying to study for finals and complete our coursework when dozens of masked vandals, the vast majority of whom we believe are students, flooded into the library, chanting, free Palestine, calling for an Intifada revolution, and calling in Arabic for one state, one Palestinian state from the river to the sea. Not only was it absolutely shocking and intimidating, but it was disrupting one of the most basic functions of the university. And it's ridiculous to me that almost two years later, since October 7th, since these sort of disruptions have become commonplace, that this happened during finals week. But it does mark a pretty notable shift in how Columbia handled it, because Columbia brought in the NYPD within four hours to arrest these students. And I am cautiously optimistic that they will be held accountable. Every single one of them should be expelled, if not expelled immediately, because they forced the evacuation of the library. Students were trying to study, and we weren't able to do that because of this small group of radical, anti-Israeli, anti-Jewish vandals. We're about to find out how many are students. And with the security you tell me should be saluted, because some got beat up and some got hurt, and they stood there. But why did it take five hours for the NYPD to come? What was the issue there? I'm sure the NYPD could have been there sooner. It's a great question. That's what I'm wondering as well. In comparison to timelines we've seen in the past with last year's building occupation of Hamilton Hall with the encampment, this was record speed for Columbia. And I really appreciate that, because it means that we were able to go back to normal campus life, back to studying sooner. But it is ridiculous that accountability is as difficult as it is. After these protesters stormed into this room, the main reading room in Butler Library, public safety demanded that they show identification, show their Columbia ID, and then they would simply be able to leave. And these protesters ended up claiming that they were being held hostage by public safety because they refused to identify themselves, which is not only just ridiculous and completely opposed to common sense, but also unbelievable to me that they would make a mockery of the fact that there are 59 hostages currently being held by the very terrorist group Hamas that they are praising, including an American 21-year-old who is believed to be alive, Adon Alexander. It is ridiculous that we are even having to focus on this group of ignorant, bigoted kids that are disrupting everyone else's studying and finals week, and it's taking away attention from what matters most, which is getting our hostages home. Eden, I'd love for all of them to be expelled. I don't care if they're going to graduate in two weeks. They should be told you're not graduating from Columbia. And they came out and said this is the reason they did it. As long as Columbia bolsters the violence of empire, we will disrupt your peace and shatter your notions of control if you escalate repression. Yeah, right. They're going to cost their school $400 million because it's been frozen by the federal government. Your parents must be so proud of you to wear the Jewish star so they know exactly what religion you are, and you're going to study through it, and you're going to get a degree, and they're going to have their ridiculous lives to lead. Thanks so much, Eden. Thank you. All right. I'm Steve Ducey. I'm Brian Kilmeade. And I'm Ainsley Earhardt. And click here to subscribe to the Fox News YouTube page to catch our hottest interviews and most compelling analysis.\", 'segments': [{'id': 0, 'start': 0.0, 'end': 17.440000534057617, 'text': ' So, that was the scene, and it was sickening.'}, {'id': 1, 'start': 17.440000534057617, 'end': 22.399999618530273, 'text': ' At Columbia University yesterday, at their library, over 100 anti-Israeli protesters'}, {'id': 2, 'start': 22.399999618530273, 'end': 28.959999084472656, 'text': ' stormed the Butler Library on campus in support of Mahmoud Khalil, with over 80 being arrested.'}, {'id': 3, 'start': 28.959999084472656, 'end': 33.040000915527344, 'text': ' The university responded by saying, quote, disruptions to our academic activities will'}, {'id': 4, 'start': 33.040000915527344, 'end': 37.040000915527344, 'text': ' not be tolerated and are violations of our rules and policies.'}, {'id': 5, 'start': 37.040000915527344, 'end': 41.7599983215332, 'text': ' This is especially unacceptable while our students study and prepare for final exams.'}, {'id': 6, 'start': 41.7599983215332, 'end': 45.52000045776367, 'text': ' Eden Yadigar is a Columbia student that witnessed the protest.'}, {'id': 7, 'start': 45.52000045776367, 'end': 50.36000061035156, 'text': ' She was studying, believe it or not, for finals on the first floor, and she joins us now.'}, {'id': 8, 'start': 50.36000061035156, 'end': 55.939998626708984, 'text': ' Eden, what was it like for you as a Jewish student seeing this happen again right in'}, {'id': 9, 'start': 55.939998626708984, 'end': 58.560001373291016, 'text': ' front of you?'}, {'id': 10, 'start': 58.560001373291016, 'end': 59.560001373291016, 'text': ' Thanks for having me.'}, {'id': 11, 'start': 59.560001373291016, 'end': 63.70000076293945, 'text': ' Like you said, I, along with hundreds if not thousands of other students, were just trying'}, {'id': 12, 'start': 63.70000076293945, 'end': 70.33999633789062, 'text': ' to study for finals and complete our coursework when dozens of masked vandals, the vast majority'}, {'id': 13, 'start': 70.33999633789062, 'end': 75.9000015258789, 'text': ' of whom we believe are students, flooded into the library, chanting, free Palestine, calling'}, {'id': 14, 'start': 75.9000015258789, 'end': 81.33999633789062, 'text': ' for an Intifada revolution, and calling in Arabic for one state, one Palestinian state'}, {'id': 15, 'start': 81.33999633789062, 'end': 83.81999969482422, 'text': ' from the river to the sea.'}, {'id': 16, 'start': 83.81999969482422, 'end': 89.16000366210938, 'text': ' Not only was it absolutely shocking and intimidating, but it was disrupting one of the most basic'}, {'id': 17, 'start': 89.16000366210938, 'end': 91.16000366210938, 'text': ' functions of the university.'}, {'id': 18, 'start': 91.16000366210938, 'end': 96.68000030517578, 'text': \" And it's ridiculous to me that almost two years later, since October 7th, since these\"}, {'id': 19, 'start': 96.68000030517578, 'end': 102.76000213623047, 'text': ' sort of disruptions have become commonplace, that this happened during finals week.'}, {'id': 20, 'start': 102.76000213623047, 'end': 107.36000061035156, 'text': ' But it does mark a pretty notable shift in how Columbia handled it, because Columbia'}, {'id': 21, 'start': 107.36000061035156, 'end': 111.58000183105469, 'text': ' brought in the NYPD within four hours to arrest these students.'}, {'id': 22, 'start': 111.58000183105469, 'end': 115.68000030517578, 'text': ' And I am cautiously optimistic that they will be held accountable.'}, {'id': 23, 'start': 115.68000030517578, 'end': 121.4800033569336, 'text': ' Every single one of them should be expelled, if not expelled immediately, because they'}, {'id': 24, 'start': 121.4800033569336, 'end': 124.12000274658203, 'text': ' forced the evacuation of the library.'}, {'id': 25, 'start': 124.12000274658203, 'end': 128.0399932861328, 'text': \" Students were trying to study, and we weren't able to do that because of this small group\"}, {'id': 26, 'start': 128.0399932861328, 'end': 132.47999572753906, 'text': ' of radical, anti-Israeli, anti-Jewish vandals.'}, {'id': 27, 'start': 132.47999572753906, 'end': 135.32000732421875, 'text': \" We're about to find out how many are students.\"}, {'id': 28, 'start': 135.32000732421875, 'end': 140.32000732421875, 'text': ' And with the security you tell me should be saluted, because some got beat up and some'}, {'id': 29, 'start': 140.32000732421875, 'end': 141.82000732421875, 'text': ' got hurt, and they stood there.'}, {'id': 30, 'start': 141.82000732421875, 'end': 145.10000610351562, 'text': ' But why did it take five hours for the NYPD to come?'}, {'id': 31, 'start': 145.10000610351562, 'end': 146.5399932861328, 'text': ' What was the issue there?'}, {'id': 32, 'start': 146.5399932861328, 'end': 149.97999572753906, 'text': \" I'm sure the NYPD could have been there sooner.\"}, {'id': 33, 'start': 149.97999572753906, 'end': 150.97999572753906, 'text': \" It's a great question.\"}, {'id': 34, 'start': 150.97999572753906, 'end': 152.74000549316406, 'text': \" That's what I'm wondering as well.\"}, {'id': 35, 'start': 152.74000549316406, 'end': 157.5800018310547, 'text': \" In comparison to timelines we've seen in the past with last year's building occupation\"}, {'id': 36, 'start': 157.5800018310547, 'end': 162.25999450683594, 'text': ' of Hamilton Hall with the encampment, this was record speed for Columbia.'}, {'id': 37, 'start': 162.25999450683594, 'end': 167.3800048828125, 'text': ' And I really appreciate that, because it means that we were able to go back to normal campus'}, {'id': 38, 'start': 167.3800048828125, 'end': 169.74000549316406, 'text': ' life, back to studying sooner.'}, {'id': 39, 'start': 169.74000549316406, 'end': 175.27999877929688, 'text': ' But it is ridiculous that accountability is as difficult as it is.'}, {'id': 40, 'start': 175.27999877929688, 'end': 180.1199951171875, 'text': ' After these protesters stormed into this room, the main reading room in Butler Library, public'}, {'id': 41, 'start': 180.1199951171875, 'end': 185.52000427246094, 'text': ' safety demanded that they show identification, show their Columbia ID, and then they would'}, {'id': 42, 'start': 185.52000427246094, 'end': 187.32000732421875, 'text': ' simply be able to leave.'}, {'id': 43, 'start': 187.32000732421875, 'end': 192.27999877929688, 'text': ' And these protesters ended up claiming that they were being held hostage by public safety'}, {'id': 44, 'start': 192.27999877929688, 'end': 197.75999450683594, 'text': ' because they refused to identify themselves, which is not only just ridiculous and completely'}, {'id': 45, 'start': 197.75999450683594, 'end': 202.89999389648438, 'text': ' opposed to common sense, but also unbelievable to me that they would make a mockery of the'}, {'id': 46, 'start': 202.89999389648438, 'end': 208.1199951171875, 'text': ' fact that there are 59 hostages currently being held by the very terrorist group Hamas'}, {'id': 47, 'start': 208.1199951171875, 'end': 213.83999633789062, 'text': ' that they are praising, including an American 21-year-old who is believed to be alive, Adon'}, {'id': 48, 'start': 213.83999633789062, 'end': 214.83999633789062, 'text': ' Alexander.'}, {'id': 49, 'start': 214.83999633789062, 'end': 219.9199981689453, 'text': ' It is ridiculous that we are even having to focus on this group of ignorant, bigoted kids'}, {'id': 50, 'start': 219.9199981689453, 'end': 227.0399932861328, 'text': \" that are disrupting everyone else's studying and finals week, and it's taking away attention\"}, {'id': 51, 'start': 227.0399932861328, 'end': 230.17999267578125, 'text': ' from what matters most, which is getting our hostages home.'}, {'id': 52, 'start': 230.17999267578125, 'end': 232.82000732421875, 'text': \" Eden, I'd love for all of them to be expelled.\"}, {'id': 53, 'start': 232.82000732421875, 'end': 234.86000061035156, 'text': \" I don't care if they're going to graduate in two weeks.\"}, {'id': 54, 'start': 234.86000061035156, 'end': 237.5399932861328, 'text': \" They should be told you're not graduating from Columbia.\"}, {'id': 55, 'start': 237.5399932861328, 'end': 240.17999267578125, 'text': ' And they came out and said this is the reason they did it.'}, {'id': 56, 'start': 240.17999267578125, 'end': 244.82000732421875, 'text': ' As long as Columbia bolsters the violence of empire, we will disrupt your peace and'}, {'id': 57, 'start': 244.82000732421875, 'end': 248.89999389648438, 'text': ' shatter your notions of control if you escalate repression.'}, {'id': 58, 'start': 248.89999389648438, 'end': 249.89999389648438, 'text': ' Yeah, right.'}, {'id': 59, 'start': 249.89999389648438, 'end': 255.5800018310547, 'text': \" They're going to cost their school $400 million because it's been frozen by the federal government.\"}, {'id': 60, 'start': 255.8000030517578, 'end': 260.3999938964844, 'text': ' Your parents must be so proud of you to wear the Jewish star so they know exactly what'}, {'id': 61, 'start': 260.3999938964844, 'end': 264.7200012207031, 'text': \" religion you are, and you're going to study through it, and you're going to get a degree,\"}, {'id': 62, 'start': 264.7200012207031, 'end': 267.0400085449219, 'text': \" and they're going to have their ridiculous lives to lead.\"}, {'id': 63, 'start': 267.0400085449219, 'end': 269.0799865722656, 'text': ' Thanks so much, Eden.'}, {'id': 64, 'start': 269.0799865722656, 'end': 270.0799865722656, 'text': ' Thank you.'}, {'id': 65, 'start': 270.0799865722656, 'end': 271.0799865722656, 'text': ' All right.'}, {'id': 66, 'start': 271.0799865722656, 'end': 272.0799865722656, 'text': \" I'm Steve Ducey.\"}, {'id': 67, 'start': 272.0799865722656, 'end': 273.0799865722656, 'text': \" I'm Brian Kilmeade.\"}, {'id': 68, 'start': 273.0799865722656, 'end': 274.0799865722656, 'text': \" And I'm Ainsley Earhardt.\"}, {'id': 69, 'start': 274.0799865722656, 'end': 277.7200012207031, 'text': ' And click here to subscribe to the Fox News YouTube page to catch our hottest interviews'}, {'id': 70, 'start': 277.7200012207031, 'end': 279.55999755859375, 'text': ' and most compelling analysis.'}]}"