"{'text': \"On January 23rd, 2025, the Dayton International Airport Police Department was called to the scene to the Amazon warehouse for reports of a potential trespass with an employee. The following shows the body-worn camera footage of what happened during the incident. All right, well, I'm just going to shadow you until you figure out where she's at. Is that okay? All right. Hey, Alex, what is your location? Copy that, I am heading your way. How long has she been employed here? She was a seasonal hire, so I want to say November, maybe? You can cancel checks. I'm good. I'm sorry, how long has she been? Since about November. Okay, is she still seasonal? Yes, she's right here. Walking towards us? No, ma'am. On schedule, like if I wasn't on schedule. I'm not going to continue having this conversation with you. I explained to you in detail. I showed you your schedule. I showed you the proof that you were not here. I understand it's a misunderstanding, but you are being insubordinate and might ask to have you leave the site. Because I have asked you multiple times to clock out and go home. I just talked to her and I'm not having an argument with you. Officer Sacks is going to help me escort you. Ma'am, if you can just gather up your stuff and leave. No, I just need your device and your badge, please. I think maybe. Diamond, I don't need to see your proof. Ma'am, I'm about to show them. We've gone through this already. I understand. Is there something we can do for you? Alex is helping me with a situation. He had the conversation with me asking to leave the site. Ma'am, how long? How much longer will it be? Are you actually logging into your app or are you showing us a screenshot? Okay, so can we go ahead and step out off the floor, please? Diamond, respectfully, I've given you multiple seconds. Ma'am, can we just go to the lunchroom? That's not leaving the building, but it's in the lunchroom. That way we can all hear better, okay? Can everyone just walk this way, please? Okay, ma'am, how much longer is this going to take? So have you found your schedule? Okay, ma'am, either you've found it or you can't find it. I'm not leaving because I'm supposed to actually leave today. Well, I'm giving you an opportunity to show me this. How long is it going to take because I cannot wait all day. Ma'am, I'm not going to wait all day, ma'am. Okay, ma'am, what are you looking at? And are you supposed to be here today? Yes. Where does it say that? We do have the schedule pulled up where it shows that she's not scheduled. Can you show me, please? Because she's not cooperating. We're going to verify the name. I'm sorry, his computer is very tiny. I asked earlier, has no trespassing been authorized? I have been authorized to get you on site. I can call and verify. Give me one second. Ma'am, are you making any progress? Ma'am, you've told me that several times. I asked if you're making progress. Okay, thank you, sir. Okay, thank you. Bye-bye. Yes, she said I have the authorization. Okay, can you say that in a definitive that you want to trespass? Yes. Can I have your attention? Yeah. Okay, here's the situation. You either leave or they're trespassing you. And if you don't leave them, it means you have to leave. You do not have a choice. No, if they trespass you, you have to leave. If you do not leave. I thought that was if I'm not on the schedule. I'm actually on the schedule. The schedule has nothing to do with it. Yes, it does. Ma'am, what am I trespassing for? I'm not bothering nobody. They have told you to leave for the day. But I'm supposed to be on the schedule. That is irrelevant. My schedule is about to be up. That is irrelevant. I will leave as soon as it's over. That is irrelevant. You need to leave. If you do not leave, you can be arrested for trespassing. How can I be arrested for trespassing? Because I will arrest you. So are you going to leave or not? Ma'am, yes or no. Are you going to leave voluntarily or are you going to be arrested for trespassing? How am I arrested when I'm on the schedule? Whether you're on the schedule or not is irrelevant to me. How am I being trusted? That's not making sense. Last time I'm asking. Last time I'm asking, ma'am, are you going to leave voluntarily or not? I'm asking you, what am I being? You're under arrest for trespassing. Ma'am, get off of me. I'm not doing it. You are under arrest for trespassing. No. Why am I trespassing? Because I'm supposed to be on the schedule. They've said you need to leave. Sir, I'm walking away. Please don't touch me. What are you doing? I'm not doing anything to you, sir. I'm not. I'm just on the schedule. Oh my god. Are you serious? Yes. Put the phone down. Put the phone down. No. Then turn over. For what? You're under arrest. I'm on the schedule. You are under arrest for trespassing and not complying. I'm on the schedule. What's wrong with you? You're under arrest for trespassing. I'm not doing anything, sir. I'm not touching you. I'm not yelling. You're under arrest for trespassing. How am I? I'm about to. I'll leave. I'll leave. I'm on the schedule, sir. Put your arm behind your back. You're under arrest for what? Trespassing. For trespassing. You were asked multiple times to leave. Because if you're going to put me in jail for trespassing, I'm going to leave. I'm being trespassed for being on the schedule? Yes. I'm being trespassed for being on the schedule. That's crazy. What am I doing? I'm on the schedule. I'm on the schedule today and I'm being trespassed. You just brought me to the grave. I have one in custody. I'm not being aggressive. Is there backup available? Do you have a second unit available? Can you bring us a second unit because I need to see the other provider. Is this? Can you please come and take it? Where are we on? We're right behind you. Amazon. Turn into detention. Because it's not. Can you put somebody at the door? For when an officer shows up, they can get let in. What am I going to do for you? I'm going to jail for being on the schedule. No ma'am. You were told that you were not working today and you were to leave. You refused to leave despite multiple requests. A trespass was issued. You ignored it. You were under arrest for violation of trespass. I'm on the schedule. How am I being trespassed for working? I have a bag. How are you going to trespass somebody who has a bag? Can I call my mom? No. I cannot call my mom. No. And I'm supposed to be here. You can call her after things have been worked out. What needs to be worked out? I'm on the schedule. You're putting me out for being on the schedule. How are you going to trespass somebody? Hey Mitch. What's going on? This gentleman was asking if we were able to provide the information. A copy of the personal information she's provided Amazon. And then I'll be needing a statement from you. How late do you work today? For a couple hours? Until 1 30. Yeah. Okay. I can go get that thing around my computer. And then I just need a report number for my law intervention team. Okay. So let me grab my computer and I'll get back with that info. You're just refusing to get up? She's under arrest for trespass. She's not supposed to be here today. She's refusing to leave the floor. Refused to leave. Perfect. So at this point I was just waiting for backup so I can go through her purse to try and find an ID. Do you have a Miranda card on you? I do not. We'll get it. We'll take care of it in the car. Dispatch, all units, EGPS is completed. Do me a favor. Roll over towards this knee and play it underground. I'll help you get up. Money is clear. Just information. I'll be en route to that. Sir, can I ask you to hold these items, these personal items? Is that glove hers? We will need the items. Okay. Do you have a key? Okay. Does she have a second one? It looks like she's wearing it. Okay. So she can take it. We can get it. There you go. And then if you could hand me her purse. Okay. Okay. Okay. Okay. Then if you could hand me her personal items. Okay. Okay, ma'am. Okay. If you could stand over here. Do not enter the vehicle yet. I'll take everything out of your pockets here for you. You got anything on you that shouldn't be? Please get in the vehicle. Watch your head. I'm going to buckle you in. Okay. I'm going to start it so she's got heat going on. Got it. Thanks. Appreciate you helping out, Mitch. I'll meet you back at the office. Head back to the front seat. We'll go through that stuff, too. Yeah, I'll put it into evidence and stuff. If you want, I'll do the transport. I'd appreciate that because I got to write the report. We'll get it done. We'll get it knocked out. All right, man. Okay. All suspects are innocent until proven guilty. Thank you for watching.\", 'segments': [{'id': 0, 'start': 0.0, 'end': 7.599999904632568, 'text': ' On January 23rd, 2025, the Dayton International Airport Police Department was called to the scene'}, {'id': 1, 'start': 7.599999904632568, 'end': 12.239999771118164, 'text': ' to the Amazon warehouse for reports of a potential trespass with an employee.'}, {'id': 2, 'start': 12.800000190734863, 'end': 17.600000381469727, 'text': ' The following shows the body-worn camera footage of what happened during the incident.'}, {'id': 3, 'start': 21.360000610351562, 'end': 25.920000076293945, 'text': \" All right, well, I'm just going to shadow you until you figure out where she's at. Is that okay?\"}, {'id': 4, 'start': 26.479999542236328, 'end': 30.719999313354492, 'text': ' All right. Hey, Alex, what is your location?'}, {'id': 5, 'start': 41.599998474121094, 'end': 44.0, 'text': ' Copy that, I am heading your way.'}, {'id': 6, 'start': 44.0, 'end': 60.31999969482422, 'text': ' How long has she been employed here? She was a seasonal hire, so I want to say November, maybe?'}, {'id': 7, 'start': 62.560001373291016, 'end': 65.27999877929688, 'text': \" You can cancel checks. I'm good.\"}, {'id': 8, 'start': 68.0, 'end': 71.04000091552734, 'text': \" I'm sorry, how long has she been? Since about November.\"}, {'id': 9, 'start': 71.04000091552734, 'end': 73.76000213623047, 'text': \" Okay, is she still seasonal? Yes, she's right here.\"}, {'id': 10, 'start': 78.80000305175781, 'end': 81.36000061035156, 'text': ' Walking towards us?'}, {'id': 11, 'start': 101.04000091552734, 'end': 127.5999984741211, 'text': \" No, ma'am.\"}, {'id': 12, 'start': 131.36000061035156, 'end': 135.1999969482422, 'text': \" On schedule, like if I wasn't on schedule.\"}, {'id': 13, 'start': 136.8800048828125, 'end': 140.72000122070312, 'text': \" I'm not going to continue having this conversation with you. I explained to you in detail. I showed\"}, {'id': 14, 'start': 140.72000122070312, 'end': 145.60000610351562, 'text': \" you your schedule. I showed you the proof that you were not here. I understand it's a\"}, {'id': 15, 'start': 145.60000610351562, 'end': 150.63999938964844, 'text': ' misunderstanding, but you are being insubordinate and might ask to have you leave the site.'}, {'id': 16, 'start': 152.55999755859375, 'end': 156.39999389648438, 'text': ' Because I have asked you multiple times to clock out and go home.'}, {'id': 17, 'start': 156.47999572753906, 'end': 161.36000061035156, 'text': \" I just talked to her and I'm not having an argument with you. Officer Sacks is going to\"}, {'id': 18, 'start': 161.36000061035156, 'end': 166.0, 'text': \" help me escort you. Ma'am, if you can just gather up your stuff and leave. No, I just need your\"}, {'id': 19, 'start': 166.0, 'end': 171.1999969482422, 'text': \" device and your badge, please. I think maybe. Diamond, I don't need to see your proof. Ma'am,\"}, {'id': 20, 'start': 172.55999755859375, 'end': 182.16000366210938, 'text': \" I'm about to show them. We've gone through this already. I understand.\"}, {'id': 21, 'start': 187.36000061035156, 'end': 191.52000427246094, 'text': ' Is there something we can do for you? Alex is helping me with a situation. He'}, {'id': 22, 'start': 191.52000427246094, 'end': 196.16000366210938, 'text': ' had the conversation with me asking to leave the site.'}, {'id': 23, 'start': 207.9199981689453, 'end': 210.16000366210938, 'text': \" Ma'am, how long? How much longer will it be?\"}, {'id': 24, 'start': 216.39999389648438, 'end': 225.83999633789062, 'text': ' Are you actually logging into your app or are you showing us a screenshot?'}, {'id': 25, 'start': 228.16000366210938, 'end': 231.60000610351562, 'text': ' Okay, so can we go ahead and step out off the floor, please?'}, {'id': 26, 'start': 234.8800048828125, 'end': 240.8000030517578, 'text': \" Diamond, respectfully, I've given you multiple seconds. Ma'am, can we just go to the lunchroom?\"}, {'id': 27, 'start': 241.36000061035156, 'end': 245.67999267578125, 'text': \" That's not leaving the building, but it's in the lunchroom. That way we can all hear better, okay?\"}, {'id': 28, 'start': 246.39999389648438, 'end': 251.83999633789062, 'text': ' Can everyone just walk this way, please?'}, {'id': 29, 'start': 276.3999938964844, 'end': 286.1600036621094, 'text': \" Okay, ma'am, how much longer is this going to take?\"}, {'id': 30, 'start': 290.55999755859375, 'end': 291.8399963378906, 'text': ' So have you found your schedule?'}, {'id': 31, 'start': 299.20001220703125, 'end': 301.44000244140625, 'text': \" Okay, ma'am, either you've found it or you can't find it.\"}, {'id': 32, 'start': 301.44000244140625, 'end': 307.760009765625, 'text': \" I'm not leaving because I'm supposed to actually leave today.\"}, {'id': 33, 'start': 309.1199951171875, 'end': 312.6400146484375, 'text': \" Well, I'm giving you an opportunity to show me this.\"}, {'id': 34, 'start': 312.6400146484375, 'end': 314.8800048828125, 'text': ' How long is it going to take because I cannot wait all day.'}, {'id': 35, 'start': 319.3599853515625, 'end': 329.5199890136719, 'text': \" Ma'am, I'm not going to wait all day, ma'am.\"}, {'id': 36, 'start': 329.5199890136719, 'end': 332.0799865722656, 'text': \" Okay, ma'am, what are you looking at?\"}, {'id': 37, 'start': 334.6400146484375, 'end': 338.8800048828125, 'text': ' And are you supposed to be here today? Yes. Where does it say that?'}, {'id': 38, 'start': 347.6000061035156, 'end': 350.55999755859375, 'text': \" We do have the schedule pulled up where it shows that she's not scheduled.\"}, {'id': 39, 'start': 350.55999755859375, 'end': 353.67999267578125, 'text': \" Can you show me, please? Because she's not cooperating.\"}, {'id': 40, 'start': 354.6400146484375, 'end': 359.0400085449219, 'text': \" We're going to verify the name. I'm sorry, his computer is very tiny.\"}, {'id': 41, 'start': 370.1600036621094, 'end': 374.0799865722656, 'text': ' I asked earlier, has no trespassing been authorized?'}, {'id': 42, 'start': 375.5199890136719, 'end': 380.9599914550781, 'text': ' I have been authorized to get you on site. I can call and verify.'}, {'id': 43, 'start': 384.6400146484375, 'end': 385.67999267578125, 'text': ' Give me one second.'}, {'id': 44, 'start': 392.32000732421875, 'end': 393.6000061035156, 'text': \" Ma'am, are you making any progress?\"}, {'id': 45, 'start': 396.1600036621094, 'end': 399.1199951171875, 'text': \" Ma'am, you've told me that several times. I asked if you're making progress.\"}, {'id': 46, 'start': 402.32000732421875, 'end': 410.4800109863281, 'text': ' Okay, thank you, sir. Okay, thank you. Bye-bye. Yes, she said I have the authorization.'}, {'id': 47, 'start': 411.3599853515625, 'end': 416.32000732421875, 'text': ' Okay, can you say that in a definitive that you want to trespass? Yes.'}, {'id': 48, 'start': 418.7200012207031, 'end': 424.0799865722656, 'text': \" Can I have your attention? Yeah. Okay, here's the situation. You either leave\"}, {'id': 49, 'start': 424.8800048828125, 'end': 430.9599914550781, 'text': \" or they're trespassing you. And if you don't leave them, it means you have to leave. You do\"}, {'id': 50, 'start': 430.9599914550781, 'end': 436.6400146484375, 'text': ' not have a choice. No, if they trespass you, you have to leave. If you do not leave. I thought'}, {'id': 51, 'start': 436.7200012207031, 'end': 440.3999938964844, 'text': \" that was if I'm not on the schedule. I'm actually on the schedule. The schedule has nothing to do\"}, {'id': 52, 'start': 440.3999938964844, 'end': 446.9599914550781, 'text': \" with it. Yes, it does. Ma'am, what am I trespassing for? I'm not bothering nobody. They have told you\"}, {'id': 53, 'start': 446.9599914550781, 'end': 453.0400085449219, 'text': \" to leave for the day. But I'm supposed to be on the schedule. That is irrelevant. My schedule\"}, {'id': 54, 'start': 453.0400085449219, 'end': 457.9200134277344, 'text': \" is about to be up. That is irrelevant. I will leave as soon as it's over. That is irrelevant.\"}, {'id': 55, 'start': 460.0799865722656, 'end': 463.67999267578125, 'text': ' You need to leave. If you do not leave, you can be arrested for trespassing.'}, {'id': 56, 'start': 463.67999267578125, 'end': 467.44000244140625, 'text': ' How can I be arrested for trespassing? Because I will arrest you.'}, {'id': 57, 'start': 478.7200012207031, 'end': 480.0, 'text': ' So are you going to leave or not?'}, {'id': 58, 'start': 482.8800048828125, 'end': 488.0, 'text': \" Ma'am, yes or no. Are you going to leave voluntarily or are you going to be arrested\"}, {'id': 59, 'start': 488.0, 'end': 493.9200134277344, 'text': \" for trespassing? How am I arrested when I'm on the schedule? Whether you're on the schedule or\"}, {'id': 60, 'start': 493.9200134277344, 'end': 499.20001220703125, 'text': \" not is irrelevant to me. How am I being trusted? That's not making sense. Last time I'm asking.\"}, {'id': 61, 'start': 500.0799865722656, 'end': 504.6400146484375, 'text': \" Last time I'm asking, ma'am, are you going to leave voluntarily or not? I'm asking you,\"}, {'id': 62, 'start': 504.6400146484375, 'end': 508.9599914550781, 'text': \" what am I being? You're under arrest for trespassing. Ma'am, get off of me. I'm not\"}, {'id': 63, 'start': 508.9599914550781, 'end': 513.52001953125, 'text': \" doing it. You are under arrest for trespassing. No. Why am I trespassing? Because I'm supposed\"}, {'id': 64, 'start': 513.52001953125, 'end': 519.280029296875, 'text': \" to be on the schedule. They've said you need to leave. Sir, I'm walking away. Please don't touch me.\"}, {'id': 65, 'start': 519.280029296875, 'end': 525.52001953125, 'text': \" What are you doing? I'm not doing anything to you, sir. I'm not. I'm just on the schedule. Oh my god.\"}, {'id': 66, 'start': 525.52001953125, 'end': 530.9600219726562, 'text': ' Are you serious? Yes. Put the phone down. Put the phone down. No. Then turn over. For what?'}, {'id': 67, 'start': 530.9600219726562, 'end': 536.1599731445312, 'text': \" You're under arrest. I'm on the schedule. You are under arrest for trespassing and not complying.\"}, {'id': 68, 'start': 536.9600219726562, 'end': 540.47998046875, 'text': \" I'm on the schedule. What's wrong with you?\"}, {'id': 69, 'start': 543.6799926757812, 'end': 548.5599975585938, 'text': \" You're under arrest for trespassing. I'm not doing anything, sir. I'm not touching you. I'm\"}, {'id': 70, 'start': 548.5599975585938, 'end': 555.5999755859375, 'text': \" not yelling. You're under arrest for trespassing. How am I? I'm about to. I'll leave. I'll leave.\"}, {'id': 71, 'start': 555.6799926757812, 'end': 557.0399780273438, 'text': \" I'm on the schedule, sir.\"}, {'id': 72, 'start': 568.5599975585938, 'end': 572.9600219726562, 'text': \" Put your arm behind your back. You're under arrest for what?\"}, {'id': 73, 'start': 572.9600219726562, 'end': 577.52001953125, 'text': ' Trespassing. For trespassing. You were asked multiple times to leave.'}, {'id': 74, 'start': 577.760009765625, 'end': 581.4400024414062, 'text': \" Because if you're going to put me in jail for trespassing, I'm going to leave.\"}, {'id': 75, 'start': 584.719970703125, 'end': 588.47998046875, 'text': \" I'm being trespassed for being on the schedule? Yes.\"}, {'id': 76, 'start': 590.4000244140625, 'end': 597.52001953125, 'text': \" I'm being trespassed for being on the schedule. That's crazy. What am I doing? I'm on the schedule.\"}, {'id': 77, 'start': 598.7999877929688, 'end': 603.2000122070312, 'text': \" I'm on the schedule today and I'm being trespassed. You just brought me to the grave.\"}, {'id': 78, 'start': 603.2000122070312, 'end': 608.0800170898438, 'text': \" I have one in custody. I'm not being aggressive. Is there backup available?\"}, {'id': 79, 'start': 617.280029296875, 'end': 618.7999877929688, 'text': ' Do you have a second unit available?'}, {'id': 80, 'start': 619.760009765625, 'end': 622.9600219726562, 'text': ' Can you bring us a second unit because I need to see the other provider.'}, {'id': 81, 'start': 629.3599853515625, 'end': 631.3599853515625, 'text': ' Is this? Can you please come and take it?'}, {'id': 82, 'start': 631.3599853515625, 'end': 633.1199951171875, 'text': \" Where are we on? We're right behind you.\"}, {'id': 83, 'start': 638.6400146484375, 'end': 639.1199951171875, 'text': ' Amazon.'}, {'id': 84, 'start': 641.280029296875, 'end': 644.4000244140625, 'text': ' Turn into detention.'}, {'id': 85, 'start': 649.760009765625, 'end': 650.4000244140625, 'text': \" Because it's not.\"}, {'id': 86, 'start': 657.8400268554688, 'end': 664.4000244140625, 'text': ' Can you put somebody at the door? For when an officer shows up, they can get let in.'}, {'id': 87, 'start': 669.9199829101562, 'end': 673.5999755859375, 'text': \" What am I going to do for you? I'm going to jail for being on the schedule.\"}, {'id': 88, 'start': 674.5599975585938, 'end': 675.1199951171875, 'text': \" No ma'am.\"}, {'id': 89, 'start': 677.3599853515625, 'end': 679.8400268554688, 'text': ' You were told that you were not working today and you were to leave.'}, {'id': 90, 'start': 680.47998046875, 'end': 686.0, 'text': ' You refused to leave despite multiple requests. A trespass was issued. You ignored it.'}, {'id': 91, 'start': 686.0, 'end': 689.1199951171875, 'text': ' You were under arrest for violation of trespass.'}, {'id': 92, 'start': 693.2000122070312, 'end': 698.0, 'text': \" I'm on the schedule. How am I being trespassed for working? I have a bag.\"}, {'id': 93, 'start': 698.1599731445312, 'end': 703.2000122070312, 'text': ' How are you going to trespass somebody who has a bag?'}, {'id': 94, 'start': 703.9199829101562, 'end': 709.1199951171875, 'text': \" Can I call my mom? No. I cannot call my mom. No. And I'm supposed to be here.\"}, {'id': 95, 'start': 709.9199829101562, 'end': 713.760009765625, 'text': ' You can call her after things have been worked out.'}, {'id': 96, 'start': 714.3200073242188, 'end': 719.0399780273438, 'text': \" What needs to be worked out? I'm on the schedule. You're putting me out for being on the schedule.\"}, {'id': 97, 'start': 720.6400146484375, 'end': 723.9199829101562, 'text': \" How are you going to trespass somebody? Hey Mitch. What's going on?\"}, {'id': 98, 'start': 723.9199829101562, 'end': 726.8800048828125, 'text': ' This gentleman was asking if we were able to provide the information.'}, {'id': 99, 'start': 728.1599731445312, 'end': 732.5599975585938, 'text': \" A copy of the personal information she's provided Amazon. And then I'll be needing\"}, {'id': 100, 'start': 732.5599975585938, 'end': 737.2000122070312, 'text': ' a statement from you. How late do you work today? For a couple hours? Until 1 30. Yeah. Okay.'}, {'id': 101, 'start': 738.239990234375, 'end': 742.239990234375, 'text': ' I can go get that thing around my computer. And then I just need a report number for my'}, {'id': 102, 'start': 742.239990234375, 'end': 745.760009765625, 'text': \" law intervention team. Okay. So let me grab my computer and I'll get back with that info.\"}, {'id': 103, 'start': 746.9600219726562, 'end': 748.0800170898438, 'text': \" You're just refusing to get up?\"}, {'id': 104, 'start': 748.239990234375, 'end': 753.0399780273438, 'text': \" She's under arrest for trespass. She's not supposed to be here today. She's refusing to\"}, {'id': 105, 'start': 753.0399780273438, 'end': 760.1599731445312, 'text': ' leave the floor. Refused to leave. Perfect. So at this point I was just waiting for backup so I can'}, {'id': 106, 'start': 760.1599731445312, 'end': 765.52001953125, 'text': \" go through her purse to try and find an ID. Do you have a Miranda card on you? I do not. We'll\"}, {'id': 107, 'start': 765.52001953125, 'end': 767.3599853515625, 'text': \" get it. We'll take care of it in the car.\"}, {'id': 108, 'start': 767.52001953125, 'end': 772.0, 'text': ' Dispatch, all units, EGPS is completed. Do me a favor. Roll over towards this knee and'}, {'id': 109, 'start': 772.0, 'end': 775.9199829101562, 'text': \" play it underground. I'll help you get up. Money is clear. Just information. I'll be\"}, {'id': 110, 'start': 775.9199829101562, 'end': 781.8400268554688, 'text': ' en route to that. Sir, can I ask you to hold these items, these personal items?'}, {'id': 111, 'start': 784.4000244140625, 'end': 789.2000122070312, 'text': ' Is that glove hers? We will need the items. Okay. Do you have a key?'}, {'id': 112, 'start': 789.2000122070312, 'end': 794.9600219726562, 'text': \" Okay. Does she have a second one? It looks like she's wearing it. Okay.\"}, {'id': 113, 'start': 794.9600219726562, 'end': 796.9600219726562, 'text': ' So she can take it. We can get it.'}, {'id': 114, 'start': 800.3200073242188, 'end': 802.5599975585938, 'text': ' There you go. And then if you could hand me her purse.'}, {'id': 115, 'start': 804.5599975585938, 'end': 805.0399780273438, 'text': ' Okay.'}, {'id': 116, 'start': 807.0399780273438, 'end': 807.5999755859375, 'text': ' Okay.'}, {'id': 117, 'start': 810.0800170898438, 'end': 810.6400146484375, 'text': ' Okay.'}, {'id': 118, 'start': 810.6400146484375, 'end': 816.0800170898438, 'text': ' Okay.'}, {'id': 119, 'start': 818.0800170898438, 'end': 830.0800170898438, 'text': ' Then if you could hand me her personal items.'}, {'id': 120, 'start': 840.6400146484375, 'end': 846.0800170898438, 'text': ' Okay.'}, {'id': 121, 'start': 858.4000244140625, 'end': 860.0800170898438, 'text': \" Okay, ma'am.\"}, {'id': 122, 'start': 860.0800170898438, 'end': 861.52001953125, 'text': ' Okay.'}, {'id': 123, 'start': 866.3200073242188, 'end': 868.6400146484375, 'text': ' If you could stand over here. Do not enter the vehicle yet.'}, {'id': 124, 'start': 873.0399780273438, 'end': 875.52001953125, 'text': \" I'll take everything out of your pockets here for you.\"}, {'id': 125, 'start': 877.8400268554688, 'end': 878.9600219726562, 'text': \" You got anything on you that shouldn't be?\"}, {'id': 126, 'start': 881.8400268554688, 'end': 883.5999755859375, 'text': ' Please get in the vehicle. Watch your head.'}, {'id': 127, 'start': 886.239990234375, 'end': 889.52001953125, 'text': \" I'm going to buckle you in.\"}, {'id': 128, 'start': 890.0800170898438, 'end': 895.52001953125, 'text': ' Okay.'}, {'id': 129, 'start': 898.8800048828125, 'end': 900.719970703125, 'text': \" I'm going to start it so she's got heat going on.\"}, {'id': 130, 'start': 902.8800048828125, 'end': 909.52001953125, 'text': ' Got it. Thanks.'}, {'id': 131, 'start': 911.9199829101562, 'end': 913.52001953125, 'text': ' Appreciate you helping out, Mitch.'}, {'id': 132, 'start': 913.52001953125, 'end': 916.3200073242188, 'text': \" I'll meet you back at the office. Head back to the front seat.\"}, {'id': 133, 'start': 917.280029296875, 'end': 918.5599975585938, 'text': \" We'll go through that stuff, too.\"}, {'id': 134, 'start': 918.5599975585938, 'end': 920.9600219726562, 'text': \" Yeah, I'll put it into evidence and stuff.\"}, {'id': 135, 'start': 921.6799926757812, 'end': 923.2000122070312, 'text': \" If you want, I'll do the transport.\"}, {'id': 136, 'start': 924.1599731445312, 'end': 926.3200073242188, 'text': \" I'd appreciate that because I got to write the report.\"}, {'id': 137, 'start': 926.3200073242188, 'end': 927.5999755859375, 'text': \" We'll get it done. We'll get it knocked out.\"}, {'id': 138, 'start': 927.5999755859375, 'end': 929.760009765625, 'text': ' All right, man.'}, {'id': 139, 'start': 930.0, 'end': 937.2000122070312, 'text': ' Okay.'}, {'id': 140, 'start': 942.4000244140625, 'end': 945.6799926757812, 'text': ' All suspects are innocent until proven guilty.'}, {'id': 141, 'start': 945.6799926757812, 'end': 946.6400146484375, 'text': ' Thank you for watching.'}]}"