"{'text': \"The new coronavirus, too small to see, spread quickly from person to person, town to town, and country to country, to all corners of the world. Any one of us can catch it, spread it, and get sick. When a person infected with coronavirus breathes, talks, coughs, or sneezes, tiny droplets with millions of harmful viruses spread into the air and land on everything nearby. Without realizing, the viruses enter our body. We breathe them in. They land in our mouth, nose, and eyes. And we pick them up on our hands, then touch our eyes, nose, or mouth. In these ways, the viruses enter our body and infect us. Most people don't get very sick with coronavirus. We can have this virus and not know it, and easily pass it to others, who pass it to more people. In a few weeks, a whole neighborhood can get infected. Most people who get sick get better on their own, but some, especially the elderly and people who already have illnesses, can get very sick and even die. Coronavirus spreads when people are close together. To protect ourselves and each other, we need to stay away from crowded and enclosed places and keep our distance. Wear a mask to protect others and ourselves. Keep our hands away from our face. Cover our cough or sneeze using our bent elbow. Wash our hands often and well with soap and water. And clean surfaces that are touched often with disinfectant to make them safe. We were careful, but one day my mother got sick with a fever and a constant dry cough. She was very tired and achy. We called the nurse. She said my mother could have coronavirus. Many people in our town were sick with this new virus. My mother needed to stay at home until she was completely well. To keep us safe, she had to wear a mask and stay apart from us. In case we had caught coronavirus from my mother, we had to stay home 14 days so we wouldn't infect more people. A friend brought us food and supplies. We followed the rules. We avoided touching our faces, disinfected surfaces, washed our hands often and kept our distance from each other. We opened windows to let in fresh air and wore masks anytime we were near my mother. Days passed. My mother got well and could no longer spread the virus. We finished our 14 days of staying home. Happily, we all remained healthy. Actions we took at home with our sick mother and when we were out in our community helped stop the spread of coronavirus. You can follow these actions and keep yourself, your family and your community safe too. You can follow these actions and keep yourself, your family and your community safe too.\", 'segments': [{'id': 0, 'start': 0.0, 'end': 16.31999969482422, 'text': ' The new coronavirus, too small to see, spread quickly from person to person, town to town,'}, {'id': 1, 'start': 16.31999969482422, 'end': 20.68000030517578, 'text': ' and country to country, to all corners of the world.'}, {'id': 2, 'start': 20.68000030517578, 'end': 25.399999618530273, 'text': ' Any one of us can catch it, spread it, and get sick.'}, {'id': 3, 'start': 25.399999618530273, 'end': 32.5, 'text': ' When a person infected with coronavirus breathes, talks, coughs, or sneezes, tiny droplets with'}, {'id': 4, 'start': 32.5, 'end': 38.13999938964844, 'text': ' millions of harmful viruses spread into the air and land on everything nearby.'}, {'id': 5, 'start': 38.13999938964844, 'end': 41.7400016784668, 'text': ' Without realizing, the viruses enter our body.'}, {'id': 6, 'start': 41.7400016784668, 'end': 42.7400016784668, 'text': ' We breathe them in.'}, {'id': 7, 'start': 42.7400016784668, 'end': 48.7599983215332, 'text': ' They land in our mouth, nose, and eyes.'}, {'id': 8, 'start': 48.7599983215332, 'end': 55.880001068115234, 'text': ' And we pick them up on our hands, then touch our eyes, nose, or mouth.'}, {'id': 9, 'start': 55.880001068115234, 'end': 61.36000061035156, 'text': ' In these ways, the viruses enter our body and infect us.'}, {'id': 10, 'start': 61.36000061035156, 'end': 65.5999984741211, 'text': \" Most people don't get very sick with coronavirus.\"}, {'id': 11, 'start': 65.5999984741211, 'end': 74.44000244140625, 'text': ' We can have this virus and not know it, and easily pass it to others, who pass it to more people.'}, {'id': 12, 'start': 74.44000244140625, 'end': 78.87999725341797, 'text': ' In a few weeks, a whole neighborhood can get infected.'}, {'id': 13, 'start': 78.87999725341797, 'end': 85.19999694824219, 'text': ' Most people who get sick get better on their own, but some, especially the elderly and'}, {'id': 14, 'start': 85.19999694824219, 'end': 92.41999816894531, 'text': ' people who already have illnesses, can get very sick and even die.'}, {'id': 15, 'start': 92.41999816894531, 'end': 95.22000122070312, 'text': ' Coronavirus spreads when people are close together.'}, {'id': 16, 'start': 95.22000122070312, 'end': 101.12000274658203, 'text': ' To protect ourselves and each other, we need to stay away from crowded and enclosed places'}, {'id': 17, 'start': 101.12000274658203, 'end': 102.95999908447266, 'text': ' and keep our distance.'}, {'id': 18, 'start': 102.95999908447266, 'end': 107.36000061035156, 'text': ' Wear a mask to protect others and ourselves.'}, {'id': 19, 'start': 107.36000061035156, 'end': 110.27999877929688, 'text': ' Keep our hands away from our face.'}, {'id': 20, 'start': 110.27999877929688, 'end': 114.91999816894531, 'text': ' Cover our cough or sneeze using our bent elbow.'}, {'id': 21, 'start': 114.91999816894531, 'end': 121.4800033569336, 'text': ' Wash our hands often and well with soap and water.'}, {'id': 22, 'start': 121.4800033569336, 'end': 127.5199966430664, 'text': ' And clean surfaces that are touched often with disinfectant to make them safe.'}, {'id': 23, 'start': 127.5199966430664, 'end': 134.60000610351562, 'text': ' We were careful, but one day my mother got sick with a fever and a constant dry cough.'}, {'id': 24, 'start': 134.60000610351562, 'end': 137.36000061035156, 'text': ' She was very tired and achy.'}, {'id': 25, 'start': 137.36000061035156, 'end': 139.1999969482422, 'text': ' We called the nurse.'}, {'id': 26, 'start': 139.1999969482422, 'end': 141.8800048828125, 'text': ' She said my mother could have coronavirus.'}, {'id': 27, 'start': 141.8800048828125, 'end': 145.36000061035156, 'text': ' Many people in our town were sick with this new virus.'}, {'id': 28, 'start': 145.36000061035156, 'end': 149.32000732421875, 'text': ' My mother needed to stay at home until she was completely well.'}, {'id': 29, 'start': 149.32000732421875, 'end': 153.89999389648438, 'text': ' To keep us safe, she had to wear a mask and stay apart from us.'}, {'id': 30, 'start': 153.89999389648438, 'end': 159.6999969482422, 'text': ' In case we had caught coronavirus from my mother, we had to stay home 14 days so we'}, {'id': 31, 'start': 159.6999969482422, 'end': 161.86000061035156, 'text': \" wouldn't infect more people.\"}, {'id': 32, 'start': 161.86000061035156, 'end': 166.3000030517578, 'text': ' A friend brought us food and supplies.'}, {'id': 33, 'start': 166.3000030517578, 'end': 167.86000061035156, 'text': ' We followed the rules.'}, {'id': 34, 'start': 167.86000061035156, 'end': 174.4199981689453, 'text': ' We avoided touching our faces, disinfected surfaces, washed our hands often and kept'}, {'id': 35, 'start': 174.4199981689453, 'end': 176.33999633789062, 'text': ' our distance from each other.'}, {'id': 36, 'start': 176.33999633789062, 'end': 187.02000427246094, 'text': ' We opened windows to let in fresh air and wore masks anytime we were near my mother.'}, {'id': 37, 'start': 187.02000427246094, 'end': 189.86000061035156, 'text': ' Days passed.'}, {'id': 38, 'start': 189.86000061035156, 'end': 195.74000549316406, 'text': ' My mother got well and could no longer spread the virus.'}, {'id': 39, 'start': 195.74000549316406, 'end': 198.82000732421875, 'text': ' We finished our 14 days of staying home.'}, {'id': 40, 'start': 198.82000732421875, 'end': 201.97999572753906, 'text': ' Happily, we all remained healthy.'}, {'id': 41, 'start': 202.3800048828125, 'end': 207.74000549316406, 'text': ' Actions we took at home with our sick mother and when we were out in our community helped'}, {'id': 42, 'start': 207.74000549316406, 'end': 210.67999267578125, 'text': ' stop the spread of coronavirus.'}, {'id': 43, 'start': 210.67999267578125, 'end': 216.05999755859375, 'text': ' You can follow these actions and keep yourself, your family and your community safe too.'}, {'id': 44, 'start': 231.97999572753906, 'end': 236.66000366210938, 'text': ' You can follow these actions and keep yourself, your family and your community safe too.'}]}"