"{'text': \"A form of psychosis, that's what Infowars founder Alex Jones is saying, caused him to believe events like the Sandy Hook massacre were staged. During a recent sworn deposition as part of a defamation lawsuit against him, Jones said that the trauma of the media and corporations lying made him believe that everything was a conspiracy. And I myself have almost had a form of psychosis back in the past where I basically thought everything was staged, even though I've now learned a lot of times things aren't staged. So I think as a pundit and someone giving opinion, that my opinions have been wrong, but they were never wrong consciously to hurt people. You remember in the past, Jones' divorce lawyer tried to sell the fact that his on-air persona was just an act. But according to Jones, he was really trying to get at the truth. What I'm getting at is this stuff we're looking at today, kids going in circles, schools closed, emails, EMTs not in the building, porta-potties. These aren't comedy skits. This is journalism. Yes. Well, this is punditry because I wear a journalist hat, punditry hat, satire hat, just reading news. I mean, just being a newsreader, I mean, I do that as well. So I do a lot of things. But when I was covering Sandy Hook, I was genuinely trying to get at the truth of it. Punditry? Put aside the fact that the reality of Sandy Hook is not an opinion. They're real victims, real families that are still struggling with grief. Look, these media provocateurs like Jones, they know that passion sells. That's what this is all about. They need people to pay attention to them. And the best way to do that is to be shocking, many times with disregard of decency and of course good governance. And it worked for Jones. He made a pretty penny off the fringe ideology that he represented on his radio program, carried on more than 160 stations, thousands of listeners. Alex Jones' persona is confirmation of everything I've been saying about the mostly men with microphones, namely that so much of it is just total BS. The only people that I meet, that I see, that I speak with who see the world entirely through conservative lenses or liberal lenses, are talk radio hosts and cable television personalities. Because for the rest of us, the issues are a mixed bag. Conservative on some things, liberal on others. But these media provocateurs like Jones, they present themselves out on the fringes because they know this works. And they are far more interested in lining their own pockets and getting people to pay attention to their websites and their AM talk radio programs and cable TV shows. With the eight lawsuits that he's now facing, it may be a sign that his words are finally catching up with him.\", 'segments': [{'id': 0, 'start': 0.0, 'end': 6.079999923706055, 'text': \" A form of psychosis, that's what Infowars founder Alex Jones is saying, caused him to\"}, {'id': 1, 'start': 6.079999923706055, 'end': 11.079999923706055, 'text': ' believe events like the Sandy Hook massacre were staged.'}, {'id': 2, 'start': 11.079999923706055, 'end': 15.960000038146973, 'text': ' During a recent sworn deposition as part of a defamation lawsuit against him, Jones said'}, {'id': 3, 'start': 15.960000038146973, 'end': 21.600000381469727, 'text': ' that the trauma of the media and corporations lying made him believe that everything was'}, {'id': 4, 'start': 21.600000381469727, 'end': 22.600000381469727, 'text': ' a conspiracy.'}, {'id': 5, 'start': 22.600000381469727, 'end': 29.1200008392334, 'text': ' And I myself have almost had a form of psychosis back in the past where I basically thought'}, {'id': 6, 'start': 29.1200008392334, 'end': 33.20000076293945, 'text': \" everything was staged, even though I've now learned a lot of times things aren't staged.\"}, {'id': 7, 'start': 33.20000076293945, 'end': 39.439998626708984, 'text': ' So I think as a pundit and someone giving opinion, that my opinions have been wrong,'}, {'id': 8, 'start': 39.439998626708984, 'end': 43.599998474121094, 'text': ' but they were never wrong consciously to hurt people.'}, {'id': 9, 'start': 43.599998474121094, 'end': 49.84000015258789, 'text': \" You remember in the past, Jones' divorce lawyer tried to sell the fact that his on-air persona\"}, {'id': 10, 'start': 49.84000015258789, 'end': 51.52000045776367, 'text': ' was just an act.'}, {'id': 11, 'start': 51.52000045776367, 'end': 56.36000061035156, 'text': ' But according to Jones, he was really trying to get at the truth.'}, {'id': 12, 'start': 56.36000061035156, 'end': 61.2400016784668, 'text': \" What I'm getting at is this stuff we're looking at today, kids going in circles, schools closed,\"}, {'id': 13, 'start': 61.2400016784668, 'end': 64.27999877929688, 'text': ' emails, EMTs not in the building, porta-potties.'}, {'id': 14, 'start': 64.27999877929688, 'end': 65.68000030517578, 'text': \" These aren't comedy skits.\"}, {'id': 15, 'start': 65.68000030517578, 'end': 66.68000030517578, 'text': ' This is journalism.'}, {'id': 16, 'start': 66.68000030517578, 'end': 67.68000030517578, 'text': ' Yes.'}, {'id': 17, 'start': 67.68000030517578, 'end': 76.44000244140625, 'text': ' Well, this is punditry because I wear a journalist hat, punditry hat, satire hat, just reading'}, {'id': 18, 'start': 76.44000244140625, 'end': 77.44000244140625, 'text': ' news.'}, {'id': 19, 'start': 77.44000244140625, 'end': 81.4800033569336, 'text': ' I mean, just being a newsreader, I mean, I do that as well.'}, {'id': 20, 'start': 81.4800033569336, 'end': 83.91999816894531, 'text': ' So I do a lot of things.'}, {'id': 21, 'start': 83.91999816894531, 'end': 89.23999786376953, 'text': ' But when I was covering Sandy Hook, I was genuinely trying to get at the truth of it.'}, {'id': 22, 'start': 89.23999786376953, 'end': 90.23999786376953, 'text': ' Punditry?'}, {'id': 23, 'start': 90.23999786376953, 'end': 94.63999938964844, 'text': ' Put aside the fact that the reality of Sandy Hook is not an opinion.'}, {'id': 24, 'start': 94.63999938964844, 'end': 97.76000213623047, 'text': \" They're real victims, real families that are still struggling with grief.\"}, {'id': 25, 'start': 97.76000213623047, 'end': 102.12000274658203, 'text': ' Look, these media provocateurs like Jones, they know that passion sells.'}, {'id': 26, 'start': 102.12000274658203, 'end': 103.55999755859375, 'text': \" That's what this is all about.\"}, {'id': 27, 'start': 103.55999755859375, 'end': 105.83999633789062, 'text': ' They need people to pay attention to them.'}, {'id': 28, 'start': 105.83999633789062, 'end': 111.80000305175781, 'text': ' And the best way to do that is to be shocking, many times with disregard of decency and of'}, {'id': 29, 'start': 111.80000305175781, 'end': 113.73999786376953, 'text': ' course good governance.'}, {'id': 30, 'start': 114.55999755859375, 'end': 115.55999755859375, 'text': ' And it worked for Jones.'}, {'id': 31, 'start': 115.55999755859375, 'end': 119.77999877929688, 'text': ' He made a pretty penny off the fringe ideology that he represented on his radio program,'}, {'id': 32, 'start': 119.77999877929688, 'end': 124.22000122070312, 'text': ' carried on more than 160 stations, thousands of listeners.'}, {'id': 33, 'start': 124.22000122070312, 'end': 130.33999633789062, 'text': \" Alex Jones' persona is confirmation of everything I've been saying about the mostly men with\"}, {'id': 34, 'start': 130.33999633789062, 'end': 134.3800048828125, 'text': ' microphones, namely that so much of it is just total BS.'}, {'id': 35, 'start': 134.3800048828125, 'end': 139.05999755859375, 'text': ' The only people that I meet, that I see, that I speak with who see the world entirely through'}, {'id': 36, 'start': 139.05999755859375, 'end': 145.02000427246094, 'text': ' conservative lenses or liberal lenses, are talk radio hosts and cable television personalities.'}, {'id': 37, 'start': 145.02000427246094, 'end': 147.6999969482422, 'text': ' Because for the rest of us, the issues are a mixed bag.'}, {'id': 38, 'start': 147.6999969482422, 'end': 150.44000244140625, 'text': ' Conservative on some things, liberal on others.'}, {'id': 39, 'start': 150.44000244140625, 'end': 155.05999755859375, 'text': ' But these media provocateurs like Jones, they present themselves out on the fringes because'}, {'id': 40, 'start': 155.05999755859375, 'end': 157.02000427246094, 'text': ' they know this works.'}, {'id': 41, 'start': 157.02000427246094, 'end': 160.4199981689453, 'text': ' And they are far more interested in lining their own pockets and getting people to pay'}, {'id': 42, 'start': 160.4199981689453, 'end': 166.1999969482422, 'text': ' attention to their websites and their AM talk radio programs and cable TV shows.'}, {'id': 43, 'start': 166.1999969482422, 'end': 171.47999572753906, 'text': \" With the eight lawsuits that he's now facing, it may be a sign that his words are finally\"}, {'id': 44, 'start': 171.47999572753906, 'end': 172.24000549316406, 'text': ' catching up with him.'}]}"